{"sections": [{"heading": "1. Introduction", "text": "Mutual information is a fundamental quantity for measuring the relationship between random variables. In data science it has found applications in a wide range of domains and tasks, including biomedical sciences (Maes et al., 1997), blind source separation (BSS, e.g., independent component analysis, Hyvärinen et al., 2004), information bottleneck (IB, Tishby et al., 2000), feature selection (Kwak & Choi, 2002; Peng et al., 2005), and causality (Butte & Kohane, 2000).\nPut simply, mutual information quantifies the dependence of two random variables X and Z. It has the form,\nI(X;Z) = ∫ X×Z log dPXZ dPX ⊗ PZ dPXZ , (1)\nwhere PXZ is the joint probability distribution, and PX =∫ Z dPXZ and PZ = ∫ X dPXZ are the marginals. In con-\n1Montréal Institute for Learning Algorithms (MILA), University of Montréal 2Department of Mathematics and Statistics, McGill University 3Canadian Institute for Advanced Research (CIFAR) 4The Institute for Data Valorization (IVADO). Correspondence to: Mohamed Ishmael Belghazi <ishmael.belghazi@gmail.com>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\ntrast to correlation, mutual information captures non-linear statistical dependencies between variables, and thus can act as a measure of true dependence (Kinney & Atwal, 2014).\nDespite being a pivotal quantity across data science, mutual information has historically been difficult to compute (Paninski, 2003). Exact computation is only tractable for discrete variables (as the sum can be computed exactly), or for a limited family of problems where the probability distributions are known. For more general problems, this is not possible. Common approaches are non-parametric (e.g., binning, likelihood-ratio estimators based on support vector machines, non-parametric kernel-density estimators; see, Fraser & Swinney, 1986; Darbellay & Vajda, 1999; Suzuki et al., 2008; Kwak & Choi, 2002; Moon et al., 1995; Kraskov et al., 2004), or rely on approximate gaussianity of data distribution (e.g., Edgeworth expansion, Van Hulle, 2005). Unfortunately, these estimators typically do not scale well with sample size or dimension (Gao et al., 2014), and thus cannot be said to be general-purpose. Other recent works include Kandasamy et al. (2017); Singh & Pczos (2016); Moon et al. (2017).\nIn order to achieve a general-purpose estimator, we rely on the well-known characterization of the mutual information as the Kullback-Leibler (KL-) divergence (Kullback, 1997) between the joint distribution and the product of the marginals (i.e., I(X;Z) = DKL(PXZ || PX ⊗ PZ)). Recent work uses a dual formulation to cast the estimation of f -divergences (including the KL-divergence, see Nguyen et al., 2010) as part of an adversarial game between competing deep neural networks (Nowozin et al., 2016). This approach is at the cornerstone of generative adversarial networks (GANs, Goodfellow et al., 2014), which train a generative model without any explicit assumptions about the underlying distribution of the data.\nIn this paper we demonstrate that exploiting dual optimization to estimate divergences goes beyond the minimax objective as formalized in GANs. We leverage this strategy to offer a general-purpose parametric neural estimator of mutual information based on dual representations of the KL-divergence (Ruderman et al., 2012), which we show is valuable in settings that do not necessarily involve an adversarial game. Our estimator is scalable, flexible, and completely trainable via back-propagation. The contribu-\ntions of this paper are as follows:\n• We introduce the Mutual Information Neural Estimator (MINE), which is scalable, flexible, and completely trainable via back-prop, as well as provide a thorough theoretical analysis.\n• We show that the utility of this estimator transcends the minimax objective as formalized in GANs, such that it can be used in mutual information estimation, maximization, and minimization.\n• We apply MINE to palliate mode-dropping in GANs and to improve reconstructions and inference in Adversarially Learned Inference (ALI, Dumoulin et al., 2016) on large scale datasets.\n• We use MINE to apply the Information Bottleneck method (Tishby et al., 2000) in a continuous setting, and show that this approach outperforms variational bottleneck methods (Alemi et al., 2016)."}, {"heading": "2. Background", "text": ""}, {"heading": "2.1. Mutual Information", "text": "Mutual information is a Shannon entropy-based measure of dependence between random variables. The mutual information between X and Z can be understood as the decrease of the uncertainty in X given Z:\nI(X;Z) := H(X)−H(X | Z), (2)\nwhere H is the Shannon entropy, and H(X |Z) is the conditional entropy of Z given X . As stated in Eqn. 1 and the discussion above, the mutual information is equivalent to the Kullback-Leibler (KL-) divergence between the joint, PXZ , and the product of the marginals PX ⊗ PZ :\nI(X,Z) = DKL(PXZ || PX ⊗ PZ), (3)\nwhere DKL is defined as1, DKL(P || Q) := EP [ log\ndP dQ\n] . (4)\nwhenever P is absolutely continuous with respect to Q2.\nThe intuitive meaning of Eqn. 3 is clear: the larger the divergence between the joint and the product of the marginals, the stronger the dependence between X and Z. This divergence, hence the mutual information, vanishes for fully independent variables.\n1Although the discussion is more general, we can think of P and Q as being distributions on some compact domain Ω ⊂ Rd, with density p and q respect the Lebesgue measure λ, so that DKL = ∫ p log p\nq dλ.\n2and infinity otherwise."}, {"heading": "2.2. Dual representations of the KL-divergence.", "text": "A key technical ingredient of MINE are dual representations of the KL-divergence. We will primarily work with the Donsker-Varadhan representation (Donsker & Varadhan, 1983), which results in a tighter estimator; but will also consider the dual f -divergence representation (Keziou, 2003; Nguyen et al., 2010; Nowozin et al., 2016).\nThe Donsker-Varadhan representation. The following theorem gives a representation of the KL-divergence (Donsker & Varadhan, 1983):\nTheorem 1 (Donsker-Varadhan representation). The KL divergence admits the following dual representation:\nDKL(P || Q) = sup T :Ω→R EP[T ]− log(EQ[eT ]), (5)\nwhere the supremum is taken over all functions T such that the two expectations are finite.\nProof. See the Supplementary Material.\nA straightforward consequence of Theorem 1 is as follows. Let F be any class of functions T : Ω → R satisfying the integrability constraints of the theorem. We then have the lower-bound3:\nDKL(P || Q) ≥ sup T∈F EP[T ]− log(EQ[eT ]). (6)\nNote also that the bound is tight for optimal functions T ∗ that relate the distributions to the Gibbs density as,\ndP = 1\nZ eT\n∗ dQ, where Z = EQ[eT ∗ ]. (7)\nThe f -divergence representation. It is worthwhile to compare the Donsker-Varadhan representation to the f - divergence representation proposed in Nguyen et al. (2010); Nowozin et al. (2016), which leads to the following bound:\nDKL(P || Q) ≥ sup T∈F EP[T ]− EQ[eT−1]. (8)\nAlthough the bounds in Eqns. 6 and 8 are tight for sufficiently large families F , the Donsker-Varadhan bound is stronger in the sense that, for any fixed T , the right hand side of Eqn. 6 is larger4 than the right hand side of Eqn. 8. We refer to the work by Ruderman et al. (2012) for a derivation of both representations in Eqns. 6 and 8 from the unifying perspective of Fenchel duality. In Section 3 we discuss versions of MINE based on these two representations, and numerical comparisons are performed in Section 4.\n3The bound in Eqn. 6 is known as the compression lemma in the PAC-Bayes literature (Banerjee, 2006).\n4To see this, just apply the identity x ≥ e log x with x = EQ[eT ]."}, {"heading": "3. The Mutual Information Neural Estimator", "text": "In this section we formulate the framework of the Mutual Information Neural Estimator (MINE). We define MINE and present a theoretical analysis of its consistency and convergence properties."}, {"heading": "3.1. Method", "text": "Using both Eqn. 3 for the mutual information and the dual representation of the KL-divergence, the idea is to choose F to be the family of functions Tθ : X ×Z → R parametrized by a deep neural network with parameters θ ∈ Θ. We call this network the statistics network. We exploit the bound:\nI(X;Z) ≥ IΘ(X,Z), (9)\nwhere IΘ(X,Z) is the neural information measure defined as\nIΘ(X,Z) = sup θ∈Θ\nEPXZ [Tθ]− log(EPX⊗PZ [eTθ ]). (10)\nThe expectations in Eqn. 10 are estimated using empirical samples5 from PXZ and PX ⊗ PZ or by shuffling the samples from the joint distribution along the batch axis. The objective can be maximized by gradient ascent.\nIt should be noted that Eqn. 10 actually defines a new class information measures, The expressive power of neural network insures that they can approximate the mutual information with arbitrary accuracy.\nIn what follows, given a distribution P, we denote by P̂(n) as the empirical distribution associated to n i.i.d. samples.\nDefinition 3.1 (Mutual Information Neural Estimator (MINE)). Let F = {Tθ}θ∈Θ be the set of functions parametrized by a neural network. MINE is defined as,\n̂I(X;Z)n = sup θ∈Θ EP(n)XZ [Tθ]− log(EP(n)X ⊗P̂(n)Z [e Tθ ]). (11)\nDetails on the implementation of MINE are provided in Algorithm 1. An analogous definition and algorithm also hold for the f -divergence formulation in Eqn. 8, which we refer to as MINE-f . Since Eqn. 8 lower-bounds Eqn. 6, it generally leads to a looser estimator of the mutual information, and numerical comparisons of MINE with MINE-f can be found in Section 4. However, in a mini-batch setting, the SGD gradients of MINE are biased. We address this in the next section.\n5Note that samples x̄ ∼ PX and z̄ ∼ PZ from the marginals are obtained by simply dropping x, z from samples (x̄, z) and (x, z̄) ∼ PXZ .\nAlgorithm 1 MINE θ ← initialize network parameters repeat\nDraw b minibatch samples from the joint distribution: (x(1), z(1)), . . . , (x(b), z(b)) ∼ PXZ Draw n samples from the Z marginal distribution: z̄(1), . . . , z̄(b) ∼ PZ Evaluate the lower-bound: V(θ)← 1\nb ∑b i=1 Tθ(x (i),z(i))− log( 1 b ∑b i=1 e Tθ(x (i),z̄(i)))\nEvaluate bias corrected gradients (e.g., moving average): Ĝ(θ)← ∇̃θV(θ) Update the statistics network parameters: θ ← θ + Ĝ(θ)\nuntil convergence"}, {"heading": "3.2. Correcting the bias from the stochastic gradients", "text": "A naive application of stochastic gradient estimation leads to the gradient estimate:\nĜB = EB [∇θTθ]− EB [∇θTθ eTθ ]\nEB [eTθ ] . (12)\nwhere, in the second term, the expectations are over the samples of a minibatch B, leads to a biased estimate of the full batch gradient6.\nFortunately, the bias can be reduced by replacing the estimate in the denominator by an exponential moving average. For small learning rates, this improved MINE gradient estimator can be made to have arbitrarily small bias. We found in our experiments that this improves all-around performance of MINE."}, {"heading": "3.3. Theoretical properties", "text": "In this section we analyze the consistency and convergence properties of MINE. All the proofs can be found in the Supplementary Material."}, {"heading": "3.3.1. CONSISTENCY", "text": "MINE relies on a choice of (i) a statistics network and (ii) n samples from the data distribution PXZ .\nDefinition 3.2 (Strong consistency). The estimator ̂I(X;Z)n is strongly consistent if for all > 0, there exists a positive integer N and a choice of statistics network such that:\n∀n ≥ N, |I(X,Z)− ̂I(X;Z)n| ≤ , a.e. where the probability is over a set of samples.\n6From the optimization point of view, the f -divergence formulation has the advantage of making the use of SGD with unbiased gradients straightforward.\nIn a nutshell, the question of consistency is divided into two problems: an approximation problem related to the size of the family, F , and an estimation problem related to the use of empirical measures. The first problem is addressed by universal approximation theorems for neural networks (Hornik, 1989). For the second problem, classical consistency theorems for extremum estimators apply (Van de Geer, 2000) under mild conditions on the parameter space.\nThis leads to the two lemmas below. The first lemma states that the neural information measures IΘ(X,Z), defined in Eqn. 10, can approximate the mutual information with arbitrary accuracy:\nLemma 1 (approximation). Let > 0. There exists a neural network parametrizing functions Tθ with parameters θ in some compact domain Θ ⊂ Rk, such that\n|I(X,Z)− IΘ(X,Z)| ≤ , a.e.\nThe second lemma states the almost sure convergence of MINE to a neural information measure as the number of samples goes to infinity:\nLemma 2 (estimation). Let > 0. Given a family of neural network functions Tθ with parameters θ in some bounded domain Θ ⊂ Rk, there exists an N ∈ N, such that\n∀n ≥ N, | ̂I(X;Z)n − IΘ(X,Z) |≤ , a.e. (13)\nCombining the two lemmas with the triangular inequality, we have,\nTheorem 2. MINE is strongly consistent."}, {"heading": "3.3.2. SAMPLE COMPLEXITY", "text": "In this section we discuss the sample complexity of our estimator. Since the focus here is on the empirical estimation problem, we assume that the mutual information is well enough approximated by the neural information measure IΘ(X,Z). The theorem below is a refinement of Lemma 2: it gives how many samples we need for an empirical estimation of the neural information measure at a given accuracy and with high confidence.\nWe make the following assumptions: the functions Tθ are M -bounded (i.e., |Tθ| ≤M ) and L-Lipschitz with respect to the parameters θ. The domain Θ ⊂ Rd is bounded, so that ‖θ‖ ≤ K for some constant K. The theorem below shows a sample complexity of Õ ( d log d 2 ) , where d is the\ndimension of the parameter space.\nTheorem 3. Given any values , δ of the desired accuracy and confidence parameters, we have,\nPr ( | ̂I(X;Z)n − IΘ(X,Z)| ≤ ) ≥ 1− δ, (14)\nwhenever the number n of samples satisfies\nn ≥ 2M 2(d log(16KL\n√ d/ ) + 2dM + log(2/δ))\n2 .\n(15)"}, {"heading": "4. Empirical comparisons", "text": "Before diving into applications, we perform some simple empirical evaluation and comparisons of MINE. The objective is to show that MINE is effectively able to estimate mutual information and account for non-linear dependence."}, {"heading": "4.1. Comparing MINE to non-parametric estimation", "text": "We compare MINE and MINE-f to the k-NN-based nonparametric estimator found in Kraskov et al. (2004). In our experiment, we consider multivariate Gaussian random variables, Xa and Xb, with componentwise correlation, corr(Xia, X j b ) = δij ρ, where ρ ∈ (−1, 1) and δij is Kronecker’s delta. As the mutual information is invariant to continuous bijective transformations of the considered variables, it is enough to consider standardized Gaussians marginals. We also compare MINE (using the DonskerVaradhan representation in Eqn. 6) and MINE-f (based on the f -divergence representation in Eqn. 8).\nOur results are presented in Figs. 1. We observe that both MINE and Kraskov’s estimation are virtually indistinguishable from the ground truth when estimating the mutual information between bivariate Gaussians. MINE shows marked improvement over Krakov’s when estimating the mutual information between twenty dimensional random variables. We also remark that MINE provides a tighter estimate of the mutual information than MINE-f ."}, {"heading": "4.2. Capturing non-linear dependencies", "text": "An important property of mutual information between random variables with relationship Y = f(X)+σ , where f is a deterministic non-linear transformation and is random noise, is that it is invariant to the deterministic nonlinear transformation, but should only depend on the amount of noise, σ . This important property, that guarantees the quantification dependence without bias for the relationship,\nis called equitability (Kinney & Atwal, 2014). Our results (Fig. 2) show that MINE captures this important property."}, {"heading": "5. Applications", "text": "In this section, we use MINE to present applications of mutual information and compare to competing methods designed to achieve the same goals. Specifically, by using MINE to maximize the mutual information, we are able to improve mode representation and reconstruction of generative models. Finally, by minimizing mutual information, we are able to effectively implement the information bottleneck in a continuous setting."}, {"heading": "5.1. Maximizing mutual information to improve GANs", "text": "Mode collapse (Che et al., 2016; Dumoulin et al., 2016; Donahue et al., 2016; Salimans et al., 2016; Metz et al., 2017; Saatchi & Wilson, 2017; Nguyen et al., 2017; Lin et al., 2017; Ghosh et al., 2017) is a common pathology of generative adversarial networks (GANs, Goodfellow et al., 2014), where the generator fails to produces samples with sufficient diversity (i.e., poorly represent some modes).\nGANs as formulated in Goodfellow et al. (2014) consist of two components: a discriminator, D : X → [0, 1] and a generator, G : Z → X , where X is a domain such as a compact subspace of Rn. Given Z ∈ Z follows some simple prior distribution (e.g., a spherical Gaussian with density, PZ ), the goal of the generator is to match its output distribution to a target distribution, PX (specified by the data samples). The discriminator and generator are optimized through the value function,\nmin G max D V (D,G) :=\nEPX [D(X)] + EPZ [log (1−D(G(Z))]. (16)\nA natural approach to diminish mode collapse would be regularizing the generator’s loss with the neg-entropy of the samples. As the sample entropy is intractable, we propose to use the mutual information as a proxy.\nFollowing Chen et al. (2016), we write the prior as the concatenation of noise and code variables, Z = [ , c].\nWe propose to palliate mode collapse by maximizing the mutual information between the samples and the code. I(G([ , c]); c) = H(G([ , c])) − H(G([ , c]) | c). The generator objective then becomes,\narg max G\nE[log(D(G([ , c])))] + βI(G([ , c]); c). (17)\nAs the samples G([ , c]) are differentiable w.r.t. the parameters of G, and the statistics network being a differentiable function, we can maximize the mutual information using back-propagation and gradient ascent by only specifying this additional loss term. Since the mutual information is theoretically unbounded, we use adaptive gradient clipping (see the Supplementary Material) to ensure that the generator receives learning signals similar in magnitude from the discriminator and the statistics network.\nRelated works on mode-dropping Methods to address mode dropping in GANs can readily be found in the literature. Salimans et al. (2016) use mini-batch discrimination. In the same spirit, Lin et al. (2017) successfully mitigates mode dropping in GANs by modifying the discriminator to make decisions on multiple real or generated samples. Ghosh et al. (2017) uses multiple generators that are encouraged to generate different parts of the target distribution. Nguyen et al. (2017) uses two discriminators to minimize the KL and reverse KL divergences between the target and generated distributions. Che et al. (2016) learns a reconstruction distribution, then teach the generator to sample from it, the intuition being that the reconstruction distribution is a de-noised or smoothed version of the data distribution, and thus easier to learn. Srivastava et al. (2017) minimizes the reconstruction error in the latent space of bi-directional GANs (Dumoulin et al., 2016; Donahue et al., 2016). Metz et al. (2017) includes many steps of the discriminator’s optimization as part of the generator’s objective. While Chen et al. (2016) maximizes the mutual information between the code and the samples, it does so by minimizing a variational upper bound on the conditional entropy (Barber & Agakov, 2003) therefore ignoring the entropy of the samples. Chen et al. (2016) makes no claim about mode-dropping.\nExperiments: Spiral, 25-Gaussians datasets We apply MINE to improve mode coverage when training a generative adversarial network (GAN, Goodfellow et al., 2014). We demonstrate using Eqn. 17 on the spiral and the 25- Gaussians datasets, comparing two models, one with β = 0 (which corresponds to the orthodox GAN as in Goodfellow et al. (2014)) and one with β = 1.0, which corresponds to mutual information maximization.\nOur results on the spiral (Fig. 3) and the 25-Gaussians (Fig. 4) experiments both show improved mode coverage over the baseline with no mutual information objective. This\nconfirms our hypothesis that maximizing mutual information helps against mode-dropping in this simple setting.\nExperiment: Stacked MNIST Following Che et al. (2016); Metz et al. (2017); Srivastava et al. (2017); Lin et al. (2017), we quantitatively assess MINE’s ability to diminish mode dropping on the stacked MNIST dataset which is constructed by stacking three randomly sampled MNIST digits. As a consequence, stacked MNIST offers 1000 modes. Using the same architecture and training protocol as in Srivastava et al. (2017); Lin et al. (2017), we train a GAN on the constructed dataset and use a pre-trained classifier on 26,000 samples to count the number of modes in the samples, as well as to compute the KL divergence between the sample and expected data distributions. Our results in Table 1 demonstrate the effectiveness of MINE in preventing mode collapse on Stacked MNIST."}, {"heading": "5.2. Maximizing mutual information to improve inference in bi-directional adversarial models", "text": "Adversarial bi-directional models were introduced in Adversarially Learned Inference (ALI, Dumoulin et al., 2016) and BiGAN (Donahue et al., 2016) and are an extension of GANs which incorporate a reverse model, F : X → Z jointly trained with the generator. These models formulate the problem in terms of the value function in Eqn. 16 between two joint distributions, p(x, z) = p(z | x)p(x) and q(x, z) = q(x | z)p(z) induced by the forward (encoder)\nand reverse (decoder) models, respectively7.\nOne goal of bi-directional models is to do inference as well as to learn a good generative model. Reconstructions are one desirable property of a model that does both inference and generation, but in practice ALI can lack fidelity (i.e., reconstructs less faithfully than desired, see Li et al., 2017; Ulyanov et al., 2017; Belghazi et al., 2018). To demonstrate the connection to mutual information, it can be shown (see the Supplementary Material for details) that the reconstruction error,R, is bounded by,\nR ≤ DKL(q(x, z) || p(x, z))− Iq(x, z) +Hq(z) (18)\nIf the joint distributions are matched,Hq(z) tends toHp(z), which is fixed as long as the prior, p(z), is itself fixed. Subsequently, maximizing the mutual information minimizes the expected reconstruction error.\nAssuming that the generator is the same as with GANs in the previous section, the objectives for training a bi-directional adversarial model then become:\narg max D\nEq(x,z)[logD(x, z)] + Ep(x,z)[log (1−D(x, z))]\narg max F,G\nEq(x,z)[log (1−D(x, z))] + Ep(x,z)[logD(x, z)]\n+ βIq(x, z). (19)\nRelated works Ulyanov et al. (2017) improves reconstructions quality by forgoing the discriminator and expressing the adversarial game between the encoder and decoder. Kumar et al. (2017) augments the bi-directional objective by considering the reconstruction and the corresponding encodings as an additional fake pair. Belghazi et al. (2018) shows that a Markovian hierarchical generator in a bi-directional adversarial model provide a hierarchy of\n7We switch to density notations for convenience throughout this section.\nreconstructions with increasing levels of fidelity (increasing reconstruction quality). Li et al. (2017) shows that the expected reconstruction error can be diminished by minimizing the conditional entropy of the observables given the latent representations. The conditional entropy being intractable for general posterior, Li et al. (2017) proposes to augment the generator’s loss with an adversarial cycle consistency loss (Zhu et al., 2017) between the observables and their reconstructions. Experiment: ALI+MINE In this section we compare MINE to existing bi-directional adversarial models. As the decoder’s density is generally intractable, we use three different metrics to measure the fidelity of the reconstructions with respect to the samples; (i) the euclidean reconstruction error, (ii) reconstruction accuracy, which is the proportion of labels preserved by the reconstruction as identified by a pre-trained classifier; (iii) the Multi-scale structural similarity metric (MS-SSIM, Wang et al., 2004) between the observables and their reconstructions.\nWe train MINE on datasets of increasing order of complexity: a toy dataset composed of 25-Gaussians, MNIST (LeCun, 1998), and the CelebA dataset (Liu et al., 2015). Fig. 6 shows the reconstruction ability of MINE compared to ALI. Although ALICE does perfect reconstruction (which is in its explicit formulation), we observe significant mode-dropping in the sample space. MINE does a balanced job of reconstructing along with capturing all the modes of the underlying data distribution.\nNext, we measure the fidelity of the reconstructions over ALI, ALICE, and MINE. Tbl. 2 compares MINE to the existing baselines in terms of euclidean reconstruction errors, reconstruction accuracy, and MS-SSIM. On MNIST, MINE outperforms ALI in terms of reconstruction errors by a good margin and is competitive to ALICE with respect to reconstruction accuracy and MS-SSIM. Our results show that MINE’s effect on reconstructions is even more dramatic when compared to ALI and ALICE on the CelebA dataset."}, {"heading": "5.3. Information Bottleneck", "text": "The Information Bottleneck (IB, Tishby et al., 2000) is an information theoretic method for extracting relevant infor-\nModel Recons.Error Recons. Acc.(%) MS-SSIM\nMNIST\nALI 14.24 45.95 0.97 ALICE(l2) 3.20 99.03 0.97 ALICE(Adv.) 5.20 98.17 0.98 MINE 9.73 96.10 0.99\nCelebA\nmation, or yielding a representation, that an input X ∈ X contains about an output Y ∈ Y . An optimal representation of X would capture the relevant factors and compress X by diminishing the irrelevant parts which do not contribute to the prediction of Y . IB was recently covered in the context of deep learning (Tishby & Zaslavsky, 2015), and as such can be seen as a process to construct an approximation of the minimally sufficient statistics of the data. IB seeks an encoder, q(Z | X), that induces the Markovian structure X → Z → Y . This is done by minimizing the IB Lagrangian,\nL[q(Z | X)] = H(Y |Z) + βI(X,Z), (20)\nwhich appears as a standard cross-entropy loss augmented with a regularizer promoting minimality of the representation (Achille & Soatto, 2017). Here we propose to estimate the regularizer with MINE.\nRelated works In the discrete setting, (Tishby et al., 2000) uses the Blahut-Arimoto Algorithm (Arimoto, 1972), which\n(a) ALI (b) ALICE (l2) (c) ALICE (A) (d) ALI+MINE Figure 6. Reconstructions and model samples from adversarially learned inference (ALI) and variations intended to increase improve reconstructions. Shown left to right are the baseline (ALI), ALICE with the l2 loss to minimize the reconstruction error, ALICE with an adversarial loss, and ALI+MINE. Top to bottom are the reconstructions and samples from the priors. ALICE with the adversarial loss has the best reconstruction, though at the expense of poor sample quality, where as ALI+MINE captures all the modes of the data in sample space.\ncan be understood as cyclical coordinate ascent in function spaces. While IB is successful and popular in a discrete setting, its application to the continuous setting was stifled by the intractability of the continuous mutual information. Nonetheless, IB was applied in the case of jointly Gaussian random variables in (Chechik et al., 2005).\nIn order to overcome the intractability of I(X;Z) in the continuous setting, Alemi et al. (2016); Kolchinsky et al. (2017); Chalk et al. (2016) exploit the variational bound of Barber & Agakov (2003) to approximate the conditional entropy in I(X;Z). These approaches differ only on their treatment of the marginal distribution of the bottleneck variable: Alemi et al. (2016) assumes a standard multivariate normal marginal distribution, Chalk et al. (2016) uses a Student-t distribution, and Kolchinsky et al. (2017) uses non-parametric estimators. Due to their reliance on a variational approximation, these methods require a tractable density for the approximate posterior, while MINE does not. Experiment: Permutation-invariant MNIST classification Here, we demonstrate an implementation of the IB objective on permutation invariant MNIST using MINE. We compare to the Deep Variational Bottleneck (DVB, Alemi et al., 2016) and use the same empirical setup. As the DVB relies on a variational bound on the conditional entropy, it therefore requires a tractable density. Alemi et al. (2016) opts for a conditional Gaussian encoder z = µ(x) + σ , where ∼ N (0, I). As MINE does not require a tractable density, we consider three type of encoders: (i) a Gaussian encoder as in Alemi et al. (2016); (ii) an additive noise encoder, z = enc(x+ σ ); and (iii) a propagated noise encoder, z = enc([x, ]). Our results can be seen in Tbl. 3, and this shows MINE as being superior in these settings."}, {"heading": "6. Conclusion", "text": "We proposed a mutual information estimator, which we called the mutual information neural estimator (MINE), that is scalable in dimension and sample-size. We demonstrated\nthe efficiency of this estimator by applying it in a number of settings. First, a term of mutual information can be introduced alleviate mode-dropping issue in generative adversarial networks (GANs, Goodfellow et al., 2014). Mutual information can also be used to improve inference and reconstructions in adversarially-learned inference (ALI, Dumoulin et al., 2016). Finally, we showed that our estimator allows for tractable application of Information bottleneck methods (Tishby et al., 2000) in a continuous setting."}, {"heading": "7. Acknowledgements", "text": "We would like to thank Martin Arjovsky, Caglar Gulcehre, Marcin Moczulski, Negar Rostamzadeh, Thomas Boquet, Ioannis Mitliagkas, Pedro Oliveira Pinheiro for helpful comments, as well as Samsung and IVADO for their support."}], "year": 2018, "references": [{"title": "Emergence of invariance and disentanglement in deep representations", "authors": ["A. Achille", "S. Soatto"], "venue": "arXiv preprint 1706.01350v2[cs.LG],", "year": 2017}, {"title": "Deep variational information bottleneck", "authors": ["A.A. Alemi", "I. Fischer", "J.V. Dillon", "K. Murphy"], "venue": "arXiv preprint arXiv:1612.00410,", "year": 2016}, {"title": "An algorithm for computing the capacity of arbitrary discrete memoryless channels", "authors": ["S. Arimoto"], "venue": "IEEE Transactions on Information Theory,", "year": 1972}, {"title": "On baysian bounds", "authors": ["A. Banerjee"], "venue": "ICML, pp", "year": 2006}, {"title": "The im algorithm: a variational approach to information maximization", "authors": ["D. Barber", "F. Agakov"], "venue": "In Proceedings of the 16th International Conference on Neural Information Processing Systems,", "year": 2003}, {"title": "Hierarchical adversarially learned inference", "authors": ["M.I. Belghazi", "S. Rajeswar", "O. Mastropietro", "J. Mitrovic", "N. Rostamzadeh", "A. Courville"], "venue": "arXiv preprint arXiv:1802.01071,", "year": 2018}, {"title": "Mutual information relevance networks: functional genomic clustering using pairwise entropy measurements", "authors": ["A.J. Butte", "I.S. Kohane"], "venue": "In Pac Symp Biocomput,", "year": 2000}, {"title": "Relevant sparse codes with variational information bottleneck", "authors": ["M. Chalk", "O. Marre", "G. Tkacik"], "venue": "In Advances in Neural Information Processing Systems,", "year": 2016}, {"title": "Mode regularized generative adversarial networks", "authors": ["T. Che", "Y. Li", "A.P. Jacob", "Y. Bengio", "W. Li"], "venue": "arXiv preprint arXiv:1612.02136,", "year": 2016}, {"title": "Information bottleneck for gaussian variables", "authors": ["G. Chechik", "A. Globerson", "N. Tishby", "Y. Weiss"], "venue": "Journal of Machine Learning Research,", "year": 2005}, {"title": "Infogan: Interpretable representation learning by information maximizing generative adversarial nets", "authors": ["X. Chen", "Y. Duan", "R. Houthooft", "J. Schulman", "I. Sutskever", "P. Abbeel"], "venue": "In Advances in Neural Information Processing Systems,", "year": 2016}, {"title": "Estimation of the information by an adaptive partitioning of the observation space", "authors": ["G.A. Darbellay", "I. Vajda"], "venue": "IEEE Transactions on Information Theory,", "year": 1999}, {"title": "Adversarial feature learning", "authors": ["J. Donahue", "P. Krähenbühl", "T. Darrell"], "venue": "arXiv preprint arXiv:1605.09782,", "year": 2016}, {"title": "Asymptotic evaluation of certain markov process expectations for large time, iv", "authors": ["M. Donsker", "S. Varadhan"], "venue": "Communications on Pure and Applied Mathematics,", "year": 1983}, {"title": "Adversarially learned inference", "authors": ["V. Dumoulin", "I. Belghazi", "B. Poole", "A. Lamb", "M. Arjovsky", "O. Mastropietro", "A. Courville"], "venue": "arXiv preprint arXiv:1606.00704,", "year": 2016}, {"title": "Independent coordinates for strange attractors from mutual information", "authors": ["A.M. Fraser", "H.L. Swinney"], "venue": "Physical review A,", "year": 1986}, {"title": "Efficient estimation of mutual information for strongly dependent variables", "authors": ["S. Gao", "G. Ver Steeg", "A. Galstyan"], "venue": "Arxiv preprint arXiv:1411.2003[cs.IT],", "year": 2014}, {"title": "Multi-agent diverse generative adversarial networks", "authors": ["A. Ghosh", "V. Kulharia", "V. Namboodiri", "P.H. Torr", "P.K. Dokania"], "venue": "arXiv preprint arXiv:1704.02906,", "year": 2017}, {"title": "Generative adversarial nets", "authors": ["I. Goodfellow", "J. Pouget-Abadie", "M. Mirza", "B. Xu", "D. WardeFarley", "S. Ozair", "A. Courville", "Y. Bengio"], "venue": "In Advances in neural information processing systems,", "year": 2014}, {"title": "Multilayer feedforward networks are universal approximators", "authors": ["K. Hornik"], "venue": "Neural Networks,", "year": 1989}, {"title": "Independent component analysis, volume 46", "authors": ["A. Hyvärinen", "J. Karhunen", "E. Oja"], "year": 2004}, {"title": "Nonparametric von mises estimators for entropies, divergences and mutual informations", "authors": ["K. Kandasamy", "A. Krishnamurthy", "B. Poczos", "L. Wasserman", "J. Robins"], "year": 2017}, {"title": "Equitability, mutual information, and the maximal information coefficient", "authors": ["J.B. Kinney", "G.S. Atwal"], "venue": "Proceedings of the National Academy of Sciences,", "year": 2014}, {"title": "Nonlinear information bottleneck", "authors": ["A. Kolchinsky", "B.D. Tracey", "D.H. Wolpert"], "venue": "arXiv preprint arXiv:1705.02436,", "year": 2017}, {"title": "Estimating mutual information", "authors": ["A. Kraskov", "H. Stögbauer", "P. Grassberger"], "venue": "Physical review E,", "year": 2004}, {"title": "Information theory and statistics", "authors": ["S. Kullback"], "venue": "Courier Corporation,", "year": 1997}, {"title": "Improved semisupervised learning with gans using manifold invariances", "authors": ["A. Kumar", "P. Sattigeri", "P.T. Fletcher"], "venue": "arXiv preprint arXiv:1705.08850,", "year": 2017}, {"title": "Input feature selection by mutual information based on parzen window", "authors": ["N. Kwak", "Choi", "C.-H"], "venue": "IEEE transactions on pattern analysis and machine intelligence,", "year": 2002}, {"title": "The mnist database of handwritten digits. http://yann", "authors": ["Y. LeCun"], "venue": "lecun. com/exdb/mnist/,", "year": 1998}, {"title": "Towards understanding adversarial learning for joint distribution matching", "authors": ["C. Li", "H. Liu", "C. Chen", "Y. Pu", "L. Chen", "R. Henao", "L. Carin"], "venue": "arXiv preprint arXiv:1709.01215,", "year": 2017}, {"title": "Pacgan: The power of two samples in generative adversarial networks", "authors": ["Z. Lin", "A. Khetan", "G. Fanti", "S. Oh"], "venue": "arXiv preprint arXiv:1712.04086,", "year": 2017}, {"title": "Deep learning face attributes in the wild", "authors": ["Z. Liu", "P. Luo", "X. Wang", "X. Tang"], "venue": "In Proceedings of the IEEE International Conference on Computer Vision, pp", "year": 2015}, {"title": "Multimodality image registration by maximization of mutual information", "authors": ["F. Maes", "A. Collignon", "D. Vandermeulen", "G. Marchal", "P. Suetens"], "venue": "IEEE transactions on Medical Imaging,", "year": 1997}, {"title": "Unrolled generative adversarial networks. 2017", "authors": ["L. Metz", "B. Poole", "D. Pfau", "J. Sohl-Dickstein"], "venue": "URL https: //openreview.net/pdf?id=BydrOIcle", "year": 2017}, {"title": "Ensemble estimation of mutual information", "authors": ["K. Moon", "K. Sricharan", "A.O. Hero III"], "venue": "arXiv preprint arXiv:1701.08083,", "year": 2017}, {"title": "Estimation of mutual information using kernel density estimators", "authors": ["Moon", "Y.-I", "B. Rajagopalan", "U. Lall"], "venue": "Physical Review E,", "year": 1995}, {"title": "Dual discriminator generative adversarial nets", "authors": ["T. Nguyen", "T. Le", "H. Vu", "D. Phung"], "venue": "In Advances in Neural Information Processing Systems,", "year": 2017}, {"title": "Estimating divergence functionals and the likelihood ratio by convex risk minimization", "authors": ["X. Nguyen", "M.J. Wainwright", "M.I. Jordan"], "venue": "IEEE Transactions on Information Theory,", "year": 2010}, {"title": "f-gan: Training generative neural samplers using variational divergence minimization", "authors": ["S. Nowozin", "B. Cseke", "R. Tomioka"], "venue": "In Advances in Neural Information Processing Systems,", "year": 2016}, {"title": "Estimation of entropy and mutual information", "authors": ["L. Paninski"], "venue": "Neural computation,", "year": 2003}, {"title": "Feature selection based on mutual information criteria of max-dependency, max-relevance, and min-redundancy", "authors": ["H. Peng", "F. Long", "C. Ding"], "venue": "IEEE Transactions on pattern analysis and machine intelligence,", "year": 2005}, {"title": "Regularizing neural networks by penalizing confident output distributions", "authors": ["G. Pereyra", "G. Tucker", "J. Chorowski", "Ł. Kaiser", "G. Hinton"], "venue": "ICLR Workshop,", "year": 2017}, {"title": "Unsupervised representation learning with deep convolutional generative adversarial networks", "authors": ["A. Radford", "L. Metz", "S. Chintala"], "venue": "arXiv preprint arXiv:1511.06434,", "year": 2015}, {"title": "Tighter variational representations of f-divergences via restriction to probability measures", "authors": ["A. Ruderman", "M. Reid", "D. Garcı́a-Garcı́a", "J. Petterson"], "venue": "arXiv preprint arXiv:1206.4664,", "year": 2012}, {"title": "Bayesian gan", "authors": ["Y. Saatchi", "A.G. Wilson"], "venue": "In Advances in Neural Information Processing Systems,", "year": 2017}, {"title": "Improved techniques for training gans", "authors": ["T. Salimans", "I.J. Goodfellow", "W. Zaremba", "V. Cheung", "A. Radford", "X. Chen"], "venue": "arXiv preprint arXiv:1606.03498,", "year": 2016}, {"title": "Finite-sample analysis of fixed-k nearest neighbor density functional estimators", "authors": ["S. Singh", "B. Pczos"], "venue": "arXiv preprint 1606.01554,", "year": 2016}, {"title": "Veegan: Reducing mode collapse in gans using implicit variational learning", "authors": ["A. Srivastava", "L. Valkov", "C. Russell", "M. Gutmann", "C. Sutton"], "venue": "arXiv preprint arXiv:1705.07761,", "year": 2017}, {"title": "Approximating mutual information by maximum likelihood density ratio estimation. In New challenges for feature selection in data mining and knowledge discovery", "authors": ["T. Suzuki", "M. Sugiyama", "J. Sese", "T. Kanamori"], "year": 2008}, {"title": "Deep learning and the information bottleneck principle", "authors": ["N. Tishby", "N. Zaslavsky"], "venue": "In Information Theory Workshop (ITW),", "year": 2015}, {"title": "The information bottleneck method", "authors": ["N. Tishby", "F.C. Pereira", "W. Bialek"], "venue": "arXiv preprint physics/0004057,", "year": 2000}, {"title": "Empirical Processes in M-estimation", "authors": ["S. Van de Geer"], "year": 2000}, {"title": "Edgeworth approximation of multivariate differential entropy", "authors": ["M.M. Van Hulle"], "venue": "Neural computation,", "year": 2005}, {"title": "Image quality assessment: from error visibility to structural similarity", "authors": ["Z. Wang", "A.C. Bovik", "H.R. Sheikh", "E.P. Simoncelli"], "venue": "IEEE transactions on image processing,", "year": 2004}, {"title": "Unpaired image-toimage translation using cycle-consistent adversarial networks", "authors": ["Zhu", "J.-Y", "T. Park", "P. Isola", "A.A. Efros"], "venue": "arXiv preprint arXiv:1703.10593,", "year": 2017}], "id": "SP:c3955d74f2a084a8ddcbd7e73952c326e81804b2", "authors": [{"name": "Mohamed Ishmael Belghazi", "affiliations": []}, {"name": "Aristide Baratin", "affiliations": []}, {"name": "Sai Rajeswar", "affiliations": []}, {"name": "Sherjil Ozair", "affiliations": []}, {"name": "Yoshua Bengio", "affiliations": []}, {"name": "Aaron Courville", "affiliations": []}, {"name": "R Devon Hjelm", "affiliations": []}], "abstractText": "We argue that the estimation of mutual information between high dimensional continuous random variables can be achieved by gradient descent over neural networks. We present a Mutual Information Neural Estimator (MINE) that is linearly scalable in dimensionality as well as in sample size, trainable through back-prop, and strongly consistent. We present a handful of applications on which MINE can be used to minimize or maximize mutual information. We apply MINE to improve adversarially trained generative models. We also use MINE to implement the Information Bottleneck, applying it to supervised classification; our results demonstrate substantial improvement in flexibility and performance in these settings.", "title": "Mutual Information Neural Estimation"}