{"sections": [{"text": "In this work, we study the robust subspace tracking (RST) problem and obtain one of the first two provable guarantees for it. The goal of RST is to track sequentially arriving data vectors that lie in a slowly changing low-dimensional subspace, while being robust to corruption by additive sparse outliers. It can also be interpreted as a dynamic (time-varying) extension of robust PCA (RPCA), with the minor difference that RST also requires a short tracking delay. We develop a recursive projected compressive sensing algorithm that we call Nearly Optimal RST via ReProCS (ReProCS-NORST) because its tracking delay is nearly optimal. We prove that NORST solves both the RST and the dynamic RPCA problems under weakened standard RPCA assumptions, two simple extra assumptions (slow subspace change and most outlier magnitudes lower bounded), and a few minor assumptions.\nOur guarantee shows that NORST enjoys a near optimal tracking delay of O(r log n log(1/ )). Its required delay between subspace change times is the same, and its memory complexity is n times this value. Thus both these are also nearly optimal. Here n is the ambient space dimension, r is the subspaces’ dimension, and is the tracking accuracy. NORST also has the best outlier tolerance compared with all previous RPCA or RST methods, both theoretically and empirically (including for real videos), without requiring any model on how the outlier support is generated. This is possible because of the extra assumptions it uses."}, {"heading": "1 Introduction", "text": "Principal Components Analysis (PCA) is one of the most widely used dimension reduction techniques. It finds a small number of orthogonal basis vectors, called principal components, along which most of the variability of the dataset lies. According to its modern definition [3], robust PCA (RPCA) is the problem of decomposing a given data matrix into the sum of a low-rank matrix (true data) and a sparse matrix (outliers). The column space of the low-rank matrix then gives the desired principal subspace (PCA solution). A common application of RPCA is in video analytics in separating a video into a slow-changing background image sequence (modeled as a low-rank matrix) and a foreground image sequence consisting of moving objects or people (sparse) [3]. Robust Subspace Tracking (RST) can be simply interpreted as a time-varying extension of RPCA. It assumes that the true data lies in a low-dimensional subspace that can change with time, albeit slowly. The goal is to track this changing subspace over time in the presence of additive sparse outliers. The offline version of this problem can be called dynamic (or time-varying) RPCA. RST requires the tracking delay to be small, while dynamic RPCA does not. Time-varying subspace is a more appropriate model for long data sequences, e.g., long surveillance videos, since if a\n∗A shorter version of this manuscript [1] will be presented at ICML, 2018. Another small part, Corollary 5.18, will appear\nin [2].\nar X\niv :1\n71 2.\n06 06\n1v 4\n[ cs\n.I T\n] 6\nJ ul\n2 01\nsingle subspace model is used the resulting matrix may not be sufficiently low-rank. Moreover the RST problem setting (short tracking delay) is most relevant for applications where real-time or near real-time estimates are needed, e.g., video-based surveillance (object tracking) [4], monitoring seismological activity [5], or detection of anomalous behavior in dynamic social networks [6].\nIn recent years, RPCA has since been extensively studied. Many fast and provably correct approaches now exist: PCP introduced in [3] and studied in [3, 7, 8], AltProj [9], RPCA-GD [10] and NO-RMC [11]. There is much lesser work on provable dynamic RPCA and RST: original-ReProCS [12, 13, 14] for dynamic RPCA and simple-ReProCS [15] for both. The subspace tracking (ST) problem (without outliers), and with or without missing data, has been studied for much longer in [16, 17, 18, 19]. However, all existing guarantees for it only consider the statistically stationary setting of data being generated from a single unknown subspace. Of course, the most general nonstationary model that allows the subspace to change at each time is not even identifiable since at least r data points are needed to compute an r-dimensional subspace even in the no noise or missing entries case.\nIn this work, we make the subspace tracking problem identifiable by assuming a piecewise constant model on subspace change. We show that it is possible to track the changing subspace to within accuracy as long as the subspace remains constant for at least O(r log n log(1/ )) time instants, and some other assumptions hold. This is more than r by only log factors. Here n is the ambient space dimension.\nNotation. We use the interval notation [a, b] to refer to all integers between a and b, inclusive, and we use [a, b) := [a, b − 1]. ‖.‖ denotes the l2 norm for vectors and induced l2 norm for matrices unless specified otherwise, and ′ denotes transpose. We use MT to denote a sub-matrix of M formed by its columns indexed by entries in the set T . For a matrix P we use P (i) to denote its i-th row. In our algorithm statements, we use L̂t;α := [ ˆ̀t−α+1, · · · , ˆ̀t] and SV Dr[M ] to refer to the matrix of top of r left singular vectors of the matrix M . A matrix P with mutually orthonormal columns is referred to as a basis matrix and is used to represent the subspace spanned by its columns. For basis matrices P1,P2, we use SE(P1,P2) := ‖(I − P1P1′)P2‖ as a measure of Subspace Error (distance) between their respective subspaces. This is equal to the sine of the largest principal angle between the subspaces. It is also called “projection distance” [20]. If P1 and P2 are of the same dimension, SE(P1,P2) = SE(P2,P1).\nWe reuse the letters C, c to denote different numerical constants in each use. Robust Subspace Tracking (RST) and Dynamic RPCA Problem Setting. At each time t,\nwe get a data vector yt ∈ Rn that satisfies\nyt := `t + xt + νt, for t = 1, 2, . . . , d\nwhere νt is small unstructured noise, xt is the sparse outlier vector, and `t is the true data vector that lies in a fixed or slowly changing low-dimensional subspace of Rn, i.e., `t = P(t)at where P(t) is an n× r basis matrix with r n and with ‖(I − P(t−1)P(t−1)′)P(t)‖ small compared to ‖P(t)‖ = 1. We use Tt to denote the support set of xt. Given an initial subspace estimate, P̂0, the goal is to track span(P(t)) and `t either immediately or within a short delay. A by-product is that `t, xt, and Tt can also be tracked on-the-fly. The initial subspace estimate, P̂0, can be computed by applying any of the existing RPCA solutions, e.g., PCP or AltProj, for the first roughly r data points, i.e., for Y[1,ttrain], with ttrain = Cr.\nDynamic RPCA is the offline version of the above problem. Define matrices L,X,W ,Y with L = [`1, `2, . . . `d] and Y ,X,W similarly defined. The goal is to recover the matrix L and its column space with error. We use rL to denote the rank of L. The maximum fraction of nonzeros in any row (column) of the outlier matrix X is denoted by max-outlier-frac-row (max-outlier-frac-col).\nIdentifiability and other assumptions. The above problem definition does not ensure identifiability since either of L or X can be both low-rank and sparse. Moreover, if the subspace changes at every time, it is impossible to correctly estimate all the subspaces. One way to ensure that L is not sparse is by requiring that its left and right singular vectors are dense (non-sparse) or “incoherent” w.r.t. a sparse vector [3, 8, 9].\nDefinition 1.1. An n× r basis matrix P is µ-incoherent if maxi=1,2,..,n ‖P (i)‖22 ≤ µr/n. Here µ is called the coherence parameter. It quantifies the non-denseness of P .\nA simple way to ensure that X is not low-rank is by imposing upper bounds on max-outlier-frac-row and max-outlier-frac-col [8, 9]. One way to ensure identifiability of the changing subspaces is to assume that they are piecewise constant:\nP(t) = Pj for all t ∈ [tj , tj+1), j = 1, 2, . . . , J,\nand to lower bound tj+1 − tj . Let t0 = 1 and tJ+1 = d. With this model, rL = rJ in general (except if subspace directions are repeated). The union of the column spans of all the Pj ’s is equal to the span of the left singular vectors of L. Thus, assuming that the Pj ’s are µ-incoherent implies their incoherence. We also assume that the subspace coefficients at are mutually independent over time, have identical and diagonal covariance matrices denoted by Λ, and are element-wise bounded. Element-wise bounded-ness of at’s, along with the statistical assumptions, is similar to incoherence of right singular vectors of L (right incoherence); see Remark 3.5. Because tracking requires an online algorithm that processes data vectors one at a time or in mini-batches, we need these statistical assumptions on the at’s. For the same reason, we also need to re-define max-outlier-frac-row as the maximum fraction of nonzeroes in any row of any α-consecutive-column sub-matrix of X. Here α is the mini-batch size used by the RST algorithm. We will refer to it as max-outlier-frac-rowα to indicate this difference.\nContributions. (1) We develop a recursive projected compressive sensing (ReProCS) algorithm for RST that we call Nearly Optimal RST via ReProCS (ReProCS-NORST) because its tracking delay is nearly optimal. We will refer to it as just “NORST” in the sequel. NORST has a significantly improved (and simpler) subspace update step compared to all previous ReProCS-based methods. Our most important contribution is one of the first two provable guarantees for RST, and the first that ensures near optimal tracking delay, needs a near optimal lower bound on how long a subspace should remain constant, and needs minimal assumptions on subspace change. Moreover, our guarantee also shows that NORST is online (after initialization), fast (has the same complexity as vanilla r-SVD), and has memory complexity of order nr log n log(1/ ). Here “online” means the following. After each subspace change, the algorithm detects the change in at most 2α = Cf2r log n time instants, and after that, it improves the subspace estimate every α time instants1. The improvement after each step is exponential and thus, one can get an -accurate estimate within K = C log(1/ ) such steps. Offline NORST also provably solves dynamic RPCA.\n(2) Our guarantees for both NORST and offline NORST (Theorem 2.2) essentially hold under “weakened” standard RPCA assumptions and two simple extra assumptions: (i) slow subspace change and (ii) a lower bound on most outlier magnitudes. (i) is a natural assumption for static camera videos (with no sudden scene changes) and (ii) is also easy because, by definition, an “outlier” is a large magnitude corruption. The small magnitude ones get classified as νt. Besides these, we also need that at’s are mutually independent, have identical and diagonal covariance matrix Λ, and are element-wise bounded. Element-wise bounded-ness, along with the statistical assumptions on at, is similar to right incoherence of L; see Remark 3.5. For the initial Cr samples, NORST needs the outlier fractions to be O(1/r) (needed to apply AltProj). As explained in Sec. 2.3, the extra assumptions help ensure that, after initialization, NORST can tolerate a constant maximum fraction of outliers per row in any α-column-sub-matrix of the data matrix without assuming any outlier support generation model. This statement assumes that the condition number of the covariance of at is a constant (with n). As is evident from Table 1, this\n1The reason that just O(r logn) samples suffice for each update is because we assume that the at’s are element-wise bounded, νt is very small and with effective dimension r or smaller (see Theorem 2.2). These, along with the specific structure of the PCA problem we encounter (noise/error seen by the PCA step depends on the `t’s and thus has “effective dimension” r), is why so few samples suffice.\nis better than what all existing RPCA approaches can tolerate. For the video application, this implies that NORST tolerates slow moving and occasionally static foreground objects much better than all other approaches. This is also corroborated by our experiments on real videos, e.g., see Fig 1 and Sec. 6.\n(3) Unlike simple-ReProCS [15] or original-ReProCS [12, 13, 14], NORST needs only a coarse initialization which can be computed using just C log r iterations of any batch RPCA method such as AltProj applied to Cr initial samples. In fact, if the outlier magnitudes were very large for an initial set of O(r log n log r) time instants, or if the outliers were absent for this much time, even a random initialization would suffice. This simple fact has two important implications. First, NORST with the subspace change detection step removed also provides an online, fast, memory-efficient, and provably correct approach for static RPCA (our problem with J = 1, i.e., with `t = Pat). The other online solution for such a problem is ORPCA which comes with only a partial guarantee [21] (the guarantee requires intermediate algorithm estimates to be satisfying certain properties). Moreover, a direct corollary of our result is a guarantee that a minor modification of NORST-random (NORST with random initialization) also solves the subspace tracking with missing data (ST-missing) and the dynamic matrix completion (MC) problems. All existing guarantees for ST-missing [18, 19] hold only for the case of a single unknown subspace and are only partial guarantees. From the MC perspective, NORST-random does not assume any model on the set of observed entries. However, the tradeoff is that it needs many more observed entries. Both these results are given in Sec. 5.\nPaper Organization. The rest of the paper is organized as follows. In Sec. 2 we explain the main ideas of the NORST algorithm and present our main result for it (Theorem 2.2). We also discuss the implications of our guarantee, and provide detailed comparison with related work. In Sec. 3, we give the complete NORST algorithm and carefully explain the subspace change detection approach. In Sec. 4, we give the proof outline, the three main lemmas leading to the proof of Theorem 2.2, then also prove the lemmas. In Sec. 5, we provide useful corollaries for (a) Static RPCA, (b) Subspace Tracking with missing entries and (c) a simple extension to recover the guarantee of s-ReProCS from [15]. Empirical evaluation on synthetic and real-world datasets is described in Sec. 6. The complete proof of Theorem 2.2, of two auxiliary lemmas, and of the extensions is given in the Appendix."}, {"heading": "2 NORST Algorithm and Main Result", "text": ""}, {"heading": "2.1 NORST: Nearly-Optimal RST", "text": "NORST starts with a “good” estimate of the initial subspace. This can be obtained by C log r iterations2 of AltProj applied to Y[1,ttrain] with ttrain = Cr. It then iterates between (a) Projected Compressive\n2Using C log r iterations helps ensure that the initialization error is O(1/ √ r).\nSensing (CS) / Robust Regression3 in order to estimate the sparse outliers, xt’s, and hence the `t’s, and (b) Subspace Update to update the subspace estimate P̂(t). Projected CS proceeds as follows. At time t, if the previous subspace estimate, P̂(t−1), is accurate enough, because of slow subspace change, projecting yt onto its orthogonal complement will nullify most of `t. We compute ỹt := Ψyt where Ψ := I − P̂(t−1)P̂(t−1)′. Thus, ỹt = Ψxt + Ψ(`t + νt) and ‖Ψ(`t + νt)‖ is small due to slow subspace change and small νt. Recovering xt from ỹt is now a CS / sparse recovery problem in small noise [22]. We compute x̂t,cs using noisy l1 minimization followed by thresholding based support estimation to obtain T̂t. A Least Squares (LS) based debiasing step on T̂t returns the final x̂t. We then estimate `t as ˆ̀t = yt− x̂t. The ˆ̀t’s are then used for the Subspace Update step which involves (i) detecting subspace change, and (ii) obtaining improved estimates of the new subspace by K steps of r-SVD, each done with a new set of α samples of ˆ̀t. While this step is designed under the piecewise constant subspace assumption (needed for identifiability of P(t)’s), if the goal is only to get good estimates of `t or xt, the method works even when this assumption may not hold, e.g., for real videos. For ease of understanding, we present a basic version of NORST in Algorithm 1. This assumes the change times tj are known. The actual algorithm, that we study and implement, detects these automatically. It is given as Algorithm 2 in Sec. 3."}, {"heading": "2.2 Main Result", "text": "Before stating the result, we precisely define max-outlier-frac-col and max-outlier-frac-rowα. Since NORST is an online approach that performs outlier support recovery one data vector at a time, it needs different bounds on both. Let max-outlier-frac-col := maxt |Tt|/n. We define max-outlier-frac-rowα as the maximum fraction of outliers (nonzeros) per row of any sub-matrix of X with α consecutive columns. To understand\nthis precisely, for a time interval, J , define γ(J ) := maxi=1,2,...,n 1|J | ∑ t∈J 1{i∈Tt} where 1S is the indicator\nfunction for statement S. Thus, ∑\nt∈J 1{i∈Tt} counts the number of outliers (nonzeros) in row i of XJ ,\nand so γ(J ) is the maximum outlier fraction in any row of the sub-matrix XJ of X. Let J α denote a time interval of duration α. Then max-outlier-frac-rowα := maxJ α⊆[1,d] γ(J α).\nWe use t̂j to denote the time instant at which the j-th subspace change time is detected by Algorithm\n2.\nTheorem 2.2. Consider Algorithm 2 given in the next section. Let α := Cf2r log n, Λ := E[a1a1′], λ+ := λmax(Λ), λ − := λmin(Λ), f := λ +/λ−, and let xmin := mint mini∈Tt(xt)i denote the minimum outlier magnitude. Pick an ε ≤ min(0.01, 0.03 minj SE(Pj−1,Pj)2/f). Let K := C log(1/ε). If\n1. Pj’s are µ-incoherent; and at’s are zero mean, mutually independent over time t, have identical\ncovariance matrices, i.e. E[atat′] = Λ, are element-wise uncorrelated (Λ is diagonal), are elementwise bounded (for a numerical constant η, (at) 2 i ≤ ηλi(Λ)), and are independent of all outlier supports Tt;\n2. ‖νt‖2 ≤ cr‖E[νtνt′]‖, ‖E[νtνt′]‖ ≤ cε2λ−, νt’s are zero mean, mutually independent, and independent of xt, `t;\n3. max-outlier-frac-col ≤ c1/µr, max-outlier-frac-rowα ≤ b0 := c2f2 ;\n4. subspace change: let ∆ := maxj SE(Pj−1,Pj), assume that\n3Robust Regression (with a sparsity model on the outliers) assumes that observed data vector y satisfies y = P̂ a+x+ b where P̂ is a tall matrix (given), a is the vector of (unknown) regression coefficients, x is the (unknown) sparse outliers, b is (unknown) small noise/modeling error. An obvious way to solve this is by solving mina,x λ‖x‖1 + ‖y − P̂ a− x‖2. In this, one can solve for a in closed form to get â = P̂ ′(y−x). Substituting this, the minimization simplifies to minx λ‖x‖1 +‖(I− P̂ P̂ ′)(y − x)‖2. This is equivalent to the Lagrangian version of the projected CS problem that NORST solves (see line 7 of Algorithm 1).\n(a) tj+1 − tj > (K + 2)α, and (b) ∆ ≤ 0.8 and C1 √ rλ+(∆ + 2ε) ≤ xmin;\n5. initialization4: SE(P̂0,P0) ≤ 0.25, C1 √ rλ+SE(P̂0,P0) ≤ xmin;\nand (6) algorithm parameters are set as given in Algorithm 2; then, with probability (w.p.) at least 1− 10dn−10,\nSE(P̂(t),P(t)) ≤  (ε+ ∆) if t ∈ [tj , t̂j + α), (0.3)k−1(ε+ ∆) if t ∈ [t̂j + (k − 1)α, t̂j + kα), ε if t ∈ [t̂j +Kα+ α, tj+1).\nTreating f as a numerical constant, the memory complexity is O(nα) = O(nr log n) and time complexity is O(ndr log(1/ε)).\nCorollary 2.3. Under Theorem 2.2 assumptions, the following also hold:\n1. ‖x̂t − xt‖ = ‖ ˆ̀t − `t‖ ≤ 1.2(SE(P̂(t),P(t)) + ε)‖`t‖ with SE(P̂(t),P(t)) bounded as above,\n2. at all times, t, T̂t = Tt,\n3. tj ≤ t̂j ≤ tj + 2α,\n4. Offline-NORST (last few lines of Algorithm 2): SE(P̂ offline(t) ,P(t)) ≤ ε, ‖x̂ offline t −xt‖ = ‖ ˆ̀ offline t −\n`t‖ ≤ ε‖`t‖ at all t. Its memory complexity is O(Knα) = O(nr log n log(1/ε)).\nRemark 2.4 (Relaxing outlier magnitudes lower bound). The assumption on xmin (outlier magnitudes) required by Theorem 2.2 can be significantly relaxed to the following which only requires that most outlier magnitudes are lower bounded. Assume that the outlier magnitudes are such that the following holds: xt can be split as xt = (xt)small + (xt)large with the two components being such that, in the k-th subspace\nupdate interval 5, ‖(xt)small‖ ≤ 0.3k−1(ε + ∆) √ rλ+ and the smallest nonzero entry of (xt)large is larger\nthan C1 · 0.3k−1(ε + ∆) √ rλ+. For the case of j = 0, we need the bound to hold with ∆ replaced by ∆init = SE(P̂0,P0), and ε replaced by zero.\nIf there were a way to bound the element-wise error of the CS step (instead of the l2 norm error), one\ncould relax the above requirement even more.\nDiscussion. This discussion assumes that f is a constant (does not increase with n), i.e., it is O(1). Theorem 2.2 shows that, with high probability (whp), when using NORST, the subspace change gets detected within a delay of at most 2α = Cf2(r log n) time instants, and the subspace gets estimated to ε error within at most (K + 2)α = Cf2(r log n) log(1/ε) time instants. The same is also true for the recovery error of xt and `t. Both the detection and tracking delay are within log factors of the optimal since r is the minimum delay needed even in the noise-free, i..e, xt = νt = 0, case. The fact that NORST can detect subspace change within a short delay can be an important feature for certain applications, e.g., this feature is used in [6] to detect structural changes in a dynamic social network. Moreover, if offline processing is allowed, we can guarantee recovery within normalized error ε at all time instants. This implies that offline-NORST solves the dynamic RPCA problem.\nObserve that Theorem 2.2 allows a constant maximum fraction of outliers per row (after initialization), without making any assumption on how the outlier support is generated, as long as the extra assumptions\n4This can be satisfied by applying C log r iterations of AltProj [9] on the first Cr data samples and assuming that these have outlier fractions in any row or column bounded by c/r. 5k-th subspace update interval refers to Jk := [t̂j + (k − 1)α, t̂j + kα) for k > 1 and J1 = [tj , t̂j + α) for k = 1. The first interval also includes the subspace detection interval, [tj , t̂j), since the analysis of the projected CS step for this interval is the same as for [t̂j , t̂j + α).\nAlgorithm 1 Basic-NORST (with tj known). The actual algorithm that detects tj automatically is Algorithm 2. Obtain P̂0 by C(log r) iterations of AltProj on Y[1,ttrain] with ttrain = Cr followed by SVD on the output L̂.\n1: Input: yt, Output: x̂t, ˆ̀t, P̂(t), T̂t 2: Parameters: K ← C log(1/ε), α← Cf2r log n, ωsupp ← xmin/2, ξ ← xmin/15, r 3: Initialize: j ← 1, k ← 1 P̂(ttrain) ← P̂0 4: for t > ttrain do 5: Ψ← I − P̂(t−1)P̂(t−1)′ 6: ỹt ← Ψyt. 7: x̂t,cs ← arg minx̃ ‖x̃‖1 s.t. ‖ỹt −Ψx̃‖ ≤ ξ. 8: T̂t ← {i : |x̂t,cs| > ωsupp}. 9: x̂t ← IT̂t(ΨT̂t ′ΨT̂t) −1ΨT̂t ′ỹt.\n10: ˆ̀t ← yt − x̂t. 11: if t = tj + kα− 1 then 12: P̂j,k ← SV Dr[L̂t;α], P̂(t) ← P̂j,k, k ← k + 1. 13: else 14: P̂(t) ← P̂(t−1). 15: end if 16: if t = tj +Kα− 1 then 17: P̂j ← P̂(t), k ← 1, j ← j + 1 18: end if 19: end for\nProjected-CS\n(Robust\nRegression).\nSubspace\nUpdate.\ndiscussed below hold. We explain why this is possible in Sec. 2.3. Of course, for the initial Cr samples, NORST needs max-outlier-frac-rowCr ∈ O(1/r) (needed to apply AltProj). Also, the memory complexity guaranteed by Theorem 2.2 is nearly d/r times better than that of all existing RPCA solutions; see Table 1. The time complexity is worse than that of only NO-RMC6, but NO-RMC needs d ≥ cn (unreasonable requirement for videos which often have much fewer frames d than the image size n). Finally, NORST also needs outlier fraction per column to be O(1/r) instead of O(1/rL). If J is large, e.g. if J = d/(r log n), it is possible that rL r. We should clarify that NORST allows max-outlier-frac-rowα ∈ O(1) but this does not necessarily imply that the number of outliers in each row can be this high. The reason is it only allows the fraction per column to only be O(1/r). Thus, for a matrix of size n × α, it allows the total number of outliers to be O(min(nα, nα/r)) = O(nα/r). Thus the average fraction allowed is only O(1/r).\nNORST needs the following extra assumptions. The main extra requirement is that xmin be lower bounded as given in the last two assumptions of Theorem 2.2, or as stated in Remark 2.4. The lower bound on xmin is reasonable 7 as long as the initial subspace estimate is accurate enough and the subspace changes slowly enough so that both ∆ and SE(P̂0,P0) are O(1/ √ r). This requirement may seem restrictive on first glance but actually is not. The reason is that SE(.) is only measuring the largest principal angle. This bound on SE still allows the chordal distance between the two subspaces to be O(1). Chordal distance [20] is the l2 norm of the vector containing the sine of all principal angles. The second related extra requirement is an upper bound on ∆ (slow subspace change) which depends on the value of xmin. We discuss this point next. Other than these two, NORST only needs simple statistical assumptions on\n6NO-RMC is so fast because it is actually a robust matrix completion solution and it deliberately undersamples the entire\ndata matrix Y to get a faster RPCA algorithm. 7requires xmin to be C √ λ+ or larger.\nat’s. The zero-mean assumption is a minor one. The assumption that Λ be diagonal is also minor 8. In the video setting, zero-mean can be ensured by subtracting the empirical average of the background images computing using the first ttrain frames. Mutual independence of at’s holds if the changes in each background image w.r.t. a “mean” background are independent, when conditioned on their subspace. This is valid, for example, if the background changes are due to illumination variations or due to moving curtains (see Fig. 5). Moreover, by using the approach of [14], it is possible to relax this to just requiring that the at’s satisfy an autoregressive model over time. Element-wise boundedness, along with the above, is similar to right incoherence (see Remark 3.5).\nOutlier v/s Subspace Assumptions. When there are fewer outliers in the data or when outliers are easy to detect, one would expect to need weaker assumptions on the true data’s subspace and/or on its rate of change. This is indeed true. The max-outlier-frac-col bound relates max-outlier-frac-col to µ (not-denseness parameter) and r (subspace dimension). The upper bound on ∆ implies that, if xmin is\n8It only implies that Pj is the matrix of principal components of E[LjL′j ] where Lj := [`tj , `tj+1, . . . , `tj+1−1].\nlarger (outliers are easier to detect), a larger amount of subspace change ∆ can be tolerated. The relation of max-outlier-frac-row to rate of subspace change is not evident from the way the guarantee is stated above because we have assumed max-outlier-frac-row ≤ b0 := c/f2 with c being a numerical constant, and used this to get a simple expression for K. If we did not do this, we would get K = Cd 1− log(√b0f) log( c∆ 0.8ε)e, see Remark A.1. Since we need tj+1 − tj ≥ (K + 2)α, a smaller b0 means a larger ∆ can be tolerated for the same delay, or vice versa.\nAlgorithm Parameters. Algorithm 2 assumes knowledge of 4 model parameters: r, λ+, λ− and xmin to set the algorithm parameters. The initial dataset used for estimating P̂0 (using AltProj) can be used to get an accurate estimate of r, λ− and λ+ using standard techniques. Thus one really only needs to set xmin. If continuity over time is assumed, we can let it be time-varying and set it as mini∈T̂t−1 |(x̂t−1)i| at t.\nRelated Work. For a summary of comparisons, see Table 1. In terms of other solutions for provably correct RST or dynamic RPCA, there is very little work. For RST, there is only one other provable algorithm, simple-ReProCS (s-ReProCS) [15]. This has the same tracking delay and memory complexity as NORST, however, it assumes that only one subspace direction can change at each change time. This is a more restrictive model than ours. Moreover, it implies that the tracking delay of s-ReProCS is r-times sub-optimal. Also, s-ReProCS uses a projection-SVD step for subspace update (as opposed to simple SVD in NORST). These two facts imply that it needs an -accurate subspace initialization in order to ensure that the later changed subspaces can be tracked with -accuracy. Thus, it does not provide a static RPCA or subspace tracking with missing data solution.\nFor dynamic RPCA, the earliest result was a partial guarantee (a guarantee that depended on intermediate algorithm estimates satisfying certain assumptions) for the original reprocs approach (originalReProCS) [12]. This was followed up by two complete guarantees for reprocs-based approaches with minor modifications [13, 14]. For simplicity we will still call these “original-ReProCS”. These guarantees needed very strong assumptions and their tracking delay was O(nr2/ 2). Since can be very small, this factor can be quite large, and hence one cannot claim that original-ReProCS solves RST. Our work is a very significant improvement over all these works. (i) The guaranteed memory complexity, tracking delay, and required delay between subspace change times of NORST are all r/ 2 times lower than that of original-ReProCS. (ii) All the original-ReProCS guarantees needed a very specific assumption on how the outlier support could change. They required an outlier support model inspired by a video moving object that moves in one direction for a long time; and whenever it moves, it must move by a fraction of s := maxt |Tt|. This is very specific model with the requirement of moving by a fraction of s being the most restrictive. Our result removes this model and replaces it with just a bound on max-outlier-frac-row. We explain in the last para of Sec. 4.1 why this is possible. (iii) The subspace change model assumed in [13, 14] required a few new directions, that were orthogonal to Pj−1, to be added at time tj and some others to be removed. This is an unrealistic model for slow subspace change, e.g., in 3D, it implies that the subspace needs to change from the x-y plane to the y-z plane. Moreover because of this model, their results needed the “energy” (eigenvalues) along the newly added directions to be small for a period of time after each subspace change. This is a strong (and not easy to interpret) requirement. Our result removes all these requirements and replaces them with a bound on SE(Pj−1,Pj) which is much more realistic. Thus, in 3D, our result allows the x-y plane to change to a slightly tilted x-y plane.\nAn approach called modified-PCP (mod-PCP) was proposed to solve the problem of RPCA with partial subspace knowledge [23]. A corollary of its guarantee shows that it can also be used to solve dynamic RPCA [23]. However, since it adapted the PCP proof techniques from [3], its pros and cons are similar to those of PCP, e.g., it also needs a uniformly randomly generated outlier support. As can be seen from Table 1, its pros and cons are similar to those of the PCP result by [3] (PCP(C)) discussed below.\nWe also provide a comparison with provably correct RPCA approaches in Table 1. In summary,\nNORST has significantly better memory complexity than all of them, all of which are batch; it has the best outlier tolerance (after initialization), and the second-best time complexity, as long as its extra assumptions hold. It can also detect subspace change quickly, which can be a useful feature. Consider outlier tolerance. PCP(H), AltProj, RPCA-GD, and NO-RMC need both max-outlier-frac-row and max-outlier-frac-col to be O(1/rL); PCP(C) [3] and modified-PCP [23] need the outlier support to uniformly random (strong requirement: for video it implies that objects are very small sized and jumping around randomly); and original-ReProCS needs it to satisfy a very specific moving object model described above (restrictive). Instead, after initialization, NORST only needs max-outlier-frac-rowα ∈ O(1) and max-outlier-frac-col ∈ O(1/r)."}, {"heading": "2.3 The need for extra assumptions", "text": "As noted in [9], the standard RPCA problem (that only assumes left and right incoherence of L and nothing else) cannot tolerate a bound on outlier fractions in any row or any column that is larger than 1/rL 9. The reason NORST can tolerate a constant max-outlier-frac-rowα bound is because it uses extra assumptions. We explain the need for these here. It recovers xt first and then `t and does this at each time t. When recovering xt, it exploits “good” knowledge of the subspace of `t (either from initialization or from the previous subspace’s estimate and slow subspace change), but it has no way to deal with the residual error, bt := (I − P̂(t−1)P̂(t−1)′)`t, in this knowledge. Since the individual vector bt does not have any structure that can exploited10, the error in recovering xt cannot be lower than C‖bt‖. This means that, to correctly recover the support of xt, xmin needs to be larger than C‖bt‖. This is where the xmin lower bound comes from. As we will see in Sec. 4, correct support recovery is needed to ensure that the subspace estimate can be improved with each update. In particular, it helps ensure that the error vectors et := xt− x̂t in a given subspace update interval are mutually independent, when conditioned on the yt’s from all past intervals. This step also uses element-wise boundedness of the at’s along with their mutual independence and identical covariances."}, {"heading": "3 Automatic NORST", "text": "We present the actual NORST algorithm (automatic NORST) in Algorithm 2. The main idea why automatic NORST works is the same as that of the basic algorithm with the exception of the additional subspace detection step. The subspace detection idea is borrowed from [15], although its correctness proof has differences because we assume a much simpler subspace change model. In Algorithm 2, the subspace update stage toggles between the “detect” phase and the “update” phase. It starts in the “update” phase with t̂0 = ttrain. We then perform K r-SVD steps with the k-th one done at t = t̂0 + kα − 1. Each such step uses the last α estimates, i.e., uses L̂t;α. Thus at t = t̂0 + Kα − 1, the subspace update of P0 is complete. At this point, the algorithm enters the “detect” phase.\nFor any j, if the j-th subspace change is detected at time t, we set t̂j = t. At this time, the algorithm enters the “update” (subspace update) phase. We then perform K r-SVD steps with the k-th r-SVD step done at t = t̂j + kα− 1 (instead of at t = tj + kα− 1). Each such step uses the last α estimates, i.e., uses 9The reason is this: let b0 = max-outlier-frac-row, one can construct a matrix X with b0 outliers in some rows that has rank equal to 1/b0. A simple way to do this would be to let the support and nonzero entries of X be constant for b0d columns before letting either of them change. Then the rank of X will be d/(b0d). A similar argument can be used for max-outlier-frac-col. 10However the bt’s arranged into a matrix do form a low-rank matrix whose approximate rank is r or even lower (if not all directions change). If we try to exploit this structure we end up with a modified-PCP [23] type approach. This needs the uniform random support assumption (used in its guarantee). Or, if the [8] approach were used for its guaratee, for identifiability reasons similar to the one described above, it will still not tolerate outlier fractions larger than 1/rnew where rnew is the (approximate) rank of the matrix formed by the bt’s.\nAlgorithm 2 Automatic-NORST. Obtain P̂0 by C(log r) iterations of AltProj on Y[1,ttrain] with ttrain = Cr followed by SVD on the output L̂.\n1: Input: P̂0, yt, Output: x̂t, ˆ̀t, P̂(t) 2: Parameters: K ← C log(1/ε), α← Cf2r log n, ωsupp ← xmin/2, ξ ← xmin/15, ωevals ← 2ε2λ+, r. 3: P̂(ttrain) ← P̂0; j ← 1, k ← 1 4: phase← update; t̂0 ← ttrain; 5: for t > ttrain do 6: Lines 5− 10 of Algorithm 1 7: if phase = detect and t = t̂j−1,fin + uα then 8: Φ← (I − P̂j−1P̂j−1′). 9: B ← ΦL̂t,α\n10: if λmax(BB ′) ≥ αωevals then 11: phase← update, t̂j ← t, 12: end if 13: end if 14: if phase = update then 15: if t = t̂j + uα− 1 for u = 1, 2, · · · , then 16: P̂j,k ← SV Dr[L̂t;α], P̂(t) ← P̂j,k, k ← k + 1. 17: else 18: P̂(t) ← P̂(t−1) 19: end if 20: if t = t̂j +Kα− 1 then 21: t̂j,fin ← t, P̂j ← P̂(t) 22: k ← 1, j ← j + 1, phase← detect. 23: end if 24: end if 25: end for 26: Offline NORST: At t = t̂j +Kα, for all t ∈ [t̂j−1 +Kα, t̂j +Kα− 1], 27: P̂ offline(t) ← [P̂j−1, (I − P̂j−1P̂j−1 ′)P̂j ] 28: Ψ← I − P̂ offline(t) P̂ offline (t) ′ 29: x̂offlinet ← IT̂t(ΨT̂t ′ΨT̂t) −1ΨT̂t ′yt 30: ˆ̀offlinet ← yt − x̂offlinet .\nProjected CS.\nSubspace\nDetect Phase.\nSubspace\nUpdate Phase.\nOffline\nNORST.\nL̂t;α Thus, at t = t̂j,fin = t̂j + Kα − 1, the update is complete. At this time, the algorithm enters the “detect” phase again.\nTo understand the change detection strategy, consider the j-th subspace change. Assume that the previous subspace Pj−1 has been accurately estimated by t = t̂j−1,fin = t̂j−1 +Kα−1 and that t̂j−1,fin < tj . Let P̂j−1 denote this estimate. At this time, the algorithm enters the “detect” phase in order to detect the next (j-th) change. Let Bt := (I − P̂j−1P̂j−1′)L̂t;α. For every t = t̂j−1,fin + uα− 1, u = 1, 2, . . . , we detect change by checking if the maximum singular value of Bt is above a pre-set threshold, √ ωevalsα, or not.\nWe claim that, whp, under assumptions of Theorem 2.2, this strategy has no “false subspace detections” and correctly detects change within a delay of at most 2α samples. The former is true because, for any t for which [t − α + 1, t] ⊆ [t̂j−1,fin, tj), all singular values of the matrix Bt will be close to\nzero (will be of order ε √ λ+) and hence its maximum singular value will be below √ ωevalsα. Thus, whp, t̂j ≥ tj . To understand why the change is correctly detected within 2α samples, first consider t = t̂j−1,fin + d tj−t̂j−1,fin α eα := tj,∗. Since we assumed that t̂j−1,fin < tj (the previous subspace update is complete before the next change), tj lie in the interval [tj,∗ − α + 1, tj,∗]. Thus, not all of the `t’s in this interval lie in the new subspace. Depending on where in the interval tj lies, the algorithm may or may not detect the change at this time. However, in the next interval, i.e., for t ∈ [tj,∗ + 1, tj,∗ + α], all of the `t’s lie in the new subspace. We can prove that Bt for this time t will have maximum singular value that is above the threshold. Thus, if the change is not detected at tj,∗, whp, it will get detected at tj,∗ + α. Hence one can show that, whp, either t̂j = tj,∗, or t̂j = tj,∗ + α, i.e., tj ≤ t̂j ≤ tj + 2α (see Appendix A). Time complexity. Consider initialization. To ensure that SE(P̂0,P0) ∈ O(1/ √ r), we need to use C log r iterations of AltProj. Since there is no lower bound in the AltProj guarantee on the required number of matrix columns (except the trivial lower bound of rank) [9], we can use ttrain = Cr frames for initialization. Thus the initialization complexity is O(nttrainr 2 log( √ r) = O(nr3 log r) [9]. The projectedCS step complexity is equal to the cost of a matrix vector multiplication with the measurement matrix times negative logarithm of the desired accuracy in solving the l1 minimization problem. Since the measurement matrix for the CS step is I−P̂(t−1)P̂(t−1)′, the cost per CS step (per frame) is O(nr log(1/ )) [24] and so the total cost is O((d−ttrain)nr log(1/ )). The subspace update involves at most ((d−ttrain)/α) rank r-SVD’s on n×αmatrices all of which have constant eigen-gap (this is proved in the proof of tTheorem 4.14 from [25] which we use to show correctness of this step). Thus the total time for subspace update steps is at most ((d − ttrain)/α) ∗ O(nαr log(1/ )) = O((d − ttrain)nr log(1/ )) [26]. Thus the running time of the complete algorithm is O(ndr log(1/ ) + nr3 log r). As long as r2 log r ≤ d log(1/ ), the time complexity of the entire algorithm is O(ndr log(1/ )).\nRemark 3.5 (Relating our assumptions to right incoherence of Lj := L[tj ,tj+1) [8]). From our assumptions, Lj = PjAj with Aj := [atj ,atj+1, . . .atj+1−1], the columns of Aj are zero mean, mutually independent, have identical covariance Λ, Λ is diagonal, and are element-wise bounded as specified by Theorem\n2.2. Let dj := tj+1 − tj. Define a diagonal matrix Σ with (i, i)-th entry σi and with σ2i := ∑ t(at) 2 i /dj.\nDefine a dj × r matrix Ṽ with the t-th entry of the i-th column being (ṽi)t := (at)i/(σi √ dj). Then, Lj = PjΣṼ ′ and each column of Ṽ is unit 2-norm. Also, from the bounded-ness assumption, (ṽi)\n2 t ≤ η λiσ2i · 1 dj\nwhere η is a numerical constant.\nObserve that PjΣṼ ′ is not exactly the SVD of Lj since the columns of Ṽ are not necessarily exactly mutually orthogonal. However, if dj is large enough, one can argue using any law of large numbers’ result (e.g., Hoeffding inequality), that the columns of Ṽ are approximately mutually orthogonal whp. Also, whp, σ2i ≥ 0.99λi. This also follows using Hoeffding11. Thus, our assumptions imply that, whp, (ṽi)2t ≤ C/dj. If one interprets Ṽ as an “approximation” to the right singular vectors of Lj, this is the right incoherence assumed by [8] and slightly stronger than what is assumed by [3, 9] and others (these require that the squared norm of each row of the matrix of right singular vectors be bounded by Cr/dj).\nThe claim that “Ṽ can be interpreted as an “approximation” to the right singular vectors of Lj” is not rigorous. But it is also not clear how to make it rigorous since our work uses statistical assumptions on the at’s. To get the exact SVD of Lj, we need the SVD of Aj. Suppose Aj SVD = RΣV ′, then Lj SVD = (PjR)ΣV\n′. Here R will be an r × r orthonormal matrix. Now it is not clear how to relate the element-wise bounded-ness assumption on at’s to an assumption on entries of V , since now there is no easy expression for each entry of V or of the entries of Σ in terms of at (since R is unknown).\n11The first claim uses all the four assumptions on at; the second claim uses all assumptions except diagonal Λ"}, {"heading": "4 Proof Outline and (most of the) Proof", "text": "In this section we first give the main ideas of the proof (without formal lemmas). We then state the three main lemmas and explain how they help prove Theorem 2.2. After this, we prove the three lemmas."}, {"heading": "4.1 Main idea of the proof", "text": "It is not hard to see that the “noise” bt := Ψ(`t + νt) seen by the projected CS step is proportional the error between the subspace estimate from (t − 1) and the current subspace. Moreover, incoherence (denseness) of the P(t)’s and slow subspace change together imply that Ψ satisfies the restricted isometry property (RIP) [12]. Using this, a result for noisy l1 minimization [22], and the lower bound assumption on outlier magnitudes, one can ensure that the CS step output is accurate enough and the outlier support Tt is correctly recovered. With this, we have that ˆ̀t = `t + νt − et where et := xt − x̂t satisfies et = ITt(ΨTt ′ΨTt) −1ITt\n′Ψ′`t and ‖et‖ ≤ C‖bt‖. Consider subspace update. Every time the subspace changes, one can show that the change can be detected within a short delay. After that, the K SVD steps help get progressively improved estimates of the changed subspace. To understand this, observe that, after a subspace change, but before the first update step, bt is the largest and hence, et, is also the largest for this interval. However, because of good initialization or because of slow subspace change and previous subspace correctly recovered (to error ε), neither is too large. Both are proportional to (ε+ ∆), or to the initialization error. Using the idea below, we can show that we get a “good” first estimate of the changed subspace.\nThe input to the PCA step is ˆ̀t and the noise seen by it is et. Notice that et depends on the true data `t. Hence this is a setting of PCA in data-dependent noise [27, 25]. From [25], it is known that the subspace recovery error of the PCA step is proportional to the ratio between the time averaged noise\npower plus time-averaged signal-noise correlation, (‖ ∑ t E[etet′]‖ + ‖ ∑\nt E[`tet′‖)/α, and the minimum signal space eigenvalue, λ−. The instantaneous value of noise power is (∆ + ε)2 times λ+ while that of signal-noise correlation is of order (∆ + ε) times λ+. However, using the fact that et is sparse with support Tt that changes enough over time so that max-outlier-frac-rowα is bounded, one can argue (using Cauchy-Schwartz) that their time averaged values are √ max-outlier-frac-rowα times smaller. As a result, after the first subspace update, the subspace recovery error is at most 4 √ max-outlier-frac-rowα(λ+/λ−) times (∆ + ε). Since max-outlier-frac-rowα(λ+/λ−)2 is bounded by a constant c2 < 1, this means that, after the first subspace update, the subspace error is at most √ c2 times (∆ + ε).\nThis, in turn, implies that ‖bt‖, and hence ‖et‖, is also √ c2 times smaller in the second subspace update interval compared to the first. This, along with repeating the above argument, helps show that the second estimate of the changed subspace is √ c2 times better than the first and hence its error is ( √ c2) 2 times (∆ + ε). Repeating the argument K times, the K-th estimate has error ( √ c2) K times (∆ + ε). Since K = C log(1/ε), this is an ε accurate estimate of the changed subspace.\nA careful application of the result of [25] is the reason why we are able to remove the moving object model assumption on the outlier support needed by the earlier guarantees for original-ReProCS [13, 14].\nApplied to our problem, this result requires ‖ ∑\nt∈J α ITtITt ′/α‖ to be bounded by a constant less than one. It is not hard to see that maxJ α∈[1,d] ‖ ∑ t∈J α ITtITt ′/α‖ = max-outlier-frac-rowα. To understand\nthis simply, the matrix ∑\nt∈J α ITtITt ′ is diagonal, and the i-th diagonal entry counts the number of\ntime the index i appears in the support set Tt in the interval J α which is precisely the definition of max-outlier-frac-rowα ·α. This is also why a constant bound on max-outlier-frac-rowα suffices for our setting. On the other hand the guarantees of [13, 14] required that, for any sequence of positive semi-definite\n(p.s.d.) matrices, At, ‖ ∑ t∈J α ITtAtITt ′/α‖, be bounded by a constant less than one. This is a much more stringent requirement; one way to satisfy it is using the moving object model on outlier supports assumed there."}, {"heading": "4.2 Main Lemmas", "text": "For simplicity, we give the proof for the νt = 0 case. The changes with νt 6= 0 are minor, see Appendix A.\nFirst consider the simpler case when tj ’s are known, i.e., consider Algorithm 1. In this case, t̂j = tj .\nDefinition 4.6. Define\n1. the constants used in Theorem 2.2: c1 = 0.01, c2 = 0.01, and C1 = 15 √ η\n2. s := max-outlier-frac-col · n\n3. φ+ = 1.2\n4. bound on max-outlier-frac-rowα: b0 := 0.01/f 2.\n5. q0 := 1.2(ε+ SE(Pj−1,Pj)), qk = (0.3) kq0\n6. et := x̂t − xt. Since νt = 0, et = `t − ˆ̀t\n7. Events: Γ0,0 := {assumed bound on SE(P̂0,P0)}, Γ0,k := Γ0,k−1 ∩ {SE(P̂0,k,P0) ≤ 0.3kSE(P̂0,P0)}, Γj,0 := Γj−1,K , Γj,k := Γj,k−1 ∩ {SE(P̂j,k,Pj) ≤ qk−1/4} for j = 1, 2, . . . , J and k = 1, 2, . . . ,K.\n8. Using the expression for K given in the theorem, and since P̂j = P̂j,k (from the Algorithm), it\nfollows that Γj,K implies SE(P̂j ,Pj) = SE(P̂j,K ,Pj) ≤ ε.\nObserve that, if we can show that Pr(ΓJ,K |Γ0,0) ≥ 1 − dn−10 we will have obtained all the subspace recovery bounds of Theorem 2.2. The next two lemmas applied sequentially help show that this is true for Algorithm 1 (tj known). The correctness of the actual algorithm (Algorithm 2) follows using these, Corollary 4.10, and Lemma 4.12. The Theorem’s proof is in Appendix A.\nLemma 4.7 (first subspace update interval). Under the conditions of Theorem 2.2, conditioned on Γj,0, 1. for all t ∈ [t̂j , t̂j + α), ‖Ψ`t‖ ≤ (ε + ∆) √ ηrλ+ < xmin/15, ‖x̂t,cs − xt‖ ≤ 7xmin/15 < xmin/2,\nT̂t = Tt, and the error et := x̂t − xt = `t − ˆ̀t satisfies\net = ITt ( ΨTt ′ΨTt )−1 ITt ′Ψ`t, (1)\nand ‖et‖ ≤ 1.2(ε+ ∆) √ ηrλ+.\n2. w.p. at least 1 − 10n−10, the first subspace estimate P̂j,1 satisfies SE(P̂j,1,Pj) ≤ (q0/4), i.e., Γj,1 holds.\nLemma 4.8 (k-th subspace update interval). Under the conditions of Theorem 2.2, conditioned on Γj,k−1,\n1. for all t ∈ [t̂j + (k − 1)α, t̂j + kα − 1), all claims of the first part of Lemma 4.7 holds, ‖Ψ`t‖ ≤ 0.3k−1(ε+ ∆) √ ηrλ+, and ‖et‖ ≤ (0.3)k−1 · 1.2(ε+ ∆) √ ηrλ+.\n2. w.p. at least 1−10n−10 the subspace estimate P̂j,k satisfies SE(P̂j,k,Pj) ≤ (qk−1/4), i.e., Γj,k holds.\nRemark 4.9. For the case of j = 0, in both the lemmas above, ∆ gets replaced by SE(P̂0,P0) and ε by zero.\nCorollary 4.10. Under the conditions of Theorem 2.2 the following hold\n1. For all t ∈ [tj , t̂j), conditioned on Γj−1,K , all claims of the first item of Lemma 4.7 hold.\n2. For all t ∈ [t̂j +Kα, tj+1), conditioned on Γj,K , the first item of Lemma 4.8 holds with k = K.\nThus, for all t, by the above two claims and Lemmas 4.7, 4.8, under appropriate conditioning, et satisfies (1).\nWe prove these lemmas in the next few subsections. The projected CS proof (item one of both lemmas) uses the following lemma from [12] that relates the s-Restricted Isometry Constant (RIC), δs(.), [22] of a projection matrix to the incoherence of its orthogonal complement.\nLemma 4.11. [[12]] For an n × r basis matrix P , (1) δs(I − PP ′) = max|T |≤s ‖IT ′P ‖2; and (2) max|T |≤s ‖IT ′P ‖2 ≤ smaxi=1,2,...,n ‖Ii′P ‖2 ≤ sµr/n.\nThe last bound of the above lemma is a consequence of Definition 1.1. We apply this lemma with s = max-outlier-frac-col · n. The subspace update step proof (item 2 of both the above lemmas) uses a guarantee for PCA in sparse data-dependent noise, Theorem 4.14, due to [25]. Notice that et = `t− ˆ̀t is the noise/error seen by the subspace update step. By (1), this is sparse and depends on the true data `t.\nConsider the actual tj unknown case. The following lemma is used to show that, whp, we can detect subspace change within 2α time instants. This lemmas assumes detection threshold ωevals = 2ε 2λ+ (see Algorithm 2).\nLemma 4.12 (Subspace Change Detection). Consider an α-length time interval J α ⊂ [tj , tj+1] (so that `t = Pjat).\n1. If Φ := I − P̂j−1P̂j−1′ and SE(P̂j−1,Pj−1) ≤ ε, with probability at least 1− 10n−10,\nλmax\n( 1\nα ∑ t∈J α Φ ˆ̀t ˆ̀t ′Φ\n) ≥ 0.28λ−SE2(Pj−1,Pj) > ωevals\n2. If Φ := I − P̂jP̂j ′ and SE(P̂j ,Pj) ≤ ε, with probability at least 1− 10n−10,\nλmax\n( 1\nα ∑ t∈J α Φ ˆ̀t ˆ̀t ′Φ\n) ≤ 1.37ε2λ+ < ωevals"}, {"heading": "4.3 Proof of Lemma 4.7: projected CS and subspace update in the first update interval", "text": "We first state a simple lemma. This is proved in Appendix B.\nLemma 4.13. Let Q1, Q2 and Q3 be r-dimensional subspaces in Rn such that SE(Q1,Q2) ≤ ∆1 and SE(Q2,Q3) ≤ ∆2. Then, SE(Q1,Q3) ≤ ∆1 + ∆2.\nProof of Lemma 4.7. Recall from Definition 4.6 that s := max-outlier-frac-col ·n and φ+ = 1.2. Recall also that, for simplicity, we are considering the νt = 0 case. Proof of item 1. First consider j > 0. We have conditioned on the event Γj,0 := Γj−1,K . This implies that SE(P̂j−1,Pj−1) ≤ ε. We consider the interval t ∈ [t̂j , t̂j +α). For this interval, P̂(t−1) = P̂j−1 and thus Ψ = I − P̂j−1P̂j−1′ (from Algorithm). For the sparse recovery step, we first need to bound the 2s-RIC of Ψ. To do this, we first obtain bound on max|T |≤2s ‖IT ′P̂j−1‖ as follows. Consider any set T such that |T | ≤ 2s. Then,∥∥∥IT ′P̂j−1∥∥∥ ≤ ∥∥∥IT ′(I − Pj−1Pj−1′)P̂j−1∥∥∥+ ∥∥∥IT ′Pj−1Pj−1′P̂j−1∥∥∥ ≤ SE(Pj−1, P̂j−1) + ∥∥IT ′Pj−1∥∥ = SE(P̂j−1,Pj−1) + ∥∥IT ′Pj−1∥∥\nUsing Lemma 4.11, and the bound on max-outlier-frac-col from Theorem 2.2,\nmax |T |≤2s ‖IT ′Pj−1‖2 ≤ 2smax i ‖Ii′Pj−1‖2 ≤\n2sµr\nn ≤ 0.01 (2)\nThus, using SE(P̂j−1,Pj−1) ≤ ε,\nmax |T |≤2s ∥∥∥IT ′P̂j−1∥∥∥ ≤ ε+ max |T |≤2s ∥∥IT ′Pj−1∥∥ ≤ ε+ 0.1 Finally, using Lemma 4.11, δ2s(Ψ) ≤ 0.112 < 0.15. Hence∥∥∥(ΨTt ′ΨTt)−1∥∥∥ ≤ 11− δs(Ψ) ≤ 11− δ2s(Ψ) ≤ 11− 0.15 < 1.2 = φ+.\nWhen j = 0, there are some minor changes. From the initialization assumption, we have SE(P̂0,P0) ≤ 0.25. Thus, max|T |≤2s ∥∥∥IT ′P̂0∥∥∥ ≤ 0.25 + 0.1 = 0.35. Thus, using Lemma 4.11, δ2s(Ψ0) ≤ 0.352 < 0.15. The rest of the proof given below is the same for j = 0 and j > 0.\nNext we bound norm of bt := Ψ`t. This and the RIC bound will then be used to bound ‖x̂t,cs − xt‖. ‖bt‖ = ‖Ψ`t‖ = ∥∥∥(I − P̂j−1P̂j−1′)Pjat∥∥∥ ≤ SE(P̂j−1,Pj) ‖at‖\n(a) ≤ (ε+ SE(Pj−1,Pj)) √ ηrλ+ := bb\nwhere (a) follows from Lemma 4.13 with Q1 = P̂j−1, Q2 = Pj−1 and Q3 = Pj . Under the assumptions of Theorem 2.2, bb < xmin/15. This is why we have set ξ = xmin/15 in the Algorithm. Using these facts, and δ2s(Ψ) ≤ 0.15, the CS guarantee from [22, Theorem 1.3] implies that\n‖x̂t,cs − xt‖ ≤ 7ξ = 7xmin/15 < xmin/2\nConsider support recovery. From above,\n|(x̂t,cs − xt)i| ≤ ‖x̂t,cs − xt‖ ≤ 7xmin/15 < xmin/2\nThe Algorithm sets ωsupp = xmin/2. Consider an index i ∈ Tt. Since |(xt)i| ≥ xmin,\nxmin − |(x̂t,cs)i| ≤ |(xt)i| − |(x̂t,cs)i| ≤ |(xt − x̂t,cs)i| < xmin\n2\nThus, |(x̂t,cs)i| > xmin2 = ωsupp which means i ∈ T̂t. Hence Tt ⊆ T̂t. Next, consider any j /∈ Tt. Then, (xt)j = 0 and so\n|(x̂t,cs)j | = |(x̂t,cs)j)| − |(xt)j | ≤ |(x̂t,cs)j − (xt)j | ≤ bb < xmin\n2\nwhich implies j /∈ T̂t and T̂t ⊆ Tt implying that T̂t = Tt. Finally, we get an expression for et and bound it. With T̂t = Tt and since Tt is the support of xt, xt = ITtITt ′xt, and so\nx̂t = ITt ( ΨTt ′ΨTt )−1 ΨTt ′(Ψ`t + Ψxt) = ITt ( ΨTt ′ΨTt )−1 ITt ′Ψ`t + xt\nsince ΨTt ′Ψ = I ′TtΨ ′Ψ = ITt ′Ψ. Thus et = x̂t − xt satisfies\net = ITt ( ΨTt ′ΨTt )−1 ITt ′Ψ`t and\n‖et‖ ≤ ∥∥∥(ΨTt ′ΨTt)−1∥∥∥∥∥ITt ′Ψ`t∥∥ ≤ φ+ ∥∥ITt ′Ψ`t∥∥ ≤ 1.2bb\nProof of Item 2 : We will use the following result from [25, Remark 4.18].\nTheorem 4.14 (PCA in sparse data-dependent noise (PCA-SDDN)). We are given data vectors yt := `t + wt with wt = ITtMs,t`t, t = 1, 2, . . . , α, where Tt is the support set of wt, and `t = Pat with at satisfying the assumptions of Theorem 2.2. Pick an εSE > 0. Assume that maxt ‖Ms,tP ‖2 ≤ q < 1, the fraction of non-zeroes in any row of the noise matrix [w1,w2, . . . ,wα] is bounded by b, and 3 √ bqf ≤ 0.9εSE/(1 + εSE). Define\nα0 := Cη q2f2\nε2SE r log n\nFor an α ≥ α0, let P̂ be the matrix of top r eigenvectors of D := 1α ∑α t=1 yty ′ t. With probability at least 1− 10n−10, SE(P̂ ,P ) ≤ εSE.\nSince ˆ̀t = `t − et with et satisfying (1), updating P̂(t) from the ˆ̀t’s is a problem of PCA in sparse data-dependent noise (SDDN), et. To analyze this, we use Theorem 4.14 given above. Recall from Item 1 of this lemma that, for t ∈ [t̂j , t̂j + α), et satisfies (1). Recall from the Algorithm that we compute the first estimate of the j-th subspace, P̂j,1, as the top r eigenvectors of 1 α ∑t̂j+α−1 t=t̂j ˆ̀ t ˆ̀ t ′. In the notation of Theorem 4.14, yt ≡ ˆ̀t, wt ≡ et, `t ≡ `t, Ms,t = − (ΨTt ′ΨTt) −1 ΨTt ′, P̂ = P̂j,1, P = Pj , and so ‖Ms,tP ‖ = ‖ (ΨTt ′ΨTt) −1 ΨTt\n′Pj‖ ≤ 1.2(ε + SE(Pj−1,Pj)) := q0. Also, b ≡ b0 which is the upper bound on max-outlier-frac-rowα (see Definition 4.6). Applying Theorem 4.14 with q ≡ q0, b ≡ b0 and using εSE = q0/4, observe that we require √\nb0q0f ≤ 0.9(q0/4)\n1 + (q0/4) .\nSince q0 = 1.2(ε + SE(Pj−1,Pj)) < 1.2(0.01 + 0.8) < 0.98 (follows from the bounds on ε and on ∆ given in Theorem 2.2), this holds if √ b0f ≤ 0.18. This is true since we have assumed b0 = 0.01/f2 (see Definition 4.6). Thus, from Theorem 4.14, with probability at least 1 − 10n−10, SE(P̂j,1,Pj) ≤ q0/4. Thus, conditioned on Γj,0, with this probability, Γj,1 holds.\nRemark 4.15 (Clarification about conditioning). In the proof above we have used Theorem 4.14 which assumes that, for t ∈ J α, the at’s are mutually independent and the matrices Ms,t are either nonrandom or are independent of the at’s for this interval. When we apply the theorem for our proof, we are conditioning on Γj,0. This does not cause any problem since the event Γj,0 is a function of the random variable yold := {y1,y2, . . . ,yt̂j−1} where as our summation is over J α := [t̂j , t̂j + α). Also, by Theorem 2.2, at’s are independent of the outlier supports Tt. To be precise, we are applying Theorem 4.14 conditioned on yold, for any yold ∈ Γj,0. Even conditioned on yold, clearly, the matrices Ms,t used above are independent of the at’s for this interval. Also, even conditioned on yold, the at’s for t ∈ [t̂j , t̂j+α) are clearly mutually independent. Thus, the theorem can be applied. Its conclusion then tells us that, for any yold ∈ Γj,0, conditioned on yold, with probability at least 1−10n−10, SE(P̂j,1,Pj) ≤ q0/4. Since this holds with the same probability for all yold ∈ Γj,0, it also holds with the same probability when we condition on Γj,0. Thus, conditioned on Γj,0, with this probability, Γj,1 holds.\nAn analogous argument will also apply to the following proofs.\n4.4 Proof of Lemma 4.8: lemma for projected CS and subspace update in k-th update interval\nProof of Lemma 4.8. We first present the proof for the k = 2 case and then generalize it for an arbitrary k.\n(A) k = 2: We have conditioned on Γj,1. This implies that SE(P̂j,1,Pj) ≤ q0/4.\nProof of Item 1 : We consider the interval t ∈ [t̂j + α, t̂j + 2α). For this interval, P̂(t−1) = P̂j,1 and thus Ψ = I − P̂j,1P̂j,1′ (from Algorithm). For the sparse recovery step, we need to bound the 2s-RIC of Ψ. Consider any set T such that |T | ≤ 2s. We have∥∥∥IT ′P̂j,1∥∥∥ ≤ ∥∥∥IT ′(I − PjPj ′)P̂j,1∥∥∥+ ∥∥∥IT ′PjPj ′P̂j,1∥∥∥\n≤ SE(Pj , P̂j,1) + ∥∥IT ′Pj∥∥ = SE(P̂j,1,Pj) + ∥∥IT ′Pj∥∥\nThe equality holds since SE is symmetric for subspaces of the same dimension. Using SE(P̂j,1,Pj) ≤ q0/4, (2),\nmax |T |≤2s ∥∥∥IT ′P̂j,1∥∥∥ ≤ q0/4 + max |T |≤2s ∥∥IT ′Pj∥∥ ≤ q0/4 + 0.1. Finally, from using the assumptions of Theorem 2.2, q0 ≤ 0.96. Using this and Lemma 4.11,\nδ2s(Ψj) = max |T |≤2s ∥∥∥IT ′P̂j,1∥∥∥2 ≤ 0.352 < 0.15. From, this ∥∥∥(ΨTt ′ΨTt)−1∥∥∥ ≤ 11− δs(Ψ) ≤ 11− δ2s(Ψ) ≤ 11− 0.15 < 1.2 = φ+. Consider ‖bt‖.\n‖bt‖ = ‖Ψ`t‖ = ∥∥∥(I − P̂j,1P̂j,1′)Pjat∥∥∥ ≤ SE(P̂j,1,Pj) ‖at‖ ≤ (q0/4)√ηrλ+\n(a) ≤ 0.3(ε+ SE(Pj−1,Pj)) √ ηrλ+ := 0.3bb\nWe have 0.3bb < bb < xmin/15 as in the proof of Lemma 4.7. The rest of the proof is the same too. Notice here that, we could have loosened the required lower bound on xmin for this interval.\nProof of Item 2 : Again, updating P̂(t) using ˆ̀t’s is a problem of PCA in sparse data-dependent noise (SDDN), et. We use the result of Theorem 4.14. Recall from Item 1 of this lemma that, for\nt ∈ [t̂j + α, t̂j + 2α), et satisfies (1). We compute P̂j,2 as the top r eigenvectors of 1α ∑t̂j+2α−1 t=t̂j+α ˆ̀ t ˆ̀ t ′. In notation of Theorem 4.14, yt ≡ ˆ̀t, wt ≡ et, `t ≡ `t, P ≡ Pj , P̂ ≡ Pj,2, and Ms,t = − (ΨTt ′ΨTt) −1 ΨTt ′. So ‖Ms,tPj‖ = ‖ (ΨTt ′ΨTt) −1 ΨTt\n′Pj‖ ≤ (φ+/4)q0 := q1. Applying Theorem 4.14 with q ≡ q1, b ≡ b0 (b0 bounds max-outlier-frac-rowα), and setting εSE = q1/4, observe that we require√\nb0q1f ≤ 0.9(q1/4)\n1 + (q1/4)\nwhich holds if √ b0f ≤ 0.18. This is ensured since b0 = 0.01/f2. Thus, from Theorem 4.14, with probability at least 1− 10n−10, SE(P̂j,2,Pj) ≤ (q1/4) = 0.25 · 0.3q0. Thus, with this probability, conditioned on Γj,1, Γj,2 holds.\n(B) General k: We have conditioned on Γj,k−1. This implies that SE(P̂j,k−1,Pj) ≤ qk−1/4. Proof of Item 1 : Consider the interval [t̂j + (k − 1)α, t̂j + kα). In this interval, P̂(t−1) = P̂j,k−1 and thus Ψ = I − P̂j,k−1P̂j,k−1′. Using the same idea as for the k = 2 case, we have that for the k-th interval, qk−1 = (φ +/4)k−1q0. Pick εSE = (qk−1/4). From this it is easy to see that\nδ2s(Ψ) ≤ (\nmax |T |≤2s ∥∥∥IT ′P̂j,k−1∥∥∥)2 ≤ (SE(P̂j,k−1,Pj) + max |T |≤2s ∥∥IT ′Pj∥∥)2 (a) ≤ (SE(P̂j,k−1,Pj) + 0.1)2 ≤ ((φ+/4)k−1(ε+ SE(Pj−1,Pj) + 0.1)2 < 0.15\nwhere (a) follows from (2). Using the approach Lemma 4.7, ‖Ψ`t‖ ≤ SE(P̂j,k−1,Pj) ‖at‖ ≤ (φ+/4)k−1(ε+ SE(Pj−1,Pj)) √ ηrλ+\n(a) ≤ (φ+/4)k−1(ε+ ∆) √ ηrλ+ := (φ+/4)k−1bb\nProof of Item 2 : Again, updating P̂(t) from ˆ̀t’s is a problem of PCA in sparse data-dependent noise given in Theorem 4.14. From Item 1 of this lemma that, for t ∈ [t̂j + (k − 1)α, t̂j + kα], et satisfies (1). We update the subspace, P̂j,k as the top r eigenvectors of 1 α ∑t̂j+kα−1 t=t̂j+(k−1)α ˆ̀ t ˆ̀ t ′. In the setting above yt ≡ ˆ̀t, wt ≡ et, `t ≡ `t, and Ms,t = − (ΨTt ′ΨTt) −1 ΨTt ′, and so ‖Ms,tPj‖ = ‖ (ΨTt ′ΨTt) −1 ΨTt\n′Pj‖ ≤ (φ+/4)k−1q0 := qk−1. Applying Theorem 4.14 with q ≡ qk−1, b ≡ b0 (b0 bounds max-outlier-frac-rowα), and setting εSE = qk−1/4, we require √\nb0qk−1f ≤ 0.9(qk−1/4)\n1 + (qk−1/4)\nwhich holds if √ b0f ≤ 0.12. This is true by our assumption. Thus, from Theorem 4.14, with probability at least 1− 10n−10, SE(P̂j,k,Pj) ≤ (φ+/4)k−1q1. Thus, with this probability, conditioned on Γj,k−1, Γj,k holds."}, {"heading": "4.5 Proof of Lemma 4.12: subspace change detection lemma", "text": "Proof of Lemma 4.12. The proof uses the following lemma. It is proved in Appendix B. The proof uses Cauchy-Schwartz for sums of matrices, followed by either matrix Bernstein [28] or Vershynin’s subGaussian result [29].\nLemma 4.16 (Concentration Bounds). Assume that the assumptions of Theorem 2.2 hold. For this lemma assume that `t = Pat, Φ := I − P̂ P̂ ′, et = M2,tM1,t`t, with ‖ 1α ∑ t∈J αM2,tM2,t ′‖ ≤ b0 and ‖M1,tP ‖ ≤ q. Assume that event E0 holds. Then,\nPr (∥∥∥∥∥ 1α∑ t atat ′ −Λ ∥∥∥∥∥ ≤ 0λ− ) ≥ 1− 10n−10\nPr (∥∥∥∥∥ 1α∑ t Φ`tet ′Φ ∥∥∥∥∥ ≤ (1 + 1)SE(P̂ ,P )√b0qλ+ ) ≥ 1− 10n−10\nPr (∥∥∥∥∥ 1α∑ t Φetet ′Φ ∥∥∥∥∥ ≤ (1 + 2)√b0q2λ+ ) ≥ 1− 10n−10\nPr (∥∥∥∥∥ 1α∑ t Φ`tνt ′Φ ∥∥∥∥∥ ≤ l,vλ− ) ≥ 1− 2n−10\nPr (∥∥∥∥∥ 1α∑ t Φνtνt ′Φ ∥∥∥∥∥ ≤ (ε2 + v,v)λ− ) ≥ 1− 2n−10\nProof of Item (a): First from Corollary 4.10, note that for t ∈ [tj , t̂j ], the error et satisfies (1). We\nhave\nλmax\n( 1\nα ∑ t∈J α Φ[Pjatat ′Pj ′ + etet ′ + `tet ′ + et`t ′]Φ ) (a) ≥ λmax ( 1\nα ∑ t∈J α ΦPjatat ′Pj ′Φ\n) + λmin ( 1\nα ∑ t∈J α Φ[etet ′ + `tet ′ + et`t ′]Φ\n)\n≥ λmax\n( 1\nα ∑ t∈J α ΦPjatat ′Pj ′Φ\n) − ∥∥∥∥∥ 1α ∑ t∈J α Φetet ′Φ ∥∥∥∥∥− 2 ∥∥∥∥∥ 1α ∑ t∈J α Φ`tet ′Φ ∥∥∥∥∥ := λmax(T )−\n∥∥∥∥∥ 1α ∑ t∈J α Φetet ′Φ ∥∥∥∥∥− 2 ∥∥∥∥∥ 1α ∑ t∈J α Φ`tet ′Φ ∥∥∥∥∥ (3) where (a) follows from Weyl’s Inequality. Now we bound the second and third terms by invoking Lemma 4.16 with E0 := {SE(P̂j−1,Pj−1) ≤ ε}, P̂ ≡ P̂j−1, P ≡ Pj , M2,t ≡ ITt and M1,t ≡ (ΨTt ′ΨTt) −1 ΨTt ′, where Ψ = I − P̂j−1P̂j−1′. Thus, b0 ≡ b0, q ≡ q0. Thus, with probability at least 1− 4n−10,∥∥∥∥∥ 1α ∑ t∈J α Φetet ′Φ ∥∥∥∥∥+ 2 ∥∥∥∥∥ 1α ∑ t∈J α Φ`tet ′Φ ∥∥∥∥∥ ≤√b0q20λ+(1 + 2) + 2√b0q0(SE(Pj−1,Pj) + ε)λ+(1 + 1) (4)\nThe above equation uses the fact that SE(P̂j−1,Pj) ≤ ε + SE(Pj−1,Pj) which is a direct consequence of using Lemma 4.13. We bound the first term of (3) as follows. Let ΦPj QR = EjRj be its reduced QR decomposition. Thus Ej is an n×r matrix with orthonormal columns and Rj is an r×r upper triangular matrix. Let\nA := Rj\n( 1\nα ∑ t∈J α atat ′\n) Rj ′.\nObserve that T can also be written as T = [ Ej Ej,⊥ ] [A 0 0 0 ] [ Ej ′ Ej,⊥ ′ ] (5)\nand thus λmax(A) = λmax(T ). We work with λmax(A) in the sequel. We will use the following simple claim.\nClaim 4.17. If X 0 (i.e., X is a p.s.d matrix), where X ∈ Rr×r, then RXR′ 0 for all R ∈ Rr×r.\nProof. Since X is p.s.d., y′Xy ≥ 0 for any vector y. Use this with y = R′z for any z ∈ Rr. We get z′RXR′z ≥ 0. Since this holds for all z, RXR′ 0.\nUsing Lemma 4.16, it follows that\nPr\n( 1\nα ∑ t atat ′ − (λ− − 0)I 0\n) ≥ 1− 2n−10.\nUsing Claim 4.17, with probability 1− 2n−10,\nRj\n( 1\nα ∑ t atat ′ − (λ− − 0)I\n) Rj ′ 0\n=⇒ λmin ( Rj ( 1\nα ∑ t atat ′ − (λ− − 0)I\n) Rj ′ ) ≥ 0\nUsing Weyl’s inequality [30], with the same probability,\nλmin ( Rj ( 1\nα ∑ t atat ′ − (λ− − 0)I\n) Rj ′ ) ≤ λmax ( Rj ( 1\nα ∑ t atat ′\n) Rj ′ ) − (λ− − 0)λmax ( RjRj\n′) and so,\nλmax(A) ≥ (λ− − 0)λmax(RjRj ′).\nWe now obtain a lower bound on the second term in the rhs above.\nλmax(RjRj ′) = λmax(Pj ′(I − P̂j−1P̂j−1′)Pj)) = λmax(Pj ′(I − Pj−1Pj−1′ + Pj−1Pj−1′ − P̂j−1P̂j−1′)Pj)) ≥ λmax(Pj ′(I − Pj−1Pj−1′)Pj) + λmin(Pj ′(Pj−1Pj−1′ − P̂j−1P̂j−1′)Pj) = σ2max((I − Pj−1Pj−1′)Pj) + λmin(Pj ′(Pj−1Pj−1′ − P̂j−1P̂j−1′)Pj)\n≥ SE2(Pj−1,Pj)− ∥∥∥Pj ′(Pj−1Pj−1′ − P̂j−1P̂j−1′)Pj∥∥∥\n(a) ≥ SE2(Pj−1,Pj)− ∥∥∥Pj−1Pj−1′ − P̂j−1P̂j−1′∥∥∥ ≥ SE2(Pj−1,Pj)− 2ε (6)\nwhere we have used [12, Lemma 2.10]. Thus, combining (3), (4), (6), and using 0 = 0.01, 1 = 2 = 0.01, with probability at least 1− 10n−10,\nλmax\n( 1\nα ∑ t∈J α Φ ˆ̀t ˆ̀t ′Φ\n) ≥ 0.99λ−(SE2(Pj−1,Pj)− 2ε)− λ+[ √ b0q0(1.01q0 + 2.02(ε+ SE(Pj−1,Pj)))]\n(a) ≥ λ− [ 0.91SE2(Pj−1,Pj)− 2.7 √ b0f(ε+ SE(Pj−1,Pj) 2 ]\n(b) ≥ λ− [ 0.91SE2(Pj−1,Pj)− 0.54(ε2 + SE2(Pj−1,Pj) ] ≥ λ−SE2(Pj−1,Pj)(0.91− 0.54 · 1.16) ≥ 0.28λ−SE2(Pj−1,Pj)\nwhere (a) uses q0 = 1.2(ε + SE(Pj−1,Pj)) and ε ≤ 0.03SE2(Pj−1,Pj)/f2 < 0.4SE2(Pj−1,Pj), (b) uses√ b0f = 0.1 and (a+ b)\n2 ≤ 2(a2 + b2). and the last inequality again uses ε ≤ 0.03SE2(Pj−1,Pj)/f2. Proof of Item (b): First, we recall that from Corollary 4.10, for t ∈ [t̂j + Kα, tj+1), the error et satisfies (7).\nλmax\n( 1\nα ∑ t∈J α Φ ˆ̀t ˆ̀t ′Φ\n) ≤ λmax ( 1\nα ∑ t∈J α Φ`t`t ′Φ\n) + λmax ( 1\nα ∑ t∈J α Φ[`tet ′ + et`t ′ + etet ′]Φ\n)\n≤ λmax\n( 1\nα ∑ t∈J α Φ`t`t ′Φ\n) + ∥∥∥∥∥ 1α ∑ t∈J α Φetet ′Φ ∥∥∥∥∥+ 2 ∥∥∥∥∥ 1α ∑ t∈J α Φ`tet ′Φ ∥∥∥∥∥ := λmax(T ) +\n∥∥∥∥∥ 1α ∑ t∈J α Φetet ′Φ ∥∥∥∥∥+ 2 ∥∥∥∥∥ 1α ∑ t∈J α Φ`tet ′Φ ∥∥∥∥∥ To obtain bounds on the second and third terms in the equation above we invoked Lemma 4.16 with E0 := {SE(P̂j ,Pj) ≤ ε}, P̂ ≡ P̂j , P ≡ Pj , M2,t ≡ ITt , M1,t ≡ (ΨTt ′ΨTt) −1 ΨTt\n′, where Ψ = I − P̂jP̂j ′ and b0 ≡ b0, ≡ qK , . Thus, with probability at least 1− 10n−10,∥∥∥∥∥ 1α ∑\nt∈J α Φetet\n′Φ ∥∥∥∥∥+ 2 ∥∥∥∥∥ 1α ∑\nt∈J α Φ`tet\n′Φ ∥∥∥∥∥ ≤√b0qKλ+(qK(1 + 2) + 2(1 + 1)ε)\nThe above equation also uses SE(P̂j ,Pj) ≤ ε. Proceeding as before to bound λmax(T ), define ΦPj QR = EjRj , define A as before, we know λmax(T ) = λmax(Ej ′TEj) = λmax(A). Further,\nλmax(A) = λmax ( Rj ( 1\nα ∑ t∈J α atat ′\n) Rj ′ ) (a) ≤ λmax ( 1\nα ∑ t∈J α atat\n) λmax(RjRj ′)\nwhere (a) uses Ostrowski’s theorem [30, Theorem 5.4.9]. We have\nλmax(RjRj ′) = σ2max(Rj) = σ 2 max((I − P̂jP̂j ′)Pj) ≤ ε2\nand we can bound λmax( 1 α ∑ t∈J α atat ′) using the first item of Lemma 4.16 with 0 = 0.01. Combining all of the above, and setting 1 = 2 = 0.01, when the subspace has not changed, with probability at least 1− 10n−10,\nλmax\n( 1\nα ∑ t∈J α Φ ˆ̀t ˆ̀t ′Φ\n) ≤ λ+[1.01ε2 + √ b0qK(1.01qK + 2.01ε)] (a) ≤ 1.37ε2λ+\nwhere (a) uses qK ≤ ε and b0f2 = 0.01. Under the condition of Theorem 2.2, recall that ωevals = 2ε2λ+ and thus, with high probability, 1.37ε2λ+ < ωevals < 0.28λ −SE2(Pj−1,Pj)."}, {"heading": "5 Extensions", "text": ""}, {"heading": "5.1 Static Robust PCA", "text": "A useful corollary of our result for RST is that NORST is also the first online algorithm that provides a provable finite sample guarantee for the static Robust PCA problem. Static RPCA is our problem setting with J = 1, or in other words, with `t = Pat. A recent work, [21], developed an online stochastic optimization based reformulation of PCP, called ORPCA, to solve this. Their paper provides only a partial guarantee because the guarantee assumes that the intermediate algorithm estimates, P̂(t), are fullrank. Moreover the guarantee is only asymptotic. Instead our result given below is a complete guarantee and is non-asymptotic.\nCorollary 5.18 (Static RPCA). Consider Algorithm 1 with t2 = ∞. Theorem 2.2 holds with following modification: replace the slow subspace change assumption with a fixed subspace P . Everything else remains as is, but with r ≡ rL. Under the assumptions of Theorem 2.2, all the conclusions hold with same probability. The time and memory complexity are O(ndr log(1/ )) and O(nr log n log(1/ )).\nIn applications such as “robust” dimensionality reduction [31, 32] where the objective is to just obtain the top-r directions along which the variability of data is maximized, we only need the first Kα = Cf2r log n log(1/ε) samples to obtain an ε-accurate subspace estimate. If only these are used, the time complexity reduces to O(nKαr log(1/ε)) = O(nr2 log n log2(1/ )). This is faster than even NO-RMC [11] and does not require d ≈ n; of course it requires the other extra assumptions discussed earlier."}, {"heading": "5.2 Subspace Tracking with Missing Data (ST-missing) and Dynamic Matrix Completion", "text": "Another useful corollary of our result is a guarantee for the ST-missing problem. Consider the subspace tracking with missing data (ST-missing) problem. By setting the missing entries at time t to zero, and by defining Tt to be the set of missing entries at time t, we observe n-dimensional vectors that satisfy\nyt := `t − ITtITt ′`t, for t = 1, 2, . . . , d. (7)\nAlgorithm 3 NORST-Random for subspace tracking with missing data (ST-missing) Algorithm 2 with the following changes\n1. Replace line 3 with: compute P̂0 ← P̂init ← Generate an n× r basis matrix from the random orthogonal model; j ← 1, k ← 1\n2. Replace line 6 with the following\n• Ψ← I − P̂(t−1)P̂(t−1)′; ỹt ← Ψyt; x̂t ← ITt(ΨTt ′ΨTt)−1ΨTt ′ỹt; ˆ̀t ← yt − x̂t.\nwith xt ≡ ITtITt ′`t. This can be interpreted as a special case of the RST problem where the set Tt is known. Because there are no sparse corruptions (outliers), there is no xmin. Thus the initialization error need not be O(1/ √ r) (needed in the RST result to ensure a reasonable lower bound on xmin) and so one can even use random initialization. We assume that the initialization is obtained using the Random Orthogonal Model described in [33]. As explained in [33], a basis matrix generated from this model is already µ-incoherent. We have the following corollary. The only change in its proof is the proof of the first subspace update interval for the j = 0 case.\nCorollary 5.19 (ST-missing). Consider NORST-Random (Algorithm 3). If the assumptions of Theorem 2.2 on at and νt hold, Pj’s are µ-incoherent, tj+1 − tj > (K + 2)α, ∆ < 0.8, the outlier fraction bounds given in Theorem 2.2 hold, and if, for t ∈ [t0, t1], max-outlier-frac-col ≤ c/(log n), then all conclusions of Theorem 2.2 on P̂(t) and on `t hold with the same probability.\nTo our knowledge, the above is the first complete non-asymptotic guarantee for ST-missing; and the first result that allows changing subspaces. All existing guarantees are either partial guarantees (make assumptions on intermediate algorithm estimates), e.g., [19], or provide only asymptotic results [16, 18]. Moreover, from a dynamic matrix completion viewpoint, it is also giving a matrix completion solution without assuming that the set of observed entries is generated from a uniform or a Bernoulli model. Of course the tradeoff is that it needs many more observed entries. All these points will be discussed in detail in follow-up work where we will also numerically evaluate NORST-random for this problem."}, {"heading": "5.3 Fewer than r directions change", "text": "It is possible to relax the lower bound on outlier magnitudes if not all of the subspace directions change at a given subspace change time. Suppose that only rch < r directions change. When rch = 1, we recover the guarantee of [15] but for NORST (which is a simpler algorithm than s-reprocs).\nLet Pj−1,fix denote a basis for the fixed component of Pj−1 and let Pj−1,ch denote a basis for its\nchanging component. Thus, Pj−1R = [Pj−1,fix,Pj−1,ch], where R is a r × r rotation matrix. We have\nPj = [Pj−1,fix,Pj,chd] (8)\nwhere Pj,chd is the changed component and has the same dimension as Pj−1,ch. Thus,\nSE(Pj−1,Pj) = SE(Pj−1,ch,Pj,chd) (9)\nand so ∆ = maxj SE(Pj−1,Pj) = maxj SE(Pj−1,ch,Pj,chd). Let λ + ch denote the largest eigenvalue along any direction in Pj,chd.\nCorollary 5.20. In Algorithm 2, replace line 17 by P̂(t) ← basis(P̂j−1, P̂j,k). For basis matrices P1,P2, we use P = basis(P1,P2) to mean that P is a basis matrix with column span equal to the column span of\n[P1,P2]. Assume that (8) and (9) hold. Also assume that the conditions of Theorem 2.2 holds with the lower bound on xmin relaxed to xmin ≥ C(ε √ η(r − rch)λ+ + (ε+ ∆) √ ηrchλ + ch). Then, all conclusions of Theorem 2.2 hold."}, {"heading": "6 Empirical Evaluation", "text": "In this section we present the results for extensive numerical experiments on synthetic and real data to validate our theoretical claims. All time comparisons are performed on a Desktop Computer with Intel R© Xeon E3-1240 8-core CPU @ 3.50GHz and 32GB RAM and all synthetic data experiments are averaged over 100 independent trials. The codes are available at https://github.com/praneethmurthy/NORST."}, {"heading": "6.1 Synthetic Data", "text": "We perform three experiments on synthetic data to corroborate our theoretical claims.\nExperiment 1. We compare the results of NORST and Offline-NORST with static RPCA algorithms, and Robust Subspace Tracking/Online RPCA methods proposed in literature. For our first experiment, we generate the changing subspaces using Pj = e γjBjPj−1 as done in [34] where γj controls the subspace change and Bj ’s are skew-symmetric matrices. In the first experiment we used the following parameters. n = 1000, d = 12000, J = 2, t1 = 3000, t2 = 8000, r = 30, γ1 = 0.001, γ2 = γ1 and the matrices B1 and B2 are generated as B1 = (B̃1 − B̃1) and B2 = (B̃2 − B̃2) where the entries of B̃1, B̃2 are generated independently from a standard normal distribution. We set α = 300. This gives us the basis matrices P(t) for all t. To obtain the low-rank matrix L from this we generate the coefficients at ∈ Rr as independent zero-mean, bounded random variables. They are (at)i i.i.d∼ unif [−qi, qi] where qi = √ f − √ f(i − 1)/2r for i = 1, 2, · · · , r − 1 and qr = 1. thus the condition number is f and we selected f = 50. For the sparse supports, we considered two models according to which the supports are generated. First we use Model G.24 [15] which simulates a moving object pacing in the video. For the first ttrain = 100 frames, we used a smaller fraction of outliers with parameters s/n = 0.01, b0 = 0.01. For t > ttrain we used s/n = 0.05 and b0 = 0.3. Secondly, we used the Bernoulli model to simulate sampling uniformly at random, i.e., each entry of the matrix, is independently selected with probability ρ or not selected with probability 1−ρ. We generate the sparse supports using the Bernoulli model using ρ = 0.01 for the first ttrain frames and ρ = 0.3 for the subsequent frames. The sparse outlier magnitudes for both support models are generated uniformly at random from the interval [xmin, xmax] with xmin = 10 and xmax = 20.\nWe initialized the s-ReProCS and NORST algorithms using AltProj applied to Y[1,ttrain] with ttrain = 100. For the parameters to AltProj we used used the true value of r, 15 iterations and a threshold of 0.01. This, and the choice of γ1 and γ2 ensure that SE(P̂init,P0) ≈ SE(P1,P0) ≈ SE(P2,P1) ≈ 0.01. The other algorithm parameters are set as mentioned in the theorem, i.e., K = dlog(c/ε)e = 8, α = Cr log n = 300, ω = xmin/2 = 5 and ξ = 7xmin/15 = 0.67, ωevals = 2ε\n2λ+ = 7.5 × 10−4. For l1 minimization we used the YALL-1 toolbox [35] and set the tolerance to 10−4. For the least-squares step we use the Conjugate Gradient Least Squares instead of the well-known “backslash” operator in MATLAB since this is a well conditioned problem. For this we set the tolerance as 10−10 and the number of iterations as 10. We have not done any code optimization such as use of MEX files for various sub-routines to speed up our algorithm. For the other online methods we implement the algorithms without modifications. The regularization parameter for ORPCA was set as with λ1 = 1/ √ n and λ2 = 1/ √ d according to [21]. Wherever possible we set the tolerance as 10−6 and 100 iterations to match that of our algorithm. As shown in Fig. 2, NORST is significantly better than all the RST methods - s-ReProCS [15], and two popular heuristics from literature - ORPCA [21] and GRASTA [34].\nWe also provide a comparison of offline techniques in Table 2. We must mention here that we implemented the static RPCA methods once on the entire data matrix, Y . We do this to provide a roughly equal comparison of the time taken. In principle, we could also implement the static techniques on disjoint batches of size α, but we observed that this did not yield significant improvement in terms of reconstruction accuracy, while being considerably slower, and thus we report only the latter setting. As can be seen, offline NORST outperforms all static RPCA methods, both for the moving object outlier support model and for the commonly used random Bernoulli support model. For the batch comparison we used PCP, AltProj and RPCA-GD. We set the regularization parameter for PCP 1/ √ n in accordance with [3]. The other known parameters, r for Alt-Proj, outlier-fraction for RPCA-GD, are set using the true values. Furthermore, for all algorithms (the IALM solver in case of PCP) we set the threshold as 10−6 and the number of iterations to 100 as opposed to 10−3 and 50 iterations which were set as default to provide a fair comparison with NORST and Offline-NORST. All results are averaged over 100 independent runs.\nExperiment 2. Next we perform an experiment to validate our claim of NORST admitting a higher fraction of outliers per row than the state of the art. In particular, since AltProj has the highest tolerance to max-outlier-frac-row, we only compare with it. The experiment proceeded as follows. We chose 10 different values of each of r and b0 (we slightly misuse notation here to let b0 := max-outlier-frac-row for this section only). For each pair of b0 and r we implemented NORST and ALtProj over 100 independent trials and computed the relative error in recovering L, i.e., we computed ‖L̂ − L‖F /‖L‖F for each run. We computed the empirical probability of success, i.e., we enumerated the number of times out of 100 the error seen by each algorithm was less than a threshold, 0.5.\nFor each pair of {b0, r} we used the Bernoulli model for sparse support generation, the low rank matrix is generated exactly as done in the previous experiments with the exception that again to provide an equal footing, we increased the “subspace change” by setting γ1 and γ2 to 10 times the value that was used in the previous experiment. For the first ttrain frames we used b0 = 0.02. We provide the phase transition\nplots for both algorithm in Fig. 2. Here, white represents success while black represents failure. As can be seen, NORST is able to tolerate a much larger fraction of outlier-per-row as compared to AltProj.\nExperiment 3. Finally we perform an experiment to analyze the effect of the lower bound on the outlier magnitude xmin with the performance of NORST and AltProj. We show the results in Fig. 4. In the first stage, we generate the data exactly as done in the Moving Object sparse support model of the first experiment. The only change to the data generation parameters is that we now choose three different values of xmin = {0.5, 5, 10}. Furthermore, we set all the non-zero entries of the sparse matrix to be equal to xmin. This is actually harder than allowing the sparse outliers to take on any value since for a moderately low value of xmin the outlier-lower magnitude bound of Theorem 2.2 is violated. This is indeed confirmed by the numerical results presented in Fig. 4. (i) When xmin = 0.5, NORST works well since now all the outliers get classified as the small unstructured noise νt. (ii) When xmin = 10, NORST still works well because now xmin is large enough so that the outlier support is mostly correctly recovered. (iii) But when xmin = 5 the NORST reconstruction error stagnates around 10 −3.\nAll AltProj errors are much worse than those of NORST because the outlier fraction per row is the same as in the first experiment. What can be noticed though is that the variation with varying xmin is not that significant."}, {"heading": "6.2 Real Data", "text": "In this section we provide empirical results on real video for the task of Background Subtraction. For the AltProj algorithm we set r = 40. The remaining parameters were used with default setting. For NORST, we set α = 60, K = 3, ξt = ‖Ψ ˆ̀t−1‖2. We found that these parameters work for most videos that we\nverified our algorithm on. For RPCA-GD we set the “corruption fraction” α = 0.2 as described in their paper.\nMeeting Room (MR) dataset: The meeting room sequence is set of 1964 images of resolution 64× 80. The first 1755 frames consists of outlier-free data. Henceforth, we consider only the last 1209 frames. For NORST, we used ttrain = 400. In the first 400 frames, a person wearing a black shirt walks in, writes something on the board and goes back. In the subsequent frames, the person walks in with a white shirt. This is a challenging video sequence because the color of the person and the color of the curtain are hard to distinguish. NORST is able to perform the separation at around 43 frames per second. We present the results in Fig. 5\nLobby (LB) dataset: This dataset contains 1555 images of resolution 128× 160. The first 341 frames are outlier free. Here we use the first 400 “noisy” frames as training data. The Alt Proj algorithm is used to obtain an initial estimate with rank, r = 40. The parameters used in all algorithms are exactly the same as above. NORST achieves a “test” processing rate of 16 frames-per-second. We present the results in Fig. 6"}, {"heading": "Acknowledgments", "text": "The authors would like to thank Praneeth Netrapalli and Prateek Jain of Microsoft Research India for fruitful discussions on strengthening the guarantee by removing assumptions on subspace change model."}, {"heading": "A Proof of Theorem 2.2", "text": "We divide the proof into 3 parts for better clarity. We first prove the νt = 0 case for NORST (Algorithm 2), then prove the correctness of Offline NORST, and finally explain the changes needed when νt 6= 0.\nA.1 Proof with νt = 0\nRemark A.1 (Deriving the long expression forK given in the discussion). We have used max-outlier-frac-rowα ≤ b0 with b0 = 0.01/f 2 throughout the analysis in order to simplify the proof. If we were not to do this, and if we used [25], it is possible to show that the “decay rate” qk is of the form qk = (c2 √ b0f) kq0 from which it follows that to obtain an ε-accurate approximation of the subspace it suffices to have\nK =\n⌈ log (c1∆/ε)\n− log(c2 √ b0f)\n⌉ .\nWe first prove Theorem 2.2 for the case when tj ’s are known, i.e., correctness of Algorithm 1.\nProof of Theorem 2.2 with assuming tj known. In this case t̂j = tj . The proof is an easy consequence of Lemmas 4.7 and 4.8. Recall that Γj,K ⊆ Γj,K−1 ⊆ · · ·Γj,0 and ΓJ,K ⊆ ΓJ−1,K ⊆ · · · ⊆ Γ1,K . To show that the conclusions of the Theorem hold, it suffices to show that Pr(ΓJ,K |Γ0,0) ≥ 1− 10dn−10. Using the chain rule of probability,\nPr(ΓJ,K |Γ1,0) = Pr(ΓJ,K ,ΓJ−1,K , · · · ,Γ1,K |Γ1,0)\n= J∏ j=1 Pr(Γj,K |Γj,0) = J∏ j=1 Pr(Γj,K ,Γj,K−1, · · · ,Γj,1|Γj,0) = J∏ j=1 K∏ k=1 Pr(Γj,k|Γj,k−1) (a) ≥ (1− 10n−10)JK ≥ 1− 10JKn−10.\nwhere (a) used Pr(Γj,1|Γj,0) ≥ 1−10n−10 from Lemma 4.7 and Pr(Γj,k|Γj,k−1) ≥ 1−10n−10 from Lemma 4.8.\nProof of Theorem 2.2. Define\nt̂j−1,fin := t̂j−1 +Kα, tj,∗ = t̂j−1,fin +\n⌈ tj − t̂j−1,fin\nα\n⌉ α\nThus, t̂j−1,fin is the time at which the (j − 1)-th subspace update is complete; w.h.p., this occurs before tj . With this assumption, tj,∗ is such that tj lies in the interval [tj,∗ − α+ 1, tj,∗]. Recall from the algorithm that we increment j to j + 1 at t = t̂j +Kα := t̂j,fin. Define the events\n1. Det0 := {t̂j = tj,∗} = {λmax( 1α ∑tj,∗ t=tj,∗−α+1 Φ ˆ̀ t ˆ̀′ tΦ) > ωevals} and\nDet1 := {t̂j = tj,∗ + α} = {λmax( 1α ∑tj,∗+α t=tj,∗+1 Φ ˆ̀t ˆ̀ ′ tΦ) > ωevals},\n2. SubUpd := ∩Kk=1SubUpdk where SubUpdk := {SE(P̂j,k,Pj) ≤ qk},\n3. NoFalseDets := {for all J α ⊆ [t̂j,fin, tj+1), λmax( 1α ∑ t∈J α Φ ˆ̀ t ˆ̀′ tΦ) ≤ ωevals}\n4. Γ0,end := {SE(P̂0,P0) ≤ 0.25}, 5. Γj,end := Γj−1,end ∩ ( (Det0 ∩ SubUpd ∩NoFalseDets) ∪ (Det0 ∩Det1 ∩ SubUpd ∩NoFalseDets) ) .\nLet p0 denote the probability that, conditioned on Γj−1,end, the change got detected at t = tj,∗, i.e.,\nlet\np0 := Pr(Det0|Γj−1,end).\nThus, Pr(Det0|Γj−1,end) = 1 − p0. It is not easy to bound p0. However, as we will see, this will not be needed. Assume that Γj−1,end∩Det0 holds. Consider the interval J α := [tj,∗, tj,∗+α). This interval starts at or after tj , so, for all t in this interval, the subspace has changed. For this interval, Φ = I− P̂j−1P̂j−1′. Applying the first item of Lemma 4.12, w.p. at least 1− 10n−10,\nλmax\n( 1\nα ∑ t∈J α Φ ˆ̀t ˆ̀ ′ tΦ\n) ≥ ωevals\nand thus t̂j = tj,∗ + α. In other words,\nPr(Det1|Γj−1,end ∩Det0) ≥ 1− 10n−10.\nConditioned on Γj−1,end ∩ Det0 ∩ Det1, the first SVD step is done at t = t̂j + α = tj,∗ + 2α and the subsequent steps are done every α samples. We can prove Lemma 4.7 with Γj,0 replaced by Γj,end∩Det0∩ Det1 and Lemma 4.8 with Γj,k−1 replaced by Γj,end ∩Det0∩Det1∩SubUpd1 ∩ · · · ∩SubUpdk−1 and with the k-th SVD interval being Jk := [t̂j + (k − 1)α, t̂j + kα). Applying Lemmas 4.7, and 4.8 for each k, we get\nPr(SubUpd|Γj−1,end ∩Det0 ∩Det1) ≥ (1− 10n−10)K+1.\nWe can also do a similar thing for the case when the change is detected at tj,∗, i.e. when Det0 holds. In this case, we replace Γj,0 by Γj,end ∩ Det0 and Γj,k by Γj,end ∩ Det0 ∩ SubUpd1 ∩ · · · ∩ SubUpdk−1 and conclude that\nPr(SubUpd|Γj−1,end ∩Det0) ≥ (1− 10n−10)K .\nFinally consider the NoFalseDets event. First, assume that Γj−1,end ∩Det0∩SubUpd holds. Consider any interval J α ⊆ [t̂j,fin, tj+1). In this interval, P̂(t) = P̂j , Φ = I − P̂jP̂j ′ and SE(P̂j ,Pj) ≤ ε. Using the second part of Lemma 4.12 we conclude that w.p. at least 1− 10n−10,\nλmax\n( 1\nα ∑ t∈J α Φ ˆ̀t ˆ̀ ′ tΦ\n) < ωevals\nSince Det0 holds, t̂j = tj,∗. Thus, we have a total of b tj+1−tj,∗−Kα−αα c intervals J α that are subsets of [t̂j,fin, tj+1). Moreover, b tj+1−tj,∗−Kα−α α c ≤ b tj+1−tj−Kα−α α c ≤ b tj+1−tj α c − (K + 1) since α ≤ α. Thus,\nPr(NoFalseDets|Γj−1,end ∩Det0 ∩ SubUpd) ≥ (1− 10n−10)b tj+1−tj α c−(K)\nOn the other hand, if we condition on Γj−1,end ∩Det0 ∩Det1 ∩ SubUpd, then t̂j = tj,∗ + α. Thus,\nPr(NoFalseDets|Γj−1,end ∩Det0 ∩Det1 ∩ SubUpd) ≥ (1− 10n−10)b tj+1−tj α c−(K+1)\nWe can now combine the above facts to bound Pr(Γj,end|Γj−1,end). Recall that p0 := Pr(Det0|Γj−1,end). Clearly, the events (Det0∩SubUpd∩NoFalseDets) and (Det0∩Det1∩SubUpd∩NoFalseDets) are disjoint.\nThus,\nPr(Γj,end|Γj−1,end) = p0 Pr(SubUpd ∩NoFalseDets|Γj−1,end ∩Det0) + (1− p0) Pr(Det1|Γj−1,end ∩Det0) Pr(SubUpd ∩NoFalseDets|Γj−1,end ∩Det0 ∩Det1) ≥ p0(1− 10n−10)K(1− 10n−10)b tj+1−tj α c−(K) + (1− p0)(1− 10n−10)(1− 10n−10)K(1− 10n−10)b tj+1−tj α c−(K+1) = (1− 10n−10)b tj+1−tj α c ≥ (1− 10n−10)tj+1−tj .\nSince the events Γj,end are nested, the above implies that\nPr(ΓJ,end|Γ0,end) = ∏ j Pr(Γj,end|Γj−1,end) ≥ ∏ j (1− 10n−10)tj+1−tj = (1− 10n−10)d\n≥ 1− 10dn−10.\nA.2 Proof of Offline NORST\nWe now provide the proof of the Offline Algorithm (lines 26-30 of Algorithm 2).\nProof of Offline NORST. The proof of this follows from the conclusions of the online counterpart. Note that the subspace estimate in this case is not necessarily r dimensional. This is essentially done to ensure that in the time intervals when the subspace has changed, but has not yet been updated, the output of the algorithm is still an ε-approximate solution to the true subspace. In other words, for t ∈ [t̂j−1 +Kα, tj ], the true subspace is Pj−1 and so in this interval\nSE(P̂ offline(t) ,Pj−1) = SE([P̂j−1, (I − P̂j−1P̂j−1 ′)P̂j ],Pj−1) (a) = ∥∥∥[I − (I − P̂j−1P̂j−1′)P̂jP̂j ′(I − P̂j−1P̂j−1′)][I − P̂j−1P̂j−1′]Pj−1∥∥∥\n≤ ∥∥∥[I − (I − P̂j−1P̂j−1′)P̂jP̂j ′(I − P̂j−1P̂j−1′)]∥∥∥SE(P̂j−1,Pj−1) ≤ ε\nwhere (a) follows because for orthogonal matrices P1 and P2,\nI − P1P1′ − P2P2′ = (I − P1P1′)(I − P2P2′) = (I − P2P2′)(I − P1P1′)\nNow consider the interval t ∈ [tj , t̂j + Kα]. In this interval, the true subspace is Pj and we have back propagated the ε-approximate subspace P̂j in this interval. We first note that span([P̂j−1, (I − P̂j−1P̂j−1\n′)P̂j ]) = span([P̂j , (I − P̂jP̂j ′)P̂j−1]). And so we use the latter to quantify the error in this interval as\nSE(P̂ offline(t) ,Pj) = SE([P̂j , (I − P̂jP̂j ′)P̂j−1],Pj) = ∥∥∥[I − (I − P̂jP̂j ′)P̂j−1P̂j−1′(I − P̂jP̂j ′)][I − P̂jP̂j ′]Pj∥∥∥\n≤ ∥∥∥[I − (I − P̂jP̂j ′)P̂j−1P̂j−1′(I − P̂jP̂j ′)]∥∥∥SE(P̂j ,Pj) ≤ ε\nA.3 Proof with νt 6= 0\nIn this section we analyze the “stable” version of RST, i.e., we let νt 6= 0.\nProof. The proof is very similar to that of the noiseless case but there are two differences due to the additional noise term. The first is the effect of the noise on the sparse recovery step. The approach to address this is straightforward. We note that the error now seen in the sparse recovery step is bounded by ‖Ψ(`t + νt)‖ and using the bound on ‖νt‖, we observe that the error only changes by a constant factor. In particular, we can show that ‖et‖ ≤ 2.4(2ε + ∆) √ ηrλ+. The other crucial difference is in updating subspace estimate. To deal with the additional uncorrelated noise, we use the following result.\nRemark 4.18 of [25] states the following for the case where the data contains unstructured noise νt that satisfies the assumptions of Theorem 2.2. Thus, in the notation of [25], λ+v ≤ cε2λ+ and rv = r. The following result also assumes r, n large enough so that (r + log n) ≤ r log n.\nCorollary A.2 (Noisy PCA-SDDN). Given data vectors yt := `t + wt + zt = `t + ITtMs,t`t + zt, t = 1, 2, . . . , α, where Tt is the support set of wt, and `t satisfying the model detailed above. Furthermore, maxt ‖Ms,tP ‖2 ≤ q < 1. zt is small uncorrelated noise such that E[ztzt′] = Σz, maxt ‖zt‖2 := b2z < ∞. Define λ+z := λmax(Σz) and rz as the “effective rank” of zt such that b 2 z = rzλ + z . Then for any α ≥ α0, where\nα0 := C\nε2SE max\n{ ηq2f2r log n,\nb2z λ− f log n } the fraction of nonzeroes in any row of the noise matrix [w1,w2, . . . ,wα] is bounded by b, and\n3 √ bqf + λ+z /λ\n− ≤ 0.9εSE 1 + εSE\nFor an α ≥ α0, let P̂ be the matrix of top r eigenvectors of D := 1α ∑ t yty ′ t. With probability at least 1− 10n−10, SE(P̂ ,P ) ≤ εSE.\nWe illustrate how applying Corollary A.2 changes the subspace update step. Consider the first subspace estimate, i.e., we are trying to get an estimate P̂j,1 in the j-th subspace change time interval. Define (e`)t = ITt ′ (ΨTt ′ΨTt) −1 ΨTt ′`t and (eν)t = ITt ′ (ΨTt ′ΨTt) −1 ΨTt ′νt. We estimate the new subspace, P̂j,1\nas the top r eigenvectors of 1α ∑t̂j+α−1 t=t̂j ˆ̀ t ˆ̀ t ′. In the setting above, yt ≡ ˆ̀t, wt ≡ (e`)t, zt ≡ (eν)t, `t ≡ `t and Ms,t = − (ΨTt ′ΨTt) −1 ΨTt ′ and so ‖Ms,tP ‖ = ‖ (ΨTt ′ΨTt) −1 ΨTt\n′Pj‖ ≤ φ+(ε+ SE(Pj−1,Pj)) := q0. Applying Corollary A.2 with q ≡ q0, and recalling that the support, Tt satisfies the assumptions similar to that of the noiseless case and hence b0 ≡ max-outlier-frac-rowα. Now, setting εSE,1 = q0/4, observe that we require\n(i) √ b0q0f ≤\n0.5 · 0.9εSE,1 1 + εSE,1 , and, (ii) λ+z λ− ≤ 0.5 · 0.9εSE,1 1 + εSE,1 .\nwhich holds if (i) √ b0f ≤ 0.12, and (ii) is satisfied as follows from using the assumptions on νt as follows. It is immediate to see that λ+z /λ − ≤ ε2 ≤ .2εSE,1. Furthermore, the sample complexity term remains unchanged due to the choice of νt. To see this, notice that the only extra term in the α0 expression is b2zf log n/(ε 2 SEλ −) which simplifies to ε2f2r log n/ε2SE which is what was required even in the noiseless case. Thus, from Corollary A.2, with probability at least 1 − 10n−10, SE(P̂j,1,Pj) ≤ εSE,1 = q0/4. The argument in other subspace update stages will require the same changes and follows without any further differences.\nThe final difference is in the subspace detection step. Notice that here too, in general, there will be some extra assumption required to provably detect the subspace change. However, due to the bounds assumed on ‖νt‖ and the bounds on using l,v = v,v = 0.01ε, we see that (i) the extra sample complexity term is the same as that required in the noiseless case."}, {"heading": "B Proof of Lemmas 4.13 and 4.16", "text": "Proof of Lemma 4.13. The proof follows from triangle inequality as SE(Q1,Q3) = ∥∥(I −Q1Q1′)Q3∥∥ = ∥∥(I −Q1Q1′)(I −Q2Q2′ +Q2Q2′)Q3∥∥\n≤ ∥∥(I −Q1Q1′)(I −Q2Q2′)Q3∥∥+ ∥∥(I −Q1Q1′)Q2Q2′Q3∥∥\n≤ ∥∥(I −Q1Q1′)∥∥SE(Q2,Q3) + SE(Q1,Q2)∥∥Q2′Q3∥∥ ≤ ∆1 + ∆2\nWe need the following results for proving Lemma 4.16.\nTheorem B.1 (Cauchy-Schwartz for sums of matrices [12]). For matrices X and Y we have∥∥∥∥∥ 1α∑ t XtYt ′ ∥∥∥∥∥ 2 ≤ ∥∥∥∥∥ 1α∑ t XtXt ′ ∥∥∥∥∥ ∥∥∥∥∥ 1α∑ t YtYt ′ ∥∥∥∥∥ (10) The following theorem is adapted from [28].\nTheorem B.2 (Matrix Bernstein [28]). Given an α-length sequence of n1× n2 dimensional random matrices and a r.v. X. Assume the following holds. For all X ∈ C, (i) conditioned on X, the matrices Zt are mutually independent, (ii) P(‖Zt‖ ≤ R|X) = 1, and (iii) max {∥∥ 1 α ∑ t E[Zt′Zt|X] ∥∥ , ∥∥ 1α∑t E[ZtZt′|X]∥∥} ≤ σ2. Then, for an > 0 and for all X ∈ C,\nP (∥∥∥∥∥ 1α∑ t Zt ∥∥∥∥∥ ≤ ∥∥∥∥∥ 1α∑ t E[Zt|X] ∥∥∥∥∥+ ∣∣∣∣X ) ≥ 1− (n1 + n2) exp ( −α 2 2 (σ2 +R ) ) . (11)\nThe following theorem is adapted from [29].\nTheorem B.3 (Sub-Gaussian Rows [29]). Given an N -length sequence of sub-Gaussian random vectors wi in Rnw , an r.v X, and a set C. Assume the following holds. For all X ∈ C, (i) wi are conditionally independent given X; (ii) the sub-Gaussian norm of wi is bounded by K for all i. Let W := [w1,w2, . . . ,wN ] ′. Then for an ∈ (0, 1) and for all X ∈ C\nP (∥∥∥∥ 1NW ′W − 1N E[W ′W |X] ∥∥∥∥ ≤ ∣∣∣∣X) ≥ 1− 2 exp(nw log 9− c 2N4K4 ) . (12)\nProof of Lemma 4.16. The proof approach is similar to that of [15, Lemma 7.17] but the details are different since we use a simpler subspace model.\nItem 1 : Recall that the (at)i are bounded r.v.’s satisfying |(at)i| ≤ √ ηλi. Thus, the vectors, at are sub-Gaussian with ‖at‖ψ2 = maxi ‖(at)i‖ψ2 = √ ηλ+. We now apply Theorem B.3 with K ≡ √ ηλ+,\n= 0λ −, N ≡ α and nw ≡ r to conclude the following: For an α ≥ α(0) := C(r log 9 + 10 log n)f2,\nPr (∥∥∥∥∥ 1α∑ t atat ′ −Λ ∥∥∥∥∥ ≤ 0λ− ) ≥ 1− 10n−10\nThe Lemma statement assumes α = Cf2r log n. For large r, n, this α > α(0) = Cf 2(r+ log n). Thus, the above holds under the Lemma statement.\nItem 2 : For the second term, we proceed as follows. Since ‖Φ‖ = 1,∥∥∥∥∥ 1α∑ t Φ`tet ′Φ ∥∥∥∥∥ ≤ ∥∥∥∥∥ 1α∑ t Φ`tet ′ ∥∥∥∥∥ .\nTo bound the RHS above, we will apply Theorem B.2 with Zt = Φ`tet ′. Conditioned on {P̂∗, Z}, the Zt’s are mutually independent. We first bound obtain a bound on the expected value of the time average of the Zt’s and then compute R and σ 2. By Cauchy-Schwartz,∥∥∥∥∥E [ 1 α ∑ t Φ`tet ′ ]∥∥∥∥∥ 2 = ∥∥∥∥∥ 1α∑ t ΦPΛP ′M1,t ′M2,t ′ ∥∥∥∥∥ 2\n(a) ≤ ∥∥∥∥∥ 1α∑ t ( ΦPΛP ′M1,t ′) (M1,tPΛP ′Φ) ∥∥∥∥∥ ∥∥∥∥∥ 1α∑ t M2,tM2,t ′ ∥∥∥∥∥ (b)\n≤ b0 [ max t ∥∥ΦPΛP ′M1,t′∥∥2] ≤ b0SE2(P̂ ,P )q2(λ+)2 (13)\nwhere (a) follows by Cauchy-Schwartz (Theorem B.1) withXt = ΦPΛP ′M1,t ′ and Yt = M2,t, (b) follows from the assumption on M2,t. To compute R\n‖Zt‖ ≤ ‖Φ`t‖ ‖et‖ ≤ SE(P̂ ,P )qηrλ+ := R\nNext we compute σ2. Since wt’s are bounded r.v.’s, we have∥∥∥∥∥ 1α∑ t E[ZtZt′] ∥∥∥∥∥ = ∥∥∥∥∥ 1α∑ t E [ Φ`tet ′et`t ′Φ ]∥∥∥∥∥ = ∥∥∥∥ 1αE[‖et‖2 Φ`t`t′Φ] ∥∥∥∥\n≤ (\nmax et ‖et‖2 )∥∥∥∥∥ 1α∑ t E [ Φ`t`t ′Φ ]∥∥∥∥∥\n≤ q2SE2(P̂ ,P )ηr(λ+)2· := σ2\nit can also be seen that ∥∥ 1 α ∑ t E[Zt′Zt] ∥∥ evaluates to the same expression. Thus, applying Theorem B.2 Pr\n(∥∥∥∥∥ 1α∑ t Φ`tet ′ ∥∥∥∥∥ ≤ SE(P̂ ,P )√b0qλ+ + )\n≥ 1− 2n exp  −α 4 max { σ2 2 , R }  .\nLet = 1λ −, then, σ2/ 2 = cηf2r and R/ = cηfr. Hence, for the probability to be of the form 1−2n−10 we require that α ≥ α(1) := C · ηf2(r log n). Item 3 : We use Theorem B.2 with Zt := Φetet ′Φ. The proof is analogous to the previous item. First we bound the norm of the expectation of the time average of Zt:∥∥∥∥E [ 1α∑Φetet′Φ ]∥∥∥∥ = ∥∥∥∥ 1α∑ΦM2,tM1,tPΛP ′M1,t′M2,t′Φ\n∥∥∥∥ ≤ ∥∥∥∥ 1α∑M2,tM1,tPΛP ′M1,t′M2,t′\n∥∥∥∥ (a) ≤\n(∥∥∥∥∥ 1α∑ t M2,tM2,t ′ ∥∥∥∥∥ [maxt ∥∥M2,tM1,tPΛP ′M1,t(·)′∥∥2] )1/2\n(b) ≤ √ b0 [ max t ∥∥M1,tPΛP ′M1,t′M2,t′∥∥] ≤√b0q2λ+\nwhere (a) follows from Theorem B.1 with Xt = M2,t and Yt = M1,tPΛP ′M1,t ′M2,t ′ and (b) follows from the assumption on M2,t. To obtain R,\n‖Zt‖ = ∥∥Φetet′Φ∥∥ ≤ max\nt ‖ΦMtPat‖2 ≤ q2rηλ+ := R\nTo obtain σ2, ∥∥∥∥∥ 1α∑ t E [ Φet(Φet) ′(Φet)et ′Φ ]∥∥∥∥∥ = ∥∥∥∥∥ 1α∑ t E [ Φetet ′Φ ‖Φet‖2 ]∥∥∥∥∥\n≤ (\nmax et ‖Φet‖2 )∥∥ΦMtPΛP ′Mt′Φ∥∥ ≤ q2rηλ+ · q2λ+ := σ2\nApplying Theorem B.2, we have\nPr (∥∥∥∥∥ 1α∑ t Φetet ′Φ ∥∥∥∥∥ ≤√b0q2λ+ + ) ≥ 1− n exp ( −α 2 2(σ2 +R ) ) Letting = 2λ − we get R/ = cηrf and σ2/ 2 = cηrf2. For the success probability to be of the form 1− 2n−10 we require α ≥ α(2) := Cη · 11f2(r log n).\nThe proof of the last two items follow from using [25, Lemma 7.19]."}, {"heading": "C Proof of Extensions", "text": "In this section we present the proof of the extensions stated in Sec. 5.\nC.1 Static Robust PCA\nThe proof follows directly from Theorem 2.2 by setting J = 1.\nC.2 Subspace Tracking with missing data and dynamic Matrix Completion\nHere we present the proof of the subspace tracking with missing data problem. The only changes needed for this proof are in the initialization step, i.e., for j = 0. For this we use the following lemma.\nLemma C.1 (Lemma 2.1, [33]). Set r̄ = max(r, log n). Then there exist constants C and c such that\nthe random orthogonal model with left singular vectors P̂init obeys Pr ( maxi ∥∥∥Ii′P̂init∥∥∥2 ≤ Cr̄/n) ≥ 1 − cn−β log n.\nThus,\nPr ( max i ∥∥∥Ii′P̂init∥∥∥2 ≤ µr̄/n) ≥ 1− n−10 Consider the two scenarios (i) if r ≥ log n, then everything discussed before remains true, whereas, if (ii) r ≤ log n, we redefine µ2 = C log n/r and thus in the interval [t0, t1] we require max-outlier-frac-col ≤ 0.01logn . Further, using the bound on max-outlier-frac-col it follows from triangle inequality that\nmax T ≤2s ∥∥∥IT ′P̂init∥∥∥2 ≤ 2smax i ∥∥∥Ii′P̂init∥∥∥2 ≤ 2sµr n < 0.01\nWe only mention the changes needed for Lemma 4.7 for when j = 0 since the initialization is different. The rest of the argument of recursively applying the lemmas hold exactly as before. First, ttrain = 1 since we use random initialization. Thus from the Algorithm, t̂0 = ttrain = 1.\nProof. Proof of item 1. Since the support of xt is known, the LS step gives x̂t = ITt ( ΨTt ′ΨTt )−1 ΨTt ′(Ψ`t + Ψxt) = ITt ( ΨTt ′ΨTt )−1 ITt ′Ψ`t + xt\nThus et = x̂t − xt satisfies\net = ITt ( ΨTt ′ΨTt )−1 ITt ′Ψ`t\nNow, from the incoherence assumption on P̂init, Lemma 4.11, the bound on max-outlier-frac-col, and recalling that in this interval, Ψ = I − P̂initP̂init′ we have\nmax |T |≤2s ∥∥∥IT ′P̂init∥∥∥2 ≤ 2sµr n ≤ 0.09 =⇒ δ2s(Ψ) ≤ 0.32 < 0.15,∥∥∥(ΨTt ′ΨTt)−1∥∥∥ ≤ 11− δs(Ψ) ≤ 11− δ2s(Ψ) ≤ 11− 0.15 < 1.2 = φ+.\nSecondly, ∥∥ITt ′ΨP0∥∥ ≤ (∥∥ITt ′P0∥∥+ ∥∥∥ITt ′P̂init∥∥∥) ≤ 0.3 + 0.3 = 0.6 (14) Thus, ‖ITt ′Ψ`t‖ ≤ 0.6 √ ηrλ+.\nProof of Item 2 : Since ˆ̀t = `t − et with et satisfying the above equation, updating P̂(t) from the ˆ̀t’s is a problem of PCA in sparse data-dependent noise (SDDN), et. To analyze this, we use the PCA-SDDN result of Theorem 4.14 (this is taken from [25]). Recall from above that, for t ∈ [t̂0, t̂0 + α], T̂t = Tt, and ˆ̀ t = `t − et. Recall from the algorithm that we compute the first estimate of the j-th subspace, P̂j,1,\nas the top r eigenvectors of 1α ∑t0+α−1 t=t0 ˆ̀ t ˆ̀ t ′. In the notation of Theorem 4.14, yt ≡ ˆ̀t, wt ≡ et, `t ≡ `t and Ms,t = − (ΨTt ′ΨTt) −1 ΨTt ′ and so ‖Ms,tP ‖ = ‖ (ΨTt ′ΨTt) −1 ΨTt\n′P0‖ ≤ φ+ · 0.6 = 0.72 := q0. This follows using (14). Also, b0 ≡ max-outlier-frac-rowα.\nApplying Theorem 4.14 with q ≡ q0, b0 ≡ max-outlier-frac-rowα and setting εSE = q0/4, observe that we require √\nb0q0f ≤ 0.9(q0/4)\n1 + (q0/4) .\nThis holds if √ b0f ≤ 0.12 as provided by Theorem 2.2. Thus, from Corollary 4.14, with probability at least 1− 10n−10, SE(P̂j,1,P0) ≤ q0/4.\nC.3 Fewer than r directions change\nProof of Corollary 5.20. The proof is very similar to that of Theorem 2.2. The only changes occur in the (a) Projected CS step. With the subspace change model, we define `t = P(t)at := [ Pj−1,fix Pj,chd ] [at,fix at,chd ] where at,fix is a (r − rch)× 1 dimensional vector and at,chd is a rch × 1 dimensional vector. In the first α frames after the j-th subspace changes (or, the j-th subspace change is detected in the automatic case), recall that P̂(t) = P̂j−1. Thus, SE(P̂(t),Pj−1,fix) = SE(P̂j−1,Pj−1,fix) ≤ SE(P̂j−1,Pj−1) ≤ ε and so, the error can be bounded as\n‖Ψ`t‖ ≤ ‖ΨPj−1,fixat,fix‖+ ‖ΨPj,chdat,chd‖ ≤ ε √ η(r − rch)λ+ + (ε+ SE(Pj−1,Pj)) √ ηrchλ + ch\nIn the second α frames, have P̂(t) = basis(P̂j−1, P̂j,1). Thus SE(P̂(t),Pj−1,fix) ≤ SE(P̂j−1,Pj−1,fix) ≤ SE(P̂j−1,Pj−1) ≤ ε and SE(P̂(t),Pj,chd) ≤ SE(P̂j,1,Pj,chd) ≤ SE(P̂j,1,Pj) ≤ 0.3 · (ε + SE(Pj−1,Pj)). Thus, the error in the sparse recovery step in the interval after the first subspace update is performed is given as\n‖Ψ`t‖ ≤ ε √ η(r − rch)λ+ + 0.3 · (ε+ SE(Pj−1,Pj)) √ ηrchλ + ch\nThe rest of the proof follows as before. The error after the k-th subspace update is also bounded using the above idea.\n(b) Subspace Detection step: The proof of the subspace detection step follows exactly analogous to Lemma 4.12. One minor observation is noting that SE(Pj−1,PJ) = SE(Pj−1,ch,Pj,chd) in the proof of part (a) of Lemma 4.12. The rest of the argument is exactly the same."}], "year": 2018, "references": [{"title": "Nearly optimal robust subspace tracking", "authors": ["P. Narayanamurthy", "N. Vaswani"], "venue": "ICML, pp. 3698– 3706, 2018.", "year": 2018}, {"title": "A Fast and Memory-Efficient Algorithm for Robust PCA (MERoP)", "authors": ["P. Narayanamurthy", "N. Vaswani"], "venue": "IEEE Intl. Conf. Acoustics, Speech, Sig. Proc. (ICASSP), 2018.", "year": 2018}, {"title": "Robust principal component analysis", "authors": ["E.J. Candès", "X. Li", "Y. Ma", "J. Wright"], "venue": "J. ACM, vol. 58, no. 3, 2011.", "year": 2011}, {"title": "A multibody factorization method for independently moving objects", "authors": ["J.P. Costeira", "T. Kanade"], "venue": "International Journal of Computer Vision, vol. 29, no. 3, pp. 159–179, 1998.", "year": 1998}, {"title": "Signal detection using multi-channel seismic data", "authors": ["G.S. Wagner", "T.J. Owens"], "venue": "Bulletin of the Seismological Society of America, vol. 86, no. 1A, pp. 221–231, 1996.", "year": 1996}, {"title": "Recursive tensor subspace tracking for dynamic brain network analysis", "authors": ["A. Ozdemir", "E.M. Bernat", "S. Aviyente"], "venue": "IEEE Transactions on Signal and Information Processing over Networks, 2017.", "year": 2017}, {"title": "Rank-sparsity incoherence for matrix decomposition", "authors": ["V. Chandrasekaran", "S. Sanghavi", "P.A. Parrilo", "A.S. Willsky"], "venue": "SIAM Journal on Optimization, vol. 21, 2011.", "year": 2011}, {"title": "Robust matrix decomposition with sparse corruptions", "authors": ["D. Hsu", "S.M. Kakade", "T. Zhang"], "venue": "IEEE Trans. Info. Th., Nov. 2011.", "year": 2011}, {"title": "Non-convex robust pca", "authors": ["P. Netrapalli", "U N Niranjan", "S. Sanghavi", "A. Anandkumar", "P. Jain"], "venue": "NIPS, 2014.", "year": 2014}, {"title": "Fast algorithms for robust pca via gradient descent", "authors": ["X. Yi", "D. Park", "Y. Chen", "C. Caramanis"], "venue": "NIPS, 2016.", "year": 2016}, {"title": "Nearly-optimal robust matrix completion", "authors": ["Y. Cherapanamjeri", "K. Gupta", "P. Jain"], "venue": "ICML, 2016.", "year": 2016}, {"title": "Recursive robust pca or recursive sparse recovery in large but structured noise", "authors": ["C. Qiu", "N. Vaswani", "B. Lois", "L. Hogben"], "venue": "IEEE Trans. Info. Th., pp. 5007–5039, August 2014.", "year": 2014}, {"title": "Online matrix completion and online robust pca", "authors": ["B. Lois", "N. Vaswani"], "venue": "IEEE Intl. Symp. Info. Th. (ISIT), 2015.", "year": 2015}, {"title": "Online (and Offline) Robust PCA: Novel Algorithms and Performance Guarantees", "authors": ["J. Zhan", "B. Lois", "H. Guo", "N. Vaswani"], "venue": "Intnl. Conf. Artif. Intell. Stat. (AISTATS), 2016.", "year": 2016}, {"title": "Provable dynamic robust pca or robust subspace tracking", "authors": ["P. Narayanamurthy", "N. Vaswani"], "venue": "arXiv:1705.08948 (submitted to IEEE Trans. Info. Theory), 2017.", "year": 2017}, {"title": "Projection approximation subspace tracking", "authors": ["B. Yang"], "venue": "IEEE Trans. Sig. Proc., pp. 95–107, 1995. 28", "year": 1995}, {"title": "Petrels: Parallel subspace estimation and tracking by recursive least squares from partial observations", "authors": ["Y. Chi", "Y.C. Eldar", "R. Calderbank"], "venue": "IEEE Trans. Sig. Proc., December 2013.", "year": 2013}, {"title": "Local convergence of an algorithm for subspace identification from partial data", "authors": ["L. Balzano", "S. Wright"], "venue": "Found. Comput. Math., vol. 15, no. 5, 2015.", "year": 2015}, {"title": "Schubert varieties and distances between subspaces of different dimensions", "authors": ["K. Ye", "L.H. Lim"], "venue": "SIAM Journal on Matrix Analysis and Applications, vol. 37, no. 3, pp. 1176–1197, 2016.", "year": 2016}, {"title": "Online robust pca via stochastic optimization", "authors": ["J. Feng", "H. Xu", "S. Yan"], "venue": "NIPS, 2013.", "year": 2013}, {"title": "The restricted isometry property and its implications for compressed sensing", "authors": ["E. Candes"], "venue": "C. R. Math. Acad. Sci. Paris Serie I, 2008.", "year": 2008}, {"title": "Robust pca with partial subspace knowledge", "authors": ["J. Zhan", "N. Vaswani"], "venue": "IEEE Trans. Sig. Proc., July 2015.", "year": 2015}, {"title": "A proximal-gradient homotopy method for the l1-regularized leastsquares problem", "authors": ["Lin Xiao", "Tong Zhang"], "venue": "ICML, 2012.", "year": 2012}, {"title": "Finite sample guarantees for pca in non-isotropic and datadependent noise", "authors": ["N. Vaswani", "P. Narayanamurthy"], "venue": "arXiv:1709.06255, 2017.", "year": 2017}, {"title": "Randomized block krylov methods for stronger and faster approximate singular value decomposition", "authors": ["Cameron Musco", "Christopher Musco"], "venue": "Advances in Neural Information Processing Systems, 2015, pp. 1396–1404.", "year": 2015}, {"title": "Correlated-pca: Principal components’ analysis when data and noise are correlated", "authors": ["N. Vaswani", "H. Guo"], "venue": "Adv. Neural Info. Proc. Sys. (NIPS), 2016.", "year": 2016}, {"title": "User-friendly tail bounds for sums of random matrices", "authors": ["J.A. Tropp"], "venue": "Found. Comput. Math., vol. 12, no. 4, 2012.", "year": 2012}, {"title": "Introduction to the non-asymptotic analysis of random matrices", "authors": ["R. Vershynin"], "venue": "Compressed sensing, pp. 210–268, 2012.", "year": 2012}, {"title": "Dimensionality reduction for fast similarity search in large time series databases", "authors": ["E. Keogh", "K. Chakrabarti", "M. Pazzani", "S. Mehrotra"], "venue": "Knowledge and information Systems, vol. 3, no. 3, pp. 263–286, 2001.", "year": 2001}, {"title": "Hyperspectral image classification and dimensionality reduction: an orthogonal subspace projection approach", "authors": ["J.C. Harsanyi", "C.I. Chang"], "venue": "IEEE Transactions on geoscience and remote sensing, vol. 32, no. 4, pp. 779–785, 1994.", "year": 1994}, {"title": "Exact matrix completion via convex optimization", "authors": ["E.J. Candes", "B. Recht"], "venue": "Found. of Comput. Math, , no. 9, pp. 717–772, 2008.", "year": 2008}, {"title": "Incremental gradient on the grassmannian for online foreground and background separation in subsampled video", "authors": ["J. He", "L. Balzano", "A. Szlam"], "venue": "IEEE Conf. on Comp. Vis. Pat. Rec. (CVPR), 2012. 29", "year": 2012}], "id": "SP:cff617462752879038a64bf0f9e56a3d4ab58320", "authors": [{"name": "Praneeth Narayanamurthy", "affiliations": []}, {"name": "Namrata Vaswani", "affiliations": []}], "abstractText": "In this work, we study the robust subspace tracking (RST) problem and obtain one of the first two provable guarantees for it. The goal of RST is to track sequentially arriving data vectors that lie in a slowly changing low-dimensional subspace, while being robust to corruption by additive sparse outliers. It can also be interpreted as a dynamic (time-varying) extension of robust PCA (RPCA), with the minor difference that RST also requires a short tracking delay. We develop a recursive projected compressive sensing algorithm that we call Nearly Optimal RST via ReProCS (ReProCS-NORST) because its tracking delay is nearly optimal. We prove that NORST solves both the RST and the dynamic RPCA problems under weakened standard RPCA assumptions, two simple extra assumptions (slow subspace change and most outlier magnitudes lower bounded), and a few minor assumptions. Our guarantee shows that NORST enjoys a near optimal tracking delay of O(r log n log(1/ )). Its required delay between subspace change times is the same, and its memory complexity is n times this value. Thus both these are also nearly optimal. Here n is the ambient space dimension, r is the subspaces’ dimension, and is the tracking accuracy. NORST also has the best outlier tolerance compared with all previous RPCA or RST methods, both theoretically and empirically (including for real videos), without requiring any model on how the outlier support is generated. This is possible because of the extra assumptions it uses.", "title": "Nearly Optimal Robust Subspace Tracking"}