{"sections": [{"heading": "1. Introduction", "text": "Deep neural networks have recently received much limelight for their enormous success in a variety of applications across many different areas of artificial intelligence, computer vision, speech recognition, and natural language processing (LeCun et al., 2015; Hinton et al., 2012; Krizhevsky et al., 2012; Bahdanau et al., 2014; Kalchbrenner & Blunsom, 2013). Nevertheless, it is also well-known that our theoretical understanding of their efficacy remains incomplete.\nThere have been several attempts to analyze deep neural networks from different perspectives. Notably, earlier studies have suggested that a deep architecture could use parameters more efficiently and requires exponentially fewer parameters to express certain families of functions than a shallow architecture (Delalleau & Bengio, 2011; Bengio & Delal-\n1Department of Computer Science, University of Chicago, Chicago, IL 2Department of Statistics, University of Chicago, Chicago, IL 3Computational and Applied Mathematics Initiative, University of Chicago, Chicago, IL. Correspondence to: Lek-Heng Lim <lekheng@galton.uchicago.edu>.\nProceedings of the 35 th International Conference on Machine Learning, Stockholm, Sweden, PMLR 80, 2018. Copyright 2018 by the author(s).\nleau, 2011; Montufar et al., 2014; Eldan & Shamir, 2016; Poole et al., 2016; Arora et al., 2018). Recent work (Zhang et al., 2016) showed that several successful neural networks possess a high representation power and can easily shatter random data. However, they also generalize well to data unseen during training stage, suggesting that such networks may have some implicit regularization. Traditional measures of complexity such as VC-dimension and Rademacher complexity fail to explain this phenomenon. Understanding this implicit regularization that begets the generalization power of deep neural networks remains a challenge.\nThe goal of our work is to establish connections between neural network and tropical geometry in the hope that they will shed light on the workings of deep neural networks. Tropical geometry is a new area in algebraic geometry that has seen an explosive growth in the recent decade but remains relatively obscure outside pure mathematics. We will focus on feedforward neural networks with rectified linear units (ReLU) and show that they are analogues of rational functions, i.e., ratios of two multivariate polynomials f, g in variables x1, . . . , xd,\nfpx1, . . . , xdq gpx1, . . . , xdq ,\nin tropical algebra. For standard and trigonometric polynomials, it is known that rational approximation — approximating a target function by a ratio of two polynomials instead of a single polynomial — vastly improves the quality of approximation without increasing the degree. This gives our analogue: An ReLU neural network is the tropical ratio of two tropical polynomials, i.e., a tropical rational function. More precisely, if we view a neural network as a function ν : Rd Ñ Rp, x “ px1, . . . , xdq ÞÑ pν1pxq, . . . , νppxqq, then each ν is a tropical rational map, i.e., each νi is a tropical rational function. In fact, we will show that:\nthe family of functions represented by feedforward neural networks with rectified linear units and integer weights is exactly the family of tropical rational maps.\nIt immediately follows that there is a semifield structure on this family of functions. More importantly, this establishes a\nar X\niv :1\n80 5.\n07 09\n1v 1\n[ cs\n.L G\n] 1\n8 M\nay 2\n01 8\nbridge between neural networks1 and tropical geometry that allows us to view neural networks as well-studied tropical geometric objects. This insight allows us to closely relate boundaries between linear regions of a neural network to tropical hypersurfaces and thereby facilitate studies of decision boundaries of neural networks in classification problems as tropical hypersurfaces. Furthermore, the number of linear regions, which captures the complexity of a neural network (Montufar et al., 2014; Raghu et al., 2017; Arora et al., 2018), can be bounded by the number of vertices of the polytopes associated with the neural network’s tropical rational representation. Lastly, a neural network with one hidden layer can be completely characterized by zonotopes, which serve as building blocks for deeper networks.\nIn Sections 2 and 3 we introduce basic tropical algebra and tropical algebraic geometry of relevance to us. We state our assumptions precisely in Section 4 and establish the connection between tropical geometry and multilayer neural networks in Section 5. We analyze neural networks with tropical tools in Section 6, proving that a deeper neural network is exponentially more expressive than a shallow network — though our objective is not so much to perform state-of-the-art analysis but to demonstrate that tropical algebraic geometry can provide useful insights. All proofs are deferred to Section D of the supplement."}, {"heading": "2. Tropical algebra", "text": "Roughly speaking, tropical algebraic geometry is an analogue of classical algebraic geometry over C, the field of complex numbers, but where one replaces C by a semifield2 called the tropical semiring, to be defined below. We give a brief review of tropical algebra and introduce some relevant notations. See (Itenberg et al., 2009; Maclagan & Sturmfels, 2015) for an in-depth treatment.\nThe most fundamental component of tropical algebraic geometry is the tropical semiring T :“ ` R Y t´8u,‘,d ˘\n. The two operations ‘ and d, called tropical addition and tropical multiplication respectively, are defined as follows.\nDefinition 2.1. For x, y P R, their tropical sum is x‘ y :“ maxtx, yu; their tropical product is x d y :“ x ` y; the tropical quotient of x over y is xm y :“ x´ y.\nFor any x P R, we have ´8 ‘ x “ 0 d x “ x and ´8d x “ ´8. Thus ´8 is the tropical additive identity and 0 is the tropical multiplicative identity. Furthermore, these operations satisfy the usual laws of arithmetic: associativity, commutativity, and distributivity. The set RY t´8u is therefore a semiring under the operations‘ andd. While it is not a ring (lacks additive inverse), one may nonetheless\n1Henceforth a “neural network” will always mean a feedforward neural network with ReLU activation.\n2A semifield is a field sans the existence of additive inverses.\ngeneralize many algebraic objects (e.g., matrices, polynomials, tensors, etc) and notions (e.g., rank, determinant, degree, etc) over the tropical semiring — the study of these, in a nutshell, constitutes the subject of tropical algebra.\nLet N “ tn P Z : n ě 0u. For an integer a P N, raising x P R to the ath power is the same as multiplying x to itself a times. When standard multiplication is replaced by tropical multiplication, this gives us tropical power:\nxda :“ xd ¨ ¨ ¨ d x “ a ¨ x,\nwhere the last ¨ denotes standard product of real numbers; it is extended to RY t´8u by defining, for any a P N,\n´8da :“ #\n´8 if a ą 0, 0 if a “ 0.\nA tropical semiring, while not a field, possesses one quality of a field: Every x P R has a tropical multiplicative inverse given by its standard additive inverse, i.e., xdp´1q :“ ´x. Though not reflected in its name, T is in fact a semifield.\nOne may therefore also raise x P R to a negative power a P Z by raising its tropical multiplicative inverse ´x to the positive power ´a, i.e., xda “ p´xqdp´aq. As is the case in standard real arithmetic, the tropical additive inverse ´8 does not have a tropical multiplicative inverse and ´8da is undefined for a ă 0. For notational simplicity, we will henceforth write xa instead of xda for tropical power when there is no cause for confusion. Other algebraic rules of tropical power may be derived from definition; see Section B in the supplement.\nWe are now in a position to define tropical polynomials and tropical rational functions. In the following, x and xi will denote variables (i.e., indeterminates).\nDefinition 2.2. A tropical monomial in d variables x1, . . . , xd is an expression of the form\ncd xa11 d x a2 2 d ¨ ¨ ¨ d x ad d\nwhere c P R Y t´8u and a1, . . . , ad P N. As a convenient shorthand, we will also write a tropical monomial in multiindex notation as cxα where α “ pa1, . . . , adq P Nd and x “ px1, . . . , xdq. Note that xα “ 0 d xα as 0 is the tropical multiplicative identity.\nDefinition 2.3. Following notations above, a tropical polynomial fpxq “ fpx1, . . . , xdq is a finite tropical sum of tropical monomials\nfpxq “ c1xα1 ‘ ¨ ¨ ¨ ‘ crxαr ,\nwhere αi “ pai1, . . . , aidq P Nd and ci P R Y t´8u, i “ 1, . . . , r. We will assume that a monomial of a given multiindex appears at most once in the sum, i.e., αi ‰ αj for any i ‰ j.\nDefinition 2.4. Following notations above, a tropical rational function is a standard difference, or, equivalently, a tropical quotient of two tropical polynomials fpxq and gpxq: fpxq ´ gpxq “ fpxq m gpxq. We will denote a tropical rational function by f m g, where f and g are understood to be tropical polynomial functions.\nIt is routine to verify that the set of tropical polynomials Trx1, . . . , xds forms a semiring under the standard extension of ‘ and d to tropical polynomials, and likewise the set of tropical rational functions Tpx1, . . . , xdq forms a semifield. We regard a tropical polynomial f “ f m 0 as a special case of a tropical rational function and thus Trx1, . . . , xds Ď Tpx1, . . . , xdq. Henceforth any result stated for a tropical rational function would implicitly also hold for a tropical polynomial.\nA d-variate tropical polynomial fpxq defines a function f : Rd Ñ R that is a convex function in the usual sense as taking max and sum of convex functions preserve convexity (Boyd & Vandenberghe, 2004). As such, a tropical rational function f m g : Rd Ñ R is a DC function or differenceconvex function (Hartman, 1959; Tao & Hoai An, 2005).\nWe will need a notion of vector-valued tropical polynomials and tropical rational functions. Definition 2.5. F : Rd Ñ Rp, x “ px1, . . . , xdq ÞÑ pf1pxq, . . . , fppxqq, is called a tropical polynomial map if each fi : Rd Ñ R is a tropical polynomial, i “ 1, . . . , p, and a tropical rational map if f1, . . . , fp are tropical rational functions. We will denote the set of tropical polynomial maps by Polpd, pq and the set of tropical rational maps by Ratpd, pq. So Polpd, 1q “ Trx1, . . . , xds and Ratpd, 1q “ Tpx1, . . . , xdq."}, {"heading": "3. Tropical hypersurfaces", "text": "There are tropical analogues of many notions in classical algebraic geometry (Itenberg et al., 2009; Maclagan & Sturmfels, 2015), among which are tropical hypersurfaces, tropical analogues of algebraic curves in classical algebraic geometry. Tropical hypersurfaces are a principal object of interest in tropical geometry and will prove very useful in our approach towards neural networks. Intuitively, the tropical hypersurface of a tropical polynomial f is the set of points x where f is not linear at x. Definition 3.1. The tropical hypersurface of a tropical polynomial fpxq “ c1xα1 ‘ ¨ ¨ ¨ ‘ crxαr is\nT pfq :“ x P Rd : cixαi “ cjxαj “ fpxq for some αi ‰ αj ( .\ni.e., the set of points x at which the value of f at x is attained by two or more monomials in f .\nA tropical hypersurface divides the domain of f into convex cells on each of which f is linear. These cells are convex polyhedrons, i.e., defined by linear inequalities with integer coefficients: tx P Rd : Ax ď bu for A P Zmˆd and b P Rm. For example, the cell where a tropical monomial cjx\nαj attains its maximum is tx P Rd : cj ` αTjx ě ci ` αTix for all i ‰ ju. Tropical hypersurfaces of polynomials in two variables (i.e., in R2) are called tropical curves.\nJust like standard multivariate polynomials, every tropical polynomial comes with an associated Newton polygon.\nDefinition 3.2. The Newton polygon of a tropical polynomial fpxq “ c1xα1 ‘ ¨ ¨ ¨ ‘ crxαr is the convex hull of α1, . . . , αr P Nd, regarded as points in Rd,\n∆pfq :“ Conv αi P Rd : ci ‰ ´8, i “ 1, . . . , r ( .\nA tropical polynomial f determines a dual subdivision of ∆pfq, constructed as follows. First, lift each αi from Rd into Rd`1 by appending ci as the last coordinate. Denote the convex hull of the lifted α1, . . . , αr as\nPpfq :“ Convtpαi, ciq P Rd ˆ R : i “ 1, . . . , ru. (1)\nNext let UF ` Ppfq ˘\ndenote the collection of upper faces in Ppfq and π : Rd ˆ R Ñ Rd be the projection that drops the last coordinate. The dual subdivision determined by f is then\nδpfq :“ πppq Ă Rd : p P UF ` Ppfq ˘( .\nδpfq forms a polyhedral complex with support ∆pfq. By (Maclagan & Sturmfels, 2015, Proposition 3.1.6), the tropical hypersurface T pfq is the pd´ 1q-skeleton of the polyhedral complex dual to δpfq. This means that each vertex in δpfq corresponds to one “cell” in Rd where the function f is linear. Thus, the number of vertices in Ppfq provides an upper bound on the number of linear regions of f .\nFigure 1 shows the Newton polygon and dual subdivision for the tropical polynomial fpx1, x2q “ 1d x21 ‘ 1d x22 ‘ 2d x1x2 ‘ 2d x1 ‘ 2d x2 ‘ 2. Figure 2 shows how we\nmay find the dual subdivision for this tropical polynomial by following the aforementioned procedures; with step-by-step details given in Section C.1.\nTropical polynomials and tropical rational functions are clearly piecewise linear functions. As such a tropical rational map is a piecewise linear map and the notion of linear region applies.\nDefinition 3.3. A linear region of F P Ratpd,mq is a maximal connected subset of the domain on which F is linear. The number of linear regions of F is denoted N pF q.\nNote that a tropical polynomial map F P Polpd,mq has convex linear regions but a tropical rational map F P Ratpd, nq generally has nonconvex linear regions. In Section 6.3, we will use N pF q as a measure of complexity for an F P Ratpd, nq given by a neural network."}, {"heading": "3.1. Transformations of tropical polynomials", "text": "Our analysis of neural networks will require figuring out how the polytope Ppfq transforms under tropical power, sum, and product. The first is straightforward.\nProposition 3.1. Let f be a tropical polynomial and let a P N. Then\nPpfaq “ aPpfq.\naPpfq “ tax : x P Ppfqu Ď Rd`1 is a scaled version of Ppfq with the same shape but different volume.\nTo describe the effect of tropical sum and product, we need a few notions from convex geometry. The Minkowski sum of two sets P1 and P2 in Rd is the set\nP1 ` P2 :“ x1 ` x2 P Rd : x1 P P1, x2 P P2 ( ;\nand for λ1, λ2 ě 0, their weighted Minkowski sum is\nλ1P1 ` λ2P2 :“ λ1x1 ` λ2x2 P Rd : x1 P P1, x2 P P2 ( .\nWeighted Minkowski sum is clearly commutative and associative and generalizes to more than two sets. In particular, the Minkowski sum of line segments is called a zonotope.\nLet VpP q denote the set of vertices of a polytope P . Clearly, the Minkowski sum of two polytopes is given by the convex hull of the Minkowski sum of their vertex sets, i.e., P1 ` P2 “ Conv ` VpP1q ` VpP2q ˘\n. With this observation, the following is immediate.\nProposition 3.2. Let f, g P Polpd, 1q “ Trx1, . . . , xds be tropical polynomials. Then\nPpf d gq “ Ppfq ` Ppgq, Ppf ‘ gq “ Conv ` VpPpfqq Y VpPpgqq ˘ .\nWe reproduce below part of (Gritzmann & Sturmfels, 1993, Theorem 2.1.10) and derive a corollary for bounding the number of verticies on the upper faces of a zonotope.\nTheorem 3.3 (Gritzmann–Sturmfels). Let P1, . . . , Pk be polytopes in Rd and let m denote the total number of nonparallel edges of P1, . . . , Pk. Then the number of vertices of P1 ` ¨ ¨ ¨ ` Pk does not exceed\n2 d´1 ÿ j“0 pm´ 1j q .\nThe upper bound is attained if all Pi’s are zonotopes and all their generating line segments are in general positions.\nCorollary 3.4. Let P Ď Rd`1 be a zonotope generated by m line segments P1, . . . , Pm. Let π : Rd ˆ RÑ Rd be the projection. Suppose P satisfies:\n(i) the generating line segments are in general positions;\n(ii) the set of projected vertices tπpvq : v P VpP qu Ď Rd are in general positions.\nThen P has d ÿ\nj“0 pmj q\nvertices on its upper faces. If either (i) or (ii) is violated, then this becomes an upper bound.\nAs we mentioned, linear regions of a tropical polynomial f correspond to vertices on UF ` Ppfq ˘\nand the corollary will be useful for bounding the number of linear regions."}, {"heading": "4. Neural networks", "text": "While we expect our readership to be familiar with feedforward neural networks, we will nevertheless use this short\nsection to define them, primarily for the purpose of fixing notations and specifying the assumptions that we retain throughout this article. We restrict our attention to fully connected feedforward neural networks.\nViewed abstractly, an L-layer feedforward neural network is a map ν : Rd Ñ Rp given by a composition of functions\nν “ σpLq ˝ ρpLq ˝ σpL´1q ˝ ρpL´1q ¨ ¨ ¨ ˝ σp1q ˝ ρp1q.\nThe preactivation functions ρp1q, . . . , ρpLq are affine transformations to be determined and the activation functions σp1q, . . . , σpLq are chosen and fixed in advanced.\nWe denote the width, i.e., the number of nodes, of the lth layer by nl, l “ 1, ¨ ¨ ¨ , L´ 1. We set n0 :“ d and nL :“ p, respectively the dimensions of the input and output of the network. The output from the lth layer will be denoted by\nνplq :“ σplq ˝ ρplq ˝ σpl´1q ˝ ρpl´1q ¨ ¨ ¨ ˝ σp1q ˝ ρp1q,\ni.e., it is a map νplq : Rd Ñ Rnl . For convenience, we assume νp0qpxq :“ x.\nThe affine function ρplq : Rnl´1 Ñ Rnl is given by a weight matrix Aplq P Znlˆnl´1 and a bias vector bplq P Rnl :\nρplqpνpl´1qq :“ Aplqνpl´1q ` bplq.\nThe pi, jqth coordinate of Aplq will be denoted aplqij and the ith coordinate of bplq by bplqi . Collectively they form the parameters of the lth layer.\nFor a vector input x P Rnl , σplqpxq is understood to be in coordinatewise sense; so σ : Rnl Ñ Rnl . We assume the final output of a neural network νpxq is fed into a score function s : Rp Ñ Rm that is application specific. When used as an m-category classifier, s may be chosen, for example, to be a soft-max or sigmoidal function. The score function is quite often regarded as the last layer of a neural network but this is purely a matter of convenience and we will not assume this. We will make the following mild assumptions on the architecture of our feedforward neural networks and explain next why they are indeed mild:\n(a) the weight matrices Ap1q, . . . , ApLq are integer-valued;\n(b) the bias vectors bp1q, . . . , bpLq are real-valued;\n(c) the activation functions σp1q, . . . , σpLq take the form\nσplqpxq :“ maxtx, tplqu,\nwhere tplq P pRYt´8uqnl is called a threshold vector.\nHenceforth all neural networks in our subsequent discussions will be assumed to satisfy (a)–(c).\n(b) is completely general but there is also no loss of generality in (a), i.e., in restricting the weights Ap1q, . . . , ApLq from real matrices to integer matrices, as:\n• real weights can be approximated arbitrarily closely by rational weights;\n• one may then ‘clear denominators’ in these rational weights by multiplying them by the least common multiple of their denominators to obtain integer weights;\n• keeping in mind that scaling all weights and biases by the same positive constant has no bearing on the workings of a neural network.\nThe activation function in (c) includes both ReLU activation (tplq “ 0) and identity map (tplq “ ´8) as special cases. Aside from ReLU, our tropical framework will apply to piecewise linear activations such as leaky ReLU and absolute value, and with some extra effort, may be extended to max pooling, maxout nets, etc. But it does not, for example, apply to activations such as hyperbolic tangent and sigmoid.\nIn this work, we view an ReLU network as the simplest and most canonical model of a neural network, from which other variants that are more effective at specific tasks may be derived. Given that we seek general theoretical insights and not specific practical efficacy, it makes sense to limit ourselves to this simplest case. Moreover, ReLU networks already embody some of the most important elements (and mysteries) common to a wider range of neural networks (e.g., universal approximation, exponential expressiveness); they work well in practice and are often the go-to choice for feedforward networks. We are also not alone in limiting our discussions to ReLU networks (Montufar et al., 2014; Arora et al., 2018)."}, {"heading": "5. Tropical algebra of neural networks", "text": "We now describe our tropical formulation of a multilayer feedforward neural network satisfying (a)–(c).\nA multilayer feedforward neural network is generally nonconvex, whereas a tropical polynomial is always convex. Since most nonconvex functions are a difference of two convex functions (Hartman, 1959), a reasonable guess is that a feedforward neural network is the difference of two tropical polynomials, i.e., a tropical rational function. This is indeed the case, as we will see from the following.\nConsider the output from the first layer in neural network\nνpxq “ maxtAx` b, tu,\nwhere A P Zpˆd, b P Rp, and t P pR Y t´8uqp. We will decompose A as a difference of two nonnegative integervalued matrices, A “ A`´A´ with A`, A´ P Npˆd; e.g., in the standard way with entries\na`ij :“ maxtaij , 0u, a ´ ij :“ maxt´aij , 0u\nrespectively. Since\nmaxtAx` b, tu “ maxtA`x` b, A´x` tu ´A´x,\nwe see that every coordinate of one-layer neural network is a difference of two tropical polynomials. For networks with more layers, we apply this decomposition recursively to obtain the following result.\nProposition 5.1. LetA P Zmˆn, b P Rm be the parameters of the pl ` 1qth layer, and let t P pR Y t´8uqm be the threshold vector in the pl` 1qth layer. If the nodes of the lth layer are given by tropical rational functions,\nνplqpxq “ F plqpxq mGplqpxq “ F plqpxq ´Gplqpxq,\ni.e., each coordinate of F plq and Gplq is a tropical polynomial in x, then the outputs of the preactivation and of the pl ` 1qth layer are given by tropical rational functions\nρpl`1q ˝ νplqpxq “ Hpl`1qpxq ´Gpl`1qpxq, νpl`1qpxq “ σ ˝ ρpl`1q ˝ νplqpxq “ F pl`1qpxq ´Gpl`1qpxq\nrespectively, where\nF pl`1qpxq “ max Hpl`1qpxq, Gpl`1qpxq ` t ( ,\nGpl`1qpxq “ A`Gplqpxq `A´F plqpxq, Hpl`1qpxq “ A`F plqpxq `A´Gplqpxq ` b.\nWe will write f plqi , g plq i and h plq i for the ith coordinate of F plq, Gplq and Hplq respectively. In tropical arithmetic, the recurrence above takes the form\nf pl`1q i “ h pl`1q i ‘ pg pl`1q i d tiq,\ng pl`1q i “\n„ n ä\nj“1 pf plqj q a´ij\n d „ n ä\nj“1 pgplqj q a`ij\n\n,\nh pl`1q i “\n„ n ä\nj“1 pf plqj q a`ij\n d „ n ä\nj“1 pgplqj q a´ij\n\nd bi.\n(2)\nRepeated applications of Proposition 5.1 yield the following.\nTheorem 5.2 (Tropical characterization of neural networks). A feedforward neural network under assumptions (a)–(c) is a function ν : Rd Ñ Rp whose coordinates are tropical rational functions of the input, i.e.,\nνpxq “ F pxq mGpxq “ F pxq ´Gpxq\nwhere F and G are tropical polynomial maps. Thus ν is a tropical rational map.\nNote that the tropical rational functions above have real coefficients, not integer coefficients. The integer weights Aplq P Znlˆnl´1 have gone into the powers of tropical monomials in f and g, which is why we require our weights to be integer-valued, although as we have explained, this requirement imposes little loss of generality.\nBy setting tp1q “ ¨ ¨ ¨ “ tpL´1q “ 0 and tpLq “ ´8, we obtain the following corollary.\nCorollary 5.3. Let ν : Rd Ñ R be an ReLU activated feedforward neural network with integer weights and linear output. Then ν is a tropical rational function.\nA more remarkable fact is the converse of Corollary 5.3.\nTheorem 5.4 (Equivalence of neural networks and tropical rational functions).\n(i) Let ν : Rd Ñ R. Then ν is a tropical rational function if and only if ν is a feedforward neural network satisfying assumptions (a)–(c).\n(ii) A tropical rational function f m g can be represented as an L-layer neural network, with\nL ď maxtrlog2 rf s, rlog2 rgsu ` 2,\nwhere rf and rg are the number of monomials in the tropical polynomials f and g respectively.\nWe would like to acknowledge the precedence of (Arora et al., 2018, Theorem 2.1), which demonstrates the equivalence between ReLU-activatedL-layer neural networks with real weights and d-variate continuous piecewise functions with real coefficients, where L ď rlog2pd` 1qs` 1.\nBy construction, a tropical rational function is a continuous piecewise linear function. The continuity of a piecewise linear function automatically implies that each of the pieces on which it is linear is a polyhedral region. As we saw in Section 3, a tropical polynomial f : Rd Ñ R gives a tropical hypersurface that divides Rd into convex polyhedral regions defined by linear inequalities with integer coefficients: tx P Rd : Ax ď bu with A P Zmˆd and b P Rm. A tropical rational function f m g : Rd Ñ R must also be a continuous piecewise linear function and divide Rd into polyhedral regions on each of which f m g is linear, although these regions are nonconvex in general. We will show the converse — any continuous piecewise linear function with integer coefficients is a tropical rational function.\nProposition 5.5. Let ν : Rd Ñ R. Then ν is a continuous piecewise linear function with integer coefficients if and only if ν is a tropical rational function.\nCorollary 5.3, Theorem 5.4, and Proposition 5.5 collectively imply the equivalence of\n(i) tropical rational functions,\n(ii) continuous piecewise linear functions with integer coefficients,\n(iii) neural networks satisfying assumptions (a)–(c).\nAn immediate advantage of this characterization is that the set of tropical rational functions Tpx1, . . . , xdq has a semifield structure as we pointed out in Section 2, a fact that we have implicitly used in the proof of Proposition 5.5. However, what is more important is not the algebra but the\nalgebraic geometry that arises from our tropical characterization. We will use tropical algebraic geometry to illuminate our understanding of neural networks in the next section.\nThe need to stay within tropical algebraic geometry is the reason we did not go for a simpler and more general characterization (that does not require the integer coefficients assumption). A tropical signomial takes the form\nϕpxq “ m à\ni“1 bi\nn ä j“1 x aij j ,\nwhere aij P R and bi P R Y t´8u. Note that aij is not required to be integer-valued nor nonnegative. A tropical rational signomial is a tropical quotientϕmψ of two tropical signomials ϕ,ψ. A tropical rational signomial map is a function ν “ pν1, . . . , νpq : Rd Ñ Rp where each νi : Rd Ñ R is a tropical rational signomial νi “ ϕi m ψi. The same argument we used to establish Theorem 5.2 gives us the following. Proposition 5.6. Every feedforward neural network with ReLU activation is a tropical rational signomial map.\nNevertheless tropical signomials fall outside the realm of tropical algebraic geometry and we do not use Proposition 5.6 in the rest of this article."}, {"heading": "6. Tropical geometry of neural networks", "text": "Section 5 defines neural networks via tropical algebra, a perspective that allows us to study them via tropical algebraic geometry. We will show that the decision boundary of a neural network is a subset of a tropical hypersurface of a corresponding tropical polynomial (Section 6.1). We will see that, in an appropriate sense, zonotopes form the geometric building blocks for neural networks (Section 6.2). We then prove that the geometry of the function represented by a neural network grows vastly more complex as its number of layers increases (Section 6.3)."}, {"heading": "6.1. Decision boundaries of a neural network", "text": "We will use tropical geometry and insights from Section 5 to study decision boundaries of neural networks, focusing on the case of two-category classification for clarity. As explained in Section 4, a neural network ν : Rd Ñ Rp together with a choice of score function s : Rp Ñ R give us a classifier. If the output value spνpxqq exceeds some decision threshold c, then the neural network predicts x is from one class (e.g., x is a CAT image), and otherwise x is from the other category (e.g., a DOG image). The input space is thereby partitioned into two disjoint subsets by the decision boundary B :“ tx P Rd : νpxq “ s´1pcqu. Connected regions with value above the threshold and connected regions with value below the threshold will be called the positive regions and negative regions respectively.\nWe provide bounds on the number of positive and negative regions and show that there is a tropical polynomial whose tropical hypersurface contains the decision boundary.\nProposition 6.1 (Tropical geometry of decision boundary). Let ν : Rd Ñ R be an L-layer neural network satisfying assumptions (a)–(c) with tpLq “ ´8. Let the score function s : RÑ R be injective with decision threshold c in its range. If ν “ f m g where f and g are tropical polynomials, then\n(i) its decision boundary B “ tx P Rd : νpxq “ s´1pcqu divides Rd into at most N pfq connected positive regions and at most N pgq connected negative regions;\n(ii) its decision boundary is contained in the tropical hypersurface of the tropical polynomial s´1pcq d gpxq ‘ fpxq “ maxtfpxq, gpxq ` s´1pcqu, i.e.,\nB Ď T ps´1pcq d g ‘ fq. (3)\nThe function s´1pcqdg‘f is not necessarily linear on every positive or negative region and so its tropical hypersurface T ps´1pcqdg‘fqmay further divide a positive or negative region derived from B into multiple linear regions. Hence the “Ď” in (3) cannot in general be replaced by ““”."}, {"heading": "6.2. Zonotopes as geometric building blocks of neural networks", "text": "From Section 3, we know that the number of regions a tropical hypersurface T pfq divides the space into equals the number of vertices in the dual subdivision of the Newton polygon associated with the tropical polynomial f . This allows us to bound the number of linear regions of a neural network by bounding the number of vertices in the dual subdivision of the Newton polygon.\nWe start by examining how geometry changes from one layer to the next in a neural network, more precisely:\nQuestion. How are the tropical hypersurfaces of the tropical polynomials in the pl ` 1qth layer of a neural network related to those in the lth layer?\nThe recurrent relation (2) describes how the tropical polynomials occurring in the pl ` 1qth layer are obtained from those in the lth layer, namely, via three operations: tropical sum, tropical product, and tropical powers. Recall that a tropical hypersurface of a tropical polynomial is dual to the dual subdivision of the Newton polytope of the tropical polynomial, which is given by the projection of the upper faces on the polytopes defined by (1). Hence the question boils down to how these three operations transform the polytopes, which is addressed in Propositions 3.1 and 3.2. We follow notations in Proposition 5.1 for the next result.\nLemma 6.2. Let f plqi , g plq i , h plq i be the tropical polynomials produced by the ith node in the lth layer of a neural network,\ni.e., they are defined by (2). Then P ` f plq i ˘ , P ` g plq i ˘ , P ` h plq i ˘ are subsets of Rd`1 given as follows:\n(i) P ` g p1q i ˘ and P ` h p1q i ˘ are points.\n(ii) P ` f p1q i ˘ is a line segment.\n(iii) P ` g p2q i ˘ and P ` h p2q i ˘ are zonotopes. (iv) For l ě 1,\nP ` f plq i ˘ “ Conv “ P ` g plq i d t plq i ˘ Y P ` h plq i ˘‰\nif tplqi P R, and P ` f plq i ˘ “ P ` h plq i ˘ if tplqi “ ´8.\n(v) For l ě 1, P ` g pl`1q i ˘ and P ` h pl`1q i ˘\nare weighted Minkowski sums,\nP ` g pl`1q i ˘\n“ nl ÿ\nj“1 a´ijP ` f plq j ˘\n` nl ÿ\nj“1 a`ijP ` g plq j ˘ ,\nP ` h pl`1q i ˘\n“ nl ÿ\nj“1 a`ijP ` f plq j ˘\n` nl ÿ\nj“1 a´ijP ` g plq j ˘\n` tbieu,\nwhere aij , bi are entries of the weight matrix Apl`1q P Znl`1ˆnl and bias vector bpl`1q P Rnl`1 , and e :“ p0, . . . , 0, 1q P Rd`1.\nA conclusion of Lemma 6.2 is that zonotopes are the building blocks in the tropical geometry of neural networks. Zonotopes are studied extensively in convex geometry and, among other things, are intimately related to hyperplane arrangements (Greene & Zaslavsky, 1983; Guibas et al., 2003; McMullen, 1971; Holtz & Ron, 2011). Lemma 6.2 connects neural networks to this extensive body of work but its full implication remains to be explored. In Section C.2 of the supplement, we show how one may build these polytopes for a two-layer neural network."}, {"heading": "6.3. Geometric complexity of deep neural networks", "text": "We apply the tools in Section 3 to study the complexity of a neural network, showing that a deep network is much more expressive than a shallow one. Our measure of complexity is geometric: we will follow (Montufar et al., 2014; Raghu et al., 2017) and use the number of linear regions of a piecewise linear function ν : Rd Ñ Rp to measure the complexity of ν.\nWe would like to emphasize that our upper bound below does not improve on that obtained in (Raghu et al., 2017) — in fact, our version is more restrictive given that it applies only to neural networks satisfying (a)–(c). Nevertheless our goal here is to demonstrate how tropical geometry may be used to derive the same bound.\nTheorem 6.3. Let ν : Rd Ñ R be an L-layer real-valued feedforward neural network satisfying (a)–(c). Let tpLq “\n´8 and nl ě d for all l “ 1, . . . , L ´ 1. Then ν “ νpLq has at most\nL´1 ź\nl“1\nd ÿ i“0 pnl i q\nlinear regions. In particular, if d ď n1, . . . , nL´1 ď n, the number of linear regions of ν is bounded by O ` ndpL´1q ˘ .\nProof. If L “ 2, this follows directly from Lemma 6.2 and Corollary 3.4. The case of L ě 3 is in Section D.7 in the supplement.\nAs was pointed out in (Raghu et al., 2017), this upper bound closely matches the lower bound Ω ` pn{dqpL´1qdnd ˘ in (Montufar et al., 2014, Corollary 5) when n1 “ ¨ ¨ ¨ “ nL´1 “ n ě d. Hence we surmise that the number of linear regions of the neural network grows polynomially with the width n and exponentially with the number of layers L."}, {"heading": "7. Conclusion", "text": "We argue that feedforward neural networks with rectified linear units are, modulo trivialities, nothing more than tropical rational maps. To understand them we often just need to understand the relevant tropical geometry.\nIn this article, we took a first step to provide a proof-ofconcept: questions regarding decision boundaries, linear regions, how depth affect expressiveness, etc, can be translated into questions involving tropical hypersurfaces, dual subdivision of Newton polygon, polytopes constructed from zonotopes, etc.\nAs a new branch of algebraic geometry, the novelty of tropical geometry stems from both the algebra and geometry as well as the interplay between them. It has connections to many other areas of mathematics. Among other things, there is a tropical analogue of linear algebra (Butkovič, 2010) and a tropical analogue of convex geometry (Gaubert & Katz, 2006). We cannot emphasize enough that we have only touched on a small part of this rich subject. We hope that further investigation from this tropical angle might perhaps unravel other mysteries of deep neural networks."}, {"heading": "Acknowledgments", "text": "The authors thank Ralph Morrison, Yang Qi, Bernd Sturmfels, and the anonymous referees for their very helpful comments. The work in this article is generously supported by DARPA D15AP00109, NSF IIS 1546413, the Eckhardt Faculty Fund, and a DARPA Director’s Fellowship."}, {"heading": "B. Tropical power", "text": "As in Section 2, we write xa “ xda; aside from this slight abuse of notation, ‘ and d denote tropical sum and product, ` and ¨ denote standard sum and product in all other contexts. Tropical power evidently has the following properties:\n• For x, y P R and a P R, a ě 0,\npx‘ yqa “ xa ‘ ya and pxd yqa “ xa d ya.\nIf a is allowed negative values, then we lose the first property. In general px‘ yqa ‰ xa ‘ ya for a ă 0. • For x P R,\nx0 “ 0.\n• For x P R and a, b P N, pxaqb “ xa¨b.\n• For x P R and a, b P Z, xa d xb “ xa`b.\n• For x P R and a, b P Z, xa ‘ xb “ xa d pxa´b ‘ 0q “ xa d p0‘ xa´bq."}, {"heading": "C. Examples", "text": "C.1. Examples of tropical curves and dual subdivision of Newton polygon\nLet f P Polp2, 1q “ Trx1, x2s, i.e., a bivariate tropical polynomial. It follows from our discussions in Section 3 that the tropical hypersurface T pfq is a planar graph dual to the dual subdivision δpfq in the following sense:\n(i) Each two-dimensional face in δpfq corresponds to a vertex in T pfq. (ii) Each one-dimensional edge of a face in δpfq corresponds to an edge in T pfq. In particular, an edge from the Newton\npolygon ∆pfq corresponds to an unbounded edge in T pfq while other edges correspond to bounded edges.\nFigure 2 illustrates how we may find the dual subdivision for the tropical polynomial fpx1, x2q “ 1d x21 ‘ 1d x22 ‘ 2d x1x2 ‘ 2d x1 ‘ 2d x2 ‘ 2. First, find the convex hull\nPpfq “ Convtp2, 0, 1q, p0, 2, 1q, p1, 1, 2q, p1, 0, 2q, p0, 1, 2q, p0, 0, 2qu.\nThen, by projecting the upper envelope of Ppfq to R2, we obtain δpfq, the dual subdivision of the Newton polygon.\nC.2. Polytopes of a two-layer neural network\nWe illustrate our discussions in Section 6.2 with a two-layer example. Let ν : R2 Ñ R be with n0 “ 2 input nodes, n1 “ 5 nodes in the first layer, and n2 “ 1 nodes in the output:\ny “ νp1qpxq “ max\n$\n’ ’ ’ ’ &\n’ ’ ’ ’ %\n»\n— — — — –\n´1 1 1 ´3 1 2 ´4 1 3 2\nfi\nffi ffi ffi ffi fl „ x1 x2  `\n»\n— — — — –\n1 ´1\n2 0 ´2\nfi\nffi ffi ffi ffi fl , 0\n,\n/ / / / .\n/ / / / -\n,\nνp2qpyq “ maxty1 ` 2y2 ` y3 ´ y4 ´ 3y5, 0u.\nWe first express νp1q and νp2q as tropical rational maps,\nνp1q “ F p1q mGp1q, νp2q “ f p2q m gp2q,\nwhere\ny :“ F p1qpxq “ Hp1qpxq ‘Gp1qpxq,\nz :“ Gp1qpxq “\n»\n— — — — – x1 x32 0 x41 0\nfi\nffi ffi ffi ffi fl , Hp1qpxq “\n»\n— — — — –\n1d x2 p´1q d x1 2d x1x22\nx2 p´2q d x31x22\nfi\nffi ffi ffi ffi fl ,\nand\nf p2qpxq “ gp2qpxq ‘ hp2qpxq, gp2qpxq “ y4 d y35 d z1 d z22 d z3 “ px2 ‘ x41q d pp´2q d x31x22 ‘ 0q3 d x1 d px32q2, hp2qpxq “ y1 d y22 d y3 d z4 d z35\n“ p1d x2 ‘ x1q d pp´1q d x1 ‘ x32q2 d p2d x1x22 ‘ 0q d x41.\nWe will write F p1q “ pf p1q1 , . . . , f p1q 5 q and likewise for Gp1q and Hp1q. The monomials occurring in g p1q j pxq and h p1q j pxq are all of the form cxa11 x a2 2 . Therefore Ppg p1q j q and Pph p1q j q, j “ 1, . . . , 5, are points in R3.\nSince F p1q “ Gp1q ‘Hp1q, Ppf p1qj q is a convex hull of two points, and thus a line segment in R3. The Newton polygons associated with f p1qj , equal to their dual subdivisions in this case, are obtained by projecting these line segments back to the plane spanned by a1, a2, as shown on the left in Figure C.1.\nThe line segments Ppf p1qj q, j “ 1, . . . , 5, and points Ppg p1q j q, j “ 1, . . . , 5, serve as building blocks for Pphp2qq and Ppgp2qq, which are constructed as weighted Minkowski sums:\nPphp2qq “ Ppf p1q4 q ` 3Ppf p1q 5 q ` Ppg p1q 1 q ` 2Ppg p1q 2 q ` Ppg p1q 3 q, Ppgp2qq “ Ppf p1q1 q ` 2Ppf p1q 2 q ` Ppf p1q 3 q ` Ppg p1q 4 q ` 3Ppg p1q 5 q.\nPpgp2qq and the dual subdivision of its Newton polygon are shown on the right in Figure C.1. Pphp2qq and the dual subdivision of its Newton polygon are shown on the left in Figure C.2. Ppf p2qq is the convex hull of the union of Ppgp2qq and Pphp2qq. The dual subdivision of its Newton polygon is obtained by projecting the upper faces of Ppf p2qq to the plane spanned by a1, a2. These are shown on the right in Figure C.2."}, {"heading": "D. Proofs", "text": ""}, {"heading": "D.1. Proof of Corollary 3.4", "text": "Proof. Let V1 and V2 be the sets of vertices on the upper and lower envelopes of P respectively. By Theorem 3.3, P has\nn1 :“ 2 d ÿ j“0 pm´ 1j q\nvertices in total. By construction, we have |V1 Y V2| “ n1. It is well-known that zonotopes are centrally symmetric and so there are equal number of vertices on the upper and lower envelopes, i.e., |V1| “ |V2|. Let P 1 :“ πpP q be the projection of P into Rd. Since the projected vertices are assumed to be in general positions, P 1 must be a d-dimensional zonotope generated by m nonparallel line segments. Hence, by Theorem 3.3 again, P 1 has\nn2 :“ 2 d´1 ÿ j“0 pm´ 1j q\nvertices. For any vertex v P P , πpvq is a vertex of P 1 if and only if v belongs to both the upper and lower envelopes, i.e., v P V1 X V2. Therefore the number of vertices on P 1 equals |V1 X V2|. By construction, we have |V1 X V2| “ n2. Consequently the number of vertices on the upper envelope is\n|V1| “ 1\n2 p|V1 Y V2| ´ |V1 X V2|q ` |V1 X V2| “\n1 2 pn1 ´ n2q ` n2 “\nd ÿ j“0 pmj q ."}, {"heading": "D.2. Proof of Proposition 5.1", "text": "Proof. Writing A “ A` ´A´, we have\nρpl`1qpxq “ ` A` ´A´ ˘` F plqpxq ´Gplqpxq ˘ ` b “ ` A`F plqpxq `A´Gplqpxq ` b ˘ ´ ` A`G plqpxq `A´F plqpxq ˘\n“ Hpl`1qpxq ´Gpl`1qpxq, νpl`1qpxq “ max ρpl`1qpyq, t (\n“ max Hpl`1qpxq ´Gpl`1qpxq, t (\n“ max Hpl`1qpxq, Gpl`1qpxq ` t ( ´Gpl`1qpxq “ F pl`1qpxq ´Gpl`1qpxq."}, {"heading": "D.3. Proof of Theorem 5.4", "text": "Proof. It remains to establish the “only if” part. We will write σtpxq :“ maxtx, tu. Any tropical monomial bixαi is clearly such a neural network as\nbix αi “ pσ´8 ˝ ρiqpxq “ maxtαTix` bi,´8u.\nIf two tropical polynomials p and q are represented as neural networks with lp and lq layers respectively,\nppxq “ ` σ´8 ˝ ρplpqp ˝ σ0 ˝ . . . σ0 ˝ ρp1qp ˘ pxq, qpxq “ `\nσ´8 ˝ ρplqqq ˝ σ0 ˝ . . . σ0 ˝ ρp1qq ˘ pxq,\nthen pp‘ qqpxq “ maxtppxq, qpxqu can also be written as a neural network with maxtlp, lqu ` 1 layers:\npp‘ qqpxq “ σ´8 ` rσ0 ˝ ρ1spypxqq ` rσ0 ˝ ρ2spypxqq ´ rσ0 ˝ ρ3spypxqq ˘ ,\nwhere y : Rd Ñ R2 is given by ypxq “ pppxq, qpxqq and ρi : R2 Ñ R, i “ 1, 2, 3, are linear functions defined by\nρ1pyq “ y1 ´ y2, ρ2pyq “ y2, ρ3pyq “ ´y2.\nThus, by induction, any tropical polynomial can be written as a neural network with ReLU activation. Observe also that if a tropical polynomial is the tropical sum of r monomials, then it can be written as a neural network with no more than rlog2 rs` 1 layers.\nNext we consider a tropical rational function ppm qqpxq “ ppxq ´ qpxq where p and q are tropical polynomials. Under the same assumptions, we can represent pm q as\nppm qqpxq “ σ´8 ` rσ0 ˝ ρ4spypxqq ´ rσ0 ˝ ρ5spypxqq ` rσ0 ˝ ρ6spypxqq ´ rσ0 ˝ ρ7spypxqq ˘\nwhere ρi : R2 Ñ R2, i “ 4, 5, 6, 7, are linear functions defined by\nρ4pyq “ y1, ρ5pyq “ ´y1, ρ6pyq “ ´y2, ρ7pyq “ y2.\nTherefore pm q is also a neural network with at most maxtlp, lqu ` 1 layers.\nFinally, if f and g are tropical polynomials that are respectively tropical sums of rf and rg monomials, then the discussions above show that pf m gqpxq “ fpxq ´ gpxq is a neural network with at most maxtrlog2 rf s, rlog2 rgsu ` 2 layers."}, {"heading": "D.4. Proof of Proposition 5.5", "text": "Proof. It remains to establish the “if” part. Let Rd be divided into N polyhedral region on each of which ν restricts to a linear function `ipxq “ aTix` bi, ai P Zd, bi P R, i “ 1, . . . , L, i.e., for any x P Rd, νpxq “ `ipxq for some i P t1, . . . , Lu. It follows from (Tarela & Martinez, 1999) that we can find N subsets of t1, . . . , Lu, denoted by Sj , j “ 1, . . . , N , so that ν has a representation\nνpxq “ max j“1,...,N min iPSj `i.\nIt is clear that each `i is a tropical rational function. Now for any tropical rational functions p and q,\nmintp, qu “ ´maxt´p,´qu “ 0m rp0m pq ‘ p0m qqs “ rpd qs m rp‘ qs.\nSince pd q and p‘ q are both tropical rational functions, so is their tropical quotient. By induction, miniPSj `i is a tropical rational function for any j “ 1, . . . , N , and therefore so is their tropical sum ν."}, {"heading": "D.5. Proof of Proposition 5.6", "text": "Proof. For a one-layer neural network νpxq “ maxtAx ` b, tu “ pν1pxq, . . . , νppxqq with A P Rpˆd, b P Rp, x P Rd, t P pRY t´8uqp, we have\nνkpxq “ ˆ bk d d ä\nj“1 x akj j\n˙ ‘ tk “ ˆ bk d d ä\nj“1 x akj j\n˙ ‘ ˆ tk d d ä\nj“1 x0j\n˙\n, k “ 1, . . . , p.\nSo for any k “ 1, . . . , p, if we write b̄1 “ bk, b̄2 “ tk, ā1j “ akj , ā2j “ 0, j “ 1, . . . , d, then\nνkpxq “ 2 à\ni“1 b̄i\nd ä j“1 x āij j\nis clearly a tropical signomial function. Therefore ν is a tropical signomial map. The result for arbitrary number of layers then follows from using the same recurrence as in the proof in Section D.2, except that now the entries in the weight matrix are allowed to take real values, and the maps Hplqpxq, Gplqpxq, F plqpxq are tropical signomial maps. Hence every layer can be written as a tropical rational signomial map νplq “ F plq mGplq."}, {"heading": "D.6. Proof of Proposition 6.1", "text": "We prove a slightly more general result.\nProposition D.1 (Level sets). Let f m g P Ratpd, 1q “ Tpx1, . . . , xdq.\n(i) Given a constant c ą 0, the level set B :“ tx P Rd : fpxq m gpxq “ cu\ndivides Rd into at most N pfq connected polyhedral regions where fpxq m gpxq ą c, and at most N pgq such regions where fpxq m gpxq ă c.\n(ii) If c P R is such that there is no tropical monomial in fpxq that differs from any tropical monomial in gpxq by c, then the level set B is contained in a tropical hypersurface,\nB Ď T pmaxtfpxq, gpxq ` cuq “ T pcd g ‘ fq.\nProof. We show that the bounds on the numbers of connected positive (i.e., above c) and negative (i.e., below c) regions are as we claimed in (i). The tropical hypersurface of f divides Rd into N pfq convex regions C1, . . . , CN pfq such that f is linear on each Ci. As g is piecewise linear and convex over Rd, f m g “ f ´ g is piecewise linear and concave on each Ci. Since the level set tx : fpxq ´ gpxq “ cu and the superlevel set tx : fpxq ´ gpxq ě cu must be convex by the concavity of f ´ g, there is at most one positive region in each Ci. Therefore the total number of connected positive regions cannot exceed N pfq. Likewise, the tropical hypersurface of g divides Rd into N pgq convex regions on each of which f m g is convex. The same argument shows that the number of connected negative regions does not exceed N pgq.\nWe next address (ii). Upon rearranging terms, the level set becomes\nB “ x P Rd : fpxq “ gpxq ` c ( .\nSince fpxq and gpxq ` c are both tropical polynomial, we have\nfpxq “ b1xα1 ‘ ¨ ¨ ¨ ‘ brxαr , gpxq ` c “ c1xβ1 ‘ ¨ ¨ ¨ ‘ csxβs ,\nwith appropriate multiindices α1, . . . , αr, β1, . . . , βs, and real coefficients b1, . . . , br, c1, . . . , cs. By the assumption on the monomials, we have that x0 P B only if there exist i, j so that αi ‰ βj and bixαi0 “ cjx βj 0 . This completes the proof since if we combine the monomials of fpxq and gpxq ` c by (tropical) summing them into a single tropical polynomial, maxtfpxq, gpxq ` cu, the above implies that on the level set, the value of the combined tropical polynomial is attained by at least two monomials and therefore x0 P T pmaxtfpxq, gpxq ` cuq.\nProposition 6.1 follows immediately from Proposition D.1 since the decision boundary tx P Rd : νpxq “ s´1pcqu is a level set of the tropical rational function ν."}, {"heading": "D.7. Proof of Theorem 6.3", "text": "The linear regions of a tropical polynomial map F P Polpd,mq are all convex but this is not necessarily the case for a tropical rational map F P Ratpd, nq. Take for example a bivariate real-valued function fpx, yq whose graph in R3 is a pyramid with base tpx, yq P R2 : x, y P r´1, 1su and zero everywhere else, then the linear region where f vanishes is R2ztpx, yq P R2 : x, y P r´1, 1su, which is nonconvex. The nonconvexity invalidates certain geometric arguments that only apply in the convex setting. Nevertheless there is a way to subdivide each of the nonconvex linear regions into convex ones to get ourselves back into the convex setting. We will start with the number of convex linear regions for tropical rational maps although later we will deduce the required results for the number of linear regions (without imposing convexity).\nWe first extend the notion of tropical hypersurface to tropical rational maps: Given a tropical rational map F P Ratpd,mq, we define T pF q to be the boundaries between adjacent linear regions. When F “ pf1, . . . , fmq P Polpd,mq, i.e., a tropical polynomial map, this set is exactly the union of tropical hypersurfaces T pfiq, i “ 1, . . . ,m. Therefore this definition of T pF q extends Definition 3.1.\nFor a tropical rational map F , we will examine the smallest number of convex regions that form a refinement of T pF q. For brevity, we will call this the convex degree of F ; for consistency, the number of linear regions of F we will call its linear degree. We define convex degree formally below. We will write F |C to mean the restriction of map F to C Ď Rd. Definition D.1. The convex degree of a tropical rational map F P Ratpd, nq is the minimum division of Rd into convex regions over which F is linear, i.e.\nNcpF q :“ min n : C1 Y ¨ ¨ ¨ Y Cn “ Rd, Ci convex, F |Ci linear ( .\nNote that C1, . . . , CNcpF q either divide Rd into the same regions as T pF q or form a refinement.\nFor m ď d, we will denote by NcpF | mq the maximum convex degree obtained by restricting F to an m-dimensional affine subspace in Rd, i.e.,\nNcpF | mq :“ max NcpF |Ωq : Ω Ď Rd is an m-dimensional affine space ( .\nFor any F P Ratpd, nq, there is at least one tropical polynomial map that subdivides T pF q, and so convex degree is welldefined (e.g., if F “ pp1 m q1, . . . , pn m qnq P Ratpd, nq, then we may choose P “ pp1, . . . , pn, q1, . . . , qnq P Polpd, 2nq). Since the linear regions of a tropical polynomial map are always convex, we have N pF q “ NcpF q for any F P Polpd, nq.\nLet F “ pf1, . . . , fnq P Ratpd, nq and α “ pa1, . . . , anq P Zn. Consider the tropical rational function3\nFα :“ αTF “ a1f1 ` ¨ ¨ ¨ ` anfn “ n ä\nj“1 f aj j P Ratpd, 1q.\nFor some α, Fα may have fewer linear regions than F , e.g, α “ p0, . . . , 0q. As such, we need the following notion. Definition D.2. α “ pa1, . . . , anq P Zn is said to be a general exponent of F P Ratpd, nq if the linear regions of Fα and the linear regions of F are identical.\nWe show that general exponent always exists for any F P Ratpd, nq and may be chosen to have all entries nonnegative. Lemma D.2. Let F P Ratpd, nq. Then\n(i) N pFαq “ N pF q if and only if α is a general exponent; (ii) F has a general exponent α P Nn.\nProof. It follows from the definition of tropical hypersuface that T pFαq and T pF q comprise respectively the points x P Rd at which Fα and F are not differentiable. Hence T pFαq Ď T pF q, which implies that N pFαq ă N pF q unless T pFαq “ T pF q. This concludes (i).\nFor (ii), we need to show that there always exists an α P Nn such that Fα divides its domain Rd into the same set of linear regions as F . In other words, for every pair of adjacent linear regions of F , the pd ´ 1q-dimensional face in T pF q that separates them is also present in T pFαq and so T pFαq Ě T pF q.\nLet L and M be adjacent linear regions of F . The differentials of F |L and F |M must have integer coordinates, i.e., dF |L, dF |M P Znˆd. Since L and M are distinct linear regions, we must have dF |L ‰ dF |M (or otherwise L and M can be merged into a single linear region). Note that the differentials of Fα|L and Fα|M are given by αTdF |L and αTdF |M .\nTo ensure the pd´ 1q-dimensional face separating L and M still exists in T pFαq, we need to choose α so that αTdF |L ‰ αTdF |M . Observe that the solution to pdF |L ´ dF |M qTα “ 0 is contained in a one-dimensional subspace of Rn.\nLet ApF q be the collection of all pairs of adjacent linear regions of F . Since the set of α that degenerates two adjacent linear regions into a single one, i.e.,\nS :“ ď\npL,MqPApF q\nα P Nn : pdF |L ´ dF |M q Tα “ 0q\n(\n,\nis contained in a union of a finite number of hyperplanes in Rn, S cannot cover the entire lattice of nonnegative integers Nn. Therefore the set Nn X pRnzSq is nonempty and any of its element is a general exponent for F .\nLemma D.2 shows that we may study the linear degree of a tropical rational map by studying that of a tropical rational function, for which the results in Section 3.1 apply.\nWe are now ready to prove a key result on the convex degree of composition of tropical rational maps.\nTheorem D.3. Let F “ pf1, . . . , fmq P Ratpn,mq and G P Ratpd, nq. Define H “ ph1, . . . , hmq P Ratpd,mq by\nhi :“ fi ˝G, i “ 1, . . . ,m.\nThen N pHq ď NcpHq ď NcpF | dq ¨NcpGq.\nProof. Only the upper bound requires a proof. Let k “ NcpGq. By the definition of NcpGq, there exist convex sets C1, . . . , Ck Ď Rd whose union is Rd and on each of which G is linear. So G|Ci is some affine function ρi. For any i,\nNcpF ˝ ρiq ď NcpF | dq, 3This is in the sense of a tropical power but we stay consistent to our slight abuse of notation and write Fα instead of Fdα.\nby the definition of NcpF | dq. Since F ˝G “ F ˝ ρi on Ci, we have\nNcpF ˝Gq ď k ÿ\ni“1 NcpF ˝ ρiq.\nHence\nNcpF ˝Gq ď k ÿ\ni“1 NcpF ˝ ρiq ď\nk ÿ i“1 NcpF | dq “ NcpF | dq ¨NcpGq.\nWe now apply our observations on tropical rational functions to neural networks. The next lemma follows directly from Corollary 3.4.\nLemma D.4. Let σplq ˝ ρplq : Rnl´1 Ñ Rnl where σplq and ρplq are the affine transformation and activation of the lth layer of a neural network. If d ď nl, then\nNcpσplq ˝ ρplq | dq ď d ÿ i“0 pnl i q .\nProof. Ncpσplq ˝ ρplq | dq is the maximum convex degree of a tropical rational map F “ pf1, . . . , fnlq : Rd Ñ Rnl of the form\nfipxq :“ σplqi ˝ ρ plq ˝ pb1 d xα1 , . . . , bnl´1 d x αnl´1 q, i “ 1, . . . , nl.\nFor a general affine transformation ρplq,\nρplqpb1 d xα1 , . . . , bnl´1 d x αnl´1 q “ ` b11 d xα 1 1 , . . . , b1nl d x α1nl ˘ “: Gpxq\nfor some α11, . . . , α 1 nl and b11, . . . , b 1 nl , and we denote this map by G : Rd Ñ Rnl . So fi “ σplqi ˝G. By Theorem D.3, we have Ncpσplq ˝ ρplq | dq “ Ncpσplq | dq ¨NcpGq “ Ncpσplq | dq; note that NcpGq “ 1 as G is a linear function.\nWe have thus reduced the problem to determining a bound on the convex degree of a single layer neural network with nl nodes ν “ pν1, . . . , νnlq : Rd Ñ Rnl . Let γ “ pc1, . . . , cnlq P Nnl be a nonnegative general exponent for ν. Note that\nnl ä j“1 ν cj j “ nl ä j“1 „ˆ d ä i“1 bi d xa ` ji ˙ ‘ ˆ d ä i“1 xa ´ ji ˙ d tj cj ´ nl ä j“1 ˆ d ä i“1 xa ´ ji ˙cj .\nSince the last term is linear in x, we may drop it without affecting the convex degree of the entire expression. It remains to determine an upper bound for the number of linear regions of the tropical polynomial\nhpxq “ nl ä\nj“1\n„ˆ d ä\ni“1 bi d xa\n` ji\n˙ ‘ ˆ d ä\ni“1 xa ´ ji\n˙ d tj cj ,\nwhich we will obtain by counting vertices of the polytope Pphq. By Propositions 3.1 and 3.2 the polytope Pphq is given by a weighted Minkowski sum\nnl ÿ j“1 cjP „ˆ d ä i“1 bi d xa ` ji ˙ ‘ ˆ d ä i“1 xa ´ ji ˙ d tj  .\nBy Proposition 3.2 again,\nP „ˆ d ä\ni“1 bi d xa\n` ji\n˙ ‘ ˆ d ä\ni“1 xa ´ ji\n˙ d tj  “ Conv ` VpPpfqq Y VpPpgqq ˘\nwhere\nfpxq “ d ä\ni“1 bi d xa\n` ji and gpxq “\nˆ d ä\ni“1 xa ´ ji\n˙\nd tj\nare tropical monomials. Therefore Ppfq, Ppgq are just points in Rd`1 and Conv ` VpPpfqq Y VpPpgqq ˘ is a line in Rd`1. Hence Pphq is a Minkowski sum of nl line segments in Rd`1, i.e., a zonotope, and Corollary 3.4 completes the proof.\nUsing Lemma D.4, we obtain a bound on the number of linear regions created by one layer of a neural network.\nTheorem D.5. Let ν : Rd Ñ RnL be an L-layer neural network satisfying assumptions (a)–(c) with F plq, Gplq,Hplq, and νplq as defined in Proposition 5.1. Let nl ě d for all l “ 1, . . . , L. Then\nNcpνp1qq “ N pGp1qq “ N pHp1qq “ 1, Ncpνpl`1qq ď Ncpνplqq ¨ d ÿ i“0 pnl`1 i q .\nProof. The l “ 1 case follows from the fact that Gp1qpxq “ Ap1q´ x and Hp1qpxq “ A p1q ` x` bp1q are both linear, which in turn forces Ncpνp1qq “ 1 as in the proof of Lemma D.4. Since νplq “ pσplq ˝ ρplqq ˝ νpl´1q, the recursive bound follows from Theorem D.3 and Lemma D.4.\nTheorem 6.3 follows from applying Theorem D.5 recursively."}], "year": 2018, "references": [{"title": "Understanding deep neural networks with rectified linear units", "authors": ["Arora", "Raman", "Basu", "Amitabh", "Mianjy", "Poorya", "Mukherjee", "Anirbit"], "venue": "International Conference on Learning Representations,", "year": 2018}, {"title": "Neural machine translation by jointly learning to align and translate", "authors": ["Bahdanau", "Dzmitry", "Cho", "Kyunghyun", "Bengio", "Yoshua"], "year": 2014}, {"title": "On the expressive power of deep architectures", "authors": ["Bengio", "Yoshua", "Delalleau", "Olivier"], "venue": "In International Conference on Algorithmic Learning Theory,", "year": 2011}, {"title": "Convex optimization", "authors": ["Boyd", "Stephen", "Vandenberghe", "Lieven"], "year": 2004}, {"title": "Max-linear systems: theory and algorithms", "authors": ["Butkovič", "Peter"], "venue": "Springer Science & Business Media,", "year": 2010}, {"title": "Shallow vs. deep sum-product networks", "authors": ["Delalleau", "Olivier", "Bengio", "Yoshua"], "venue": "In Advances in Neural Information Processing Systems,", "year": 2011}, {"title": "The power of depth for feedforward neural networks", "authors": ["Eldan", "Ronen", "Shamir", "Ohad"], "venue": "In Conference on Learning Theory,", "year": 2016}, {"title": "Max-plus convex geometry", "authors": ["Gaubert", "Stéphane", "Katz", "Ricardo"], "venue": "In International Conference on Relational Methods in Computer Science. Springer,", "year": 2006}, {"title": "On the interpretation of whitney numbers through arrangements of hyperplanes, zonotopes, non-radon partitions, and orientations of graphs", "authors": ["Greene", "Curtis", "Zaslavsky", "Thomas"], "venue": "Transactions of the American Mathematical Society,", "year": 1983}, {"title": "Minkowski addition of polytopes: computational complexity and applications to gröbner bases", "authors": ["Gritzmann", "Peter", "Sturmfels", "Bernd"], "venue": "SIAM Journal on Discrete Mathematics,", "year": 1993}, {"title": "Zonotopes as bounding volumes", "authors": ["Guibas", "Leonidas J", "Nguyen", "An", "Zhang", "Li"], "venue": "In Proceedings of 14th Annual ACM-SIAM Symposium on Discrete Algorithms,", "year": 2003}, {"title": "On functions representable as a difference of convex functions", "authors": ["Hartman", "Philip"], "venue": "Pacific Journal of Mathematics,", "year": 1959}, {"title": "Tropical algebraic geometry, volume 35", "authors": ["Itenberg", "Ilia", "Mikhalkin", "Grigory", "Shustin", "Eugenii I"], "venue": "Springer Science & Business Media,", "year": 2009}, {"title": "Recurrent continuous translation models", "authors": ["Kalchbrenner", "Nal", "Blunsom", "Phil"], "venue": "In Proceedings of the 2013 Conference on Empirical Methods in Natural Language Processing,", "year": 2013}, {"title": "Imagenet classification with deep convolutional neural networks", "authors": ["Krizhevsky", "Alex", "Sutskever", "Ilya", "Hinton", "Geoffrey E"], "venue": "In Advances in Neural Information Processing Systems,", "year": 2012}, {"title": "Introduction to tropical geometry, volume 161", "authors": ["Maclagan", "Diane", "Sturmfels", "Bernd"], "venue": "American Mathematical Society,", "year": 2015}, {"title": "On the number of linear regions of deep neural networks", "authors": ["Montufar", "Guido F", "Pascanu", "Razvan", "Cho", "Kyunghyun", "Bengio", "Yoshua"], "venue": "In Advances in Neural Information Processing Systems,", "year": 2014}, {"title": "Exponential expressivity in deep neural networks through transient chaos", "authors": ["Poole", "Ben", "Lahiri", "Subhaneil", "Raghu", "Maithra", "SohlDickstein", "Jascha", "Ganguli", "Surya"], "venue": "In Advances in Neural Information Processing Systems,", "year": 2016}, {"title": "On the expressive power of deep neural networks", "authors": ["Raghu", "Maithra", "Poole", "Ben", "Kleinberg", "Jon", "Ganguli", "Surya", "Sohl-Dickstein", "Jascha"], "venue": "In International Conference on Machine Learning,", "year": 2017}, {"title": "The dc (difference of convex functions) programming and dca revisited with dc models of real world nonconvex optimization problems", "authors": ["Tao", "Pham Dinh", "Hoai An", "Le Thi"], "venue": "Annals of Operations Research,", "year": 2005}, {"title": "Region configurations for realizability of lattice piecewise-linear models", "authors": ["JM Tarela", "Martinez", "MV"], "venue": "Mathematical and Computer Modelling,", "year": 1999}, {"title": "Understanding deep learning requires rethinking generalization", "authors": ["Zhang", "Chiyuan", "Bengio", "Samy", "Hardt", "Moritz", "Recht", "Benjamin", "Vinyals", "Oriol"], "year": 2016}], "id": "SP:52b767e22072f323121ea14358e215ac7ce2487d", "authors": [{"name": "Liwen Zhang", "affiliations": []}, {"name": "Gregory Naitzat", "affiliations": []}, {"name": "Lek-Heng Lim", "affiliations": []}], "abstractText": "We establish, for the first time, connections between feedforward neural networks with ReLU activation and tropical geometry — we show that the family of such neural networks is equivalent to the family of tropical rational maps. Among other things, we deduce that feedforward ReLU neural networks with one hidden layer can be characterized by zonotopes, which serve as building blocks for deeper networks; we relate decision boundaries of such neural networks to tropical hypersurfaces, a major object of study in tropical geometry; and we prove that linear regions of such neural networks correspond to vertices of polytopes associated with tropical rational functions. An insight from our tropical formulation is that a deeper network is exponentially more expressive than a shallow network.", "title": "Tropical Geometry of Deep Neural Networks"}